var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ حَدَّثَنَا سُفْيَانُ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عُثْمَانَ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى مَيَامِنِ الصُّفُوفِ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’بے شک اللہ تعالیٰ صفوں کی دائیں جناب پر رحمتیں نازل کرتا ہے اور فرشتے اس کے لئے دعائے خیر کرتے ہیں۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[1005] إن اللّٰہ و ملائکتہ یصلون علی میامن الصفوف
إسنادہ ضعیف / د 676 باب فضل میمنۃ الصف`;
ibnemaja.anwaar = [413,1];