var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَطَبَ فِي الْحَرْبِ خَطَبَ عَلَى قَوْسٍ وَإِذَا خَطَبَ فِي الْجُمُعَةِ خَطَبَ عَلَى عَصًا";
ibnemaja.urdu = "(نبی ﷺ کے مؤذن) سیدنا سعد القرظ رضی اللہ عنہ سے روایت ہے کہ انہوں نے فرمایا: رسول اللہ ﷺ جب جنگ کے دوران میں خطبہ دیتے تو کمان ہاتھ میں لے کر خطبہ دیتے اور جب جمعے کا خطبہ دیتے تو عصا ہاتھ میں لے کر خطبہ دیتے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1107] کان إذا خطب فی الحرب خطب علی قوس
إسنادہ ضعیف باب ما جاء فی الخطبۃ یوم الجمعۃ
عبد الرحمٰن بن سعد : ضعیف،انظر الحدیث السابق (1101) والسند ضعفہ البوصیري۔`;
ibnemaja.anwaar = [416,1];