var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَأَبُو يُوسُفَ الرَّقِّيُّ مُحَمَّدُ بْنُ أَحْمَدَ الصَّيْدَلَانِيُّ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ خُصَيْفٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ قَالَ سَأَلْنَا عَائِشَةَ بِأَيِّ شَيْءٍ كَانَ يُوتِرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ يَقْرَأُ فِي الرَّكْعَةِ الْأُولَى بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَفِي الثَّانِيَةِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَفِي الثَّالِثَةِ قُلْ هُوَ اللَّهُ أَحَدٌ وَالْمُعَوِّذَتَيْنِ";
ibnemaja.urdu = "سیدنا عبدالعزیز بن جریج رحمہ اللہ سےروایت ہے،انہوں نے فرمایا: ہم نے سیدہ عائشہ رضی اللہ عنہا سے دریافت کیا: رسول اللہ ﷺ نماز وتر میں کیا پڑھتے تھے؟ تو انہوں نے فرمایا: آپ ﷺ پہلی رکعت میں (سبح اسم ربک الاعلی) دوسری رکعت میں (قل یایھاالکافرون) اورتیسری رکعت میں (قل ھواللہ احد) اور معوذتیں (سورۃ الفلق اور سورۃ الناس) پڑھتے تھے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1173] کان یقرأ فی الرکعۃ الأولی بسبح اسم ربک الأعلی
إسنادہ ضعیف/ د 1424،ت 463 [بل ھو حدیث حسن ]  باب ما جاء فیما یقرأ فی الوتر`;
ibnemaja.anwaar = [419,1];