var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى حَدَّثَنَا شَرِيكٌ عَنْ جَابِرٍ عَنْ عَامِرٍ عَنْ ابْنِ عَبَّاسٍ وَابْنِ عُمَرَ قَالَا سَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ السَّفَرِ رَكْعَتَيْنِ وَهُمَا تَمَامٌ غَيْرُ قَصْرٍ وَالْوِتْرُ فِي السَّفَرِ سُنَّةٌ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما اور سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے سفر کی نماز دو رکعت مقرر فرمائی ہے۔یہ مکمل نماز ہے،ناقص نہیں،اور سفر میں وترپڑھنا سنت ہے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1194] سن رسول اللّٰہ ﷺ صلاۃ السفر رکعتین
إسنادہ ضعیف جدًا    باب ما جاء فی الوتر فی السفر
جابر الجعفي : ضعیف رافضي ( تقدم : 356 ) والحدیث ضعفہ البوصیري۔`;
ibnemaja.anwaar = [420,1];