var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَاتِمُ بْنُ بَكْرٍ الضَّبِّيُّ حَدَّثَنَا مُحَمَّدُ بْنُ يَعْلَى زُنْبُورٌ حَدَّثَنَا عَنْبَسَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ نَافِعٍ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَ قَالَتْ نُهِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقُنُوتِ فِي الْفَجْرِ";
ibnemaja.urdu = "ام المومنین ام سلمہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ کو فجر کی نماز میں قنوت پڑھنے سے منع فرما دیا گیا تھا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1242] نھی رسول اللّٰہ ﷺ عن القنوت فی الفجر
إسنادہ موضوع    باب ما جاء فی القنوت في صلاۃ الفجر
عنبسۃ بن عبد الرحمٰن : متروک متھم (تقدم : 263) `;
ibnemaja.anwaar = [420,1];