var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَ إِنَّ مِنْ السُّنَّةِ أَنْ يُمْشَى إِلَى الْعِيدِ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نماز عید کے لیے چل کر جانا سنت ہے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1296] إن من السنۃ أن یمشي إلی العید
إسنادہ ضعیف / ت 530 باب ما جاء فی الخروج إلی العید ما شیًا
الحارث الأعور : ضعیف ( تقدم : 375 ) وأبو إسحاق : عنعن ( تقدم : 46 ) `;
ibnemaja.anwaar = [422,1];