var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا شَرِيكٌ عَنْ مُغِيرَةَ عَنْ عَامِرٍ قَالَ شَهِدَ عِيَاضٌ الْأَشْعَرِيُّ عِيدًا بِالْأَنْبَارِ فَقَالَ مَا لِي لَا أَرَاكُمْ تُقَلِّسُونَ كَمَا كَانَ يُقَلَّسُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
ibnemaja.urdu = "سیدنا عامر رحمہ اللہ عنہ سے روایت ہے انہوں نے فرمایا: سیدنا عیاش اشعری رضی اللہ عنہ نے ایک عید انبار میں منائی تو فرمایا: کیا بات ہے میں تمہیں گاتے بجاتے نہیں دیکھ رہا جس طرح رسول اللہ ﷺ کی موجودگی میں گانا بجانا ہوتا تھا؟";
ibnemaja.hukam = "";
ibnemaja.description = `[1302] ما لي لا أراکم تقلسون ؟
إسنادہ ضعیف باب ما جاء فی التقلیس یوم العید
شریک القاضي و مغیرۃ عنعنا (شریک،تقدم : 680،مغیرۃ : مدلس،ضعیف سنن أبي داود : 1073)`;
ibnemaja.anwaar = [422,1];