var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا عِيسَى بْنُ عَبْدِ الْأَعْلَى بْنِ أَبِي فَرْوَةَ قَالَ سَمِعْتُ أَبَا يَحْيَى عُبَيْدَ اللَّهِ التَّيْمِيَّ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَ أَصَابَ النَّاسَ مَطَرٌ فِي يَوْمِ عِيدٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِهِمْ فِي الْمَسْجِدِ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کے زمانے میں (ایک دفعہ) عید کے دن بارش ہوگئی تو آپ نے مسجد میں نماز (عید) پڑھائی۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1313] أصاب الناس مطر في یوم عید
إسنادہ ضعیف / د 1160    باب ما جاء في صلاۃ العید فی المسجد إذا کان مطر`;
ibnemaja.anwaar = [423,1];