var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ حَدَّثَنَا نَائِلُ بْنُ نَجِيحٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ زِيَادٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُلْبَسَ السِّلَاحُ فِي بِلَادِ الْإِسْلَامِ فِي الْعِيدَيْنِ إِلَّا أَنْ يَكُونُوا بِحَضْرَةِ الْعَدُوِّ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے مسلمانوں کے علاقے میں عیدین کے موقع پر ہتھیار پہننے سے منع فرمایا،الا یہ کہ وہ دشمن کے مقابل ہوں۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1314] أن النبيﷺ نھی أن یلبس السلاح
إسنادہ ضعیف جدًا    باب ما جاء في لبس السلاح في یوم العید
إسماعیل بن زیاد : متروک کذبوہ (تق : 446) ونائل بن نجیح : ضعیف ( تق:7089)`;
ibnemaja.anwaar = [423,1];