var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا حَجَّاجُ بْنُ تَمِيمٍ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ يَوْمَ الْفِطْرِ وَيَوْمَ الْأَضْحَى";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ عید الفطر اور عید الاضحیٰ کے دن غسل کیا کرتے تھے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1315] کان یغتسل یوم الفطر ویوم الأضحی
إسنادہ ضعیف جدًا    باب ما جاء فی الإغتسال فی العیدین
جبارۃ :ضعیف ( تقدم : 740 ) والحجاج بن تمیم : ضعیف ( تق : 1120) 
والسند ضعفہ الحافظ فی الدرایۃ (ح36،فصل فی الغسل )`;
ibnemaja.anwaar = [423,1];