var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا مَسْلَمَةُ بْنُ عُلَيٍّ قَالَ: حَدَّثَنَا ابْنُ جُرَيْجٍ،عَنْ حُمَيْدٍ الطَّوِيلِ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَعُودُ مَرِيضًا إِلَّا بَعْدَ ثَلَاثٍ»";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ تین دن کے بعد ہی بیمار کی عیادت فرماتے تھے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1437] کان لا یعود مریضًا إلا بعد ثلاث
إسنادہ ضعیف جدًا    باب ما جاء في عیادۃ المریض
مسلمۃ بن علي : متروک ( تقدم : 351) `;
ibnemaja.anwaar = [428,1];