var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ قَالَ: حَدَّثَنَا أَبُو يَحْيَى الْحِمَّانِيُّ،عَنِ الْأَعْمَشِ،عَنْ يَزِيدَ الرَّقَاشِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ،قَالَ: دَخَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى مَرِيضٍ يَعُودُهُ،فَقَالَ: «أَتَشْتَهِي شَيْئًا؟ أَتَشْتَهِي كَعْكًا؟» قَالَ: نَعَمْ،فَطَلَبُوا لَهُ";
ibnemaja.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے انہوں نے فرمایا: نبی ﷺ ایک بیمار کے پاس اس کی عیادت کے لیے تشریف لے گئے۔آپ نے فرمایا: ’’تمہارا کسی چیز کو جی چاہتا ہے؟ کیا کعک کی خواہش ہے؟‘‘ اس نے کہا: ہاں،چنانچہ صحابہ رضی اللہ عنہم نے اسے کعک (ایک خاص قسم کی روٹی) منگوادی۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1440] أتشتھي شیئًا ؟ أتشتھي کعکًا
إسنادہ ضعیف / یأتي : 3441   باب ما جاء في عیادۃ المریض
یزید بن أبان : زاہد ضعیف ( تقدم : 431 ) `;
ibnemaja.anwaar = [428,1];