var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَلِيُّ بْنُ مُحَمَّدٍ،قَالَا: حَدَّثَنَا وَكِيعٌ،عَنْ سُفْيَانَ،عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ،عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ،عَنْ عَائِشَةَ،قَالَتْ: «قَبَّلَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عُثْمَانَ بْنَ مَظْعُونٍ وَهُوَ مَيِّتٌ،فَكَأَنِّي أَنْظُرُ إِلَى دُمُوعِهِ تَسِيلُ عَلَى خَدَّيْهِ»";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ نے عثمان بن مظعون رضی اللہ عنہ کو ان کی وفات کے بعد بوسہ دیا،گویا میں نبی ﷺ کے رخساروں پر آنسو بہتے دیکھ رہی ہوں۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1456] قبل رسول اللّٰہ ﷺ عثمان بن مظعون
إسنادہ ضعیف / د 3163،ت 989    باب ما جاء في تقبیل المیت`;
ibnemaja.anwaar = [429,1];