var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ قَالَ: حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ: حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ،عَنِ الْحَكَمِ،عَنْ مِقْسَمٍ،عَنِ ابْنِ عَبَّاسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ «قَرَأَ عَلَى الْجِنَازَةِ بِفَاتِحَةِ الْكِتَابِ»";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی ﷺ نے نماز جنازہ میں سورہٴ فاتحہ پڑھی۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1495] أن النبيﷺ قرأ علی الجنازۃ بفاتحۃ الکتاب
إسنادہ ضعیف جدًا / ت 1026   باب ما جاء فی القراء ۃ علی الجنازۃ
وحدیث البخاري ( 1335) یغني عنہ۔`;
ibnemaja.anwaar = [431,1];