var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الرَّبِيعُ بْنُ بَدْرٍ قَالَ: حَدَّثَنَا أَبُو الزُّبَيْرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اسْتَهَلَّ الصَّبِيُّ،صُلِّيَ عَلَيْهِ وَوُرِثَ»";
ibnemaja.urdu = "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’جب بچہ(پیدائش کے وقت) روئے تو(اس کے فوت ہونے پر) اس کا جنازہ پڑھا جائے اور اس کی وراثت تقسیم کی جائے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[1508] إذا استھل الصبي صلی علیہ وورث
ضعیف /ت 1532،یأتي : 2750   باب ما جاء فی الصلوۃ علی الطفل
الربیع بن بدر : متروک (تقدم: 972) وللحدیث شواہد کلھا ضعیفۃ۔`;
ibnemaja.anwaar = [432,1];