var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنِ ابْنِ أَبِي ذِئْبٍ،عَنْ صَالِحٍ،مَوْلَى التَّوْأَمَةِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَلَّى عَلَى جِنَازَةٍ فِي الْمَسْجِدِ،فَلَيْسَ لَهُ شَيْءٌ»";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’جس نے مسجد میں جنازہ پڑھا،اس کے لئے کچھ نہیں۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[1517] من صلّی علٰی جنازۃ فی المسجد
إسنادہ ضعیف / د 3191    باب ماجاء فی الصلوۃ علی الجنازۃ فی المسجد`;
ibnemaja.anwaar = [433,1];