var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ الْمَلِكِ النَّوْفَلِيُّ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَسِقْطٌ أُقَدِّمُهُ بَيْنَ يَدَيَّ أَحَبُّ إِلَيَّ مِنْ فَارِسٍ أُخَلِّفُهُ خَلْفِي";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’مجھے ساقط الحمل بچہ اپنے آگے بھیجنا،سوار اپنے پیچھے چھوڑنے سے زیادہ پسند ہے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[1607] لسقط أقدمہ بین یدي أحب إلي
إسنادہ ضعیف باب ما جاء فیمن أصیب بسقط
یزید بن عبدالملک :ضعیف (تق: 7751) وقال الھیثمي : وھو متروک ضعفہ جمھور الأئمۃ ( مجمع الزوائد 91/4) و قال : و قد ضعفہ أکثر الناس ( أیضًا1/ 245) و یزید بن رومان لم یدرک أبا ہریرۃ رضي اللّٰہ عنہ۔`;
ibnemaja.anwaar = [436,1];