var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو إِسْمَعِيلَ الْمُؤَدِّبُ عَنْ مُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خَيْرِ خِصَالِ الصَّائِمِ السِّوَاكُ";
ibnemaja.urdu = "عائشہ رضی اللہ عنہا سے روایت ہے رسول اللہ ﷺ نے فرمایا: ’’روزے دار کے بہترین اعمال میں سے ایک عمل مسواک بھی ہے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[1677] من خیر خصال الصائم السواک
إسنادہ ضعیف باب ما جاء فی السواک والکحل للصائم
مجالد : ضعیف ( تقدم : 11) `;
ibnemaja.anwaar = [440,1];