var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ عَنْ ابْنِ لَهِيعَةَ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ أَبِي فِرَاسٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرٍو يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ صَامَ نُوحٌ الدَّهْرَ إِلَّا يَوْمَ الْفِطْرِ وَيَوْمَ الْأَضْحَى";
ibnemaja.urdu = "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: ’’نوح  عید الفطر کا دن اورعید الاضحیٰ کا دن چھوڑ کر ہمیشہ روزہ رکھتے تھے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[1714] صام نوح الدھر إلایوم الفطر
إسنادہ ضعیف باب ما جاء في صیام نوح علیہ السلام
ابن لہیعۃ عنعن ( تقدم : 330) وقال البوصیري: ’’ ھذا إسناد ضعیف،لضعف ابن لہیعۃ ‘‘۔`;
ibnemaja.anwaar = [441,1];