var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سُلَيْمَانَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النِّسَاءَ أَنْ يَصُمْنَ إِلَّا بِإِذْنِ أَزْوَاجِهِنَّ";
ibnemaja.urdu = "ابو سعید رضی اللہ عنہ سے روایت ہے انہوں نے کہا: رسول اللہ ﷺ نے عورتوں کو اپنے خاوندوں کی اجازت کے بغیر روزہ رکھنے سے منع فرمایا ہے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1762] نھی رسول اللّٰہ ﷺ النساء أن یصمن
إسنادہ ضعیف/ د 2459 باب فی المرأۃ تصوم بغیر إذن زوجھا`;
ibnemaja.anwaar = [443,1];