var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَبِي إِسْحَاقَ،عَنِ الْحَارِثِ،عَنْ عَلِيٍّ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: «تَجَوَّزْتُ لَكُمْ عَنْ صَدَقَةِ الْخَيْلِ وَالرَّقِيقِ»";
ibnemaja.urdu = "حضرت علی رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: میں نے تمہیں گھوڑوں اور غلاموں کی زکاۃ معاف کر دی ہے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1813] تجوزت لکم عن صدقۃ الخیل و الرقیق
إسنادہ ضعیف باب صدقۃ الخیل و الرقیق
حارث الأعور ضعیف ( تقدم : 95 ) و أبو إسحاق عنعن ( تقدم : 744 ) وانظر الحدیث السابق ( 1790 ) 
قلت : الحدیث السابق ( الأصل : 1812 ) یغني عنہ۔`;
ibnemaja.anwaar = [444,2];