var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سَلَّامُ بْنُ سَوَّارٍ قَالَ: حَدَّثَنَا كَثِيرُ بْنُ سُلَيْمٍ،عَنِ الضَّحَّاكِ بْنِ مُزَاحِمٍ،قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،يَقُولُ: «مَنْ أَرَادَ أَنْ يَلْقَى اللَّهَ طَاهِرًا مُطَهَّرًا،فَلْيَتَزَوَّجِ الْحَرَائِرَ»";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے سنا آپ فرما رہے تھے: جو شخص پاک صاف ہو کر اللہ سے ملاقات کرنا چاہتا ہے،اسے چاہیے کہ آزاد عورتوں سے نکاح کرے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1862] من أراد أن یلقی اللّٰہ طاھرًا مطھرًا
ضعیف    باب تزویج الحرائر والولود
سلام بن سوار: ضعیف (تق: 2704) وشیخہ کثیر بن سلیم : ضعیف (تق: 5613) وأوردہ ابن الجوزي فی الموضوعات (261/2) وللحدیث شاہد عند البخاري فی التاریخ (404/8) بدون سند واﷲ أعلم بحالہ۔`;
ibnemaja.anwaar = [447,1];