var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا مُعَاوِيَةُ بْنُ يَزِيدَ،عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ،عَنْ أَبِي الْخَيْرِ،عَنْ أَبِي رُهْمٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مِنْ أَفْضَلِ الشَّفَاعَةِ،أَنْ يُشَفَّعَ بَيْنَ الِاثْنَيْنِ فِي النِّكَاحِ»";
ibnemaja.urdu = "حضرت ابورہم (احزاب بن اسید) رحمۃ اللہ علیہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: سب سے افضل سفارش یہ ہے کہ دو افراد کے مابین نکاح کے لیے سفارش کی جائے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1975] من أفضل الشفاعۃ أن یشفع بین الإثنین
إسنادہ ضعیف باب الشفاعۃ فی التزویج
معاویۃ بن یحیی الصدفي ضعیف (تقدم : 842) `;
ibnemaja.anwaar = [449,1];