var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ: حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ قَالَ: حَدَّثَنَا شَرِيكٌ،عَنْ مَنْصُورٍ-ظَنَّهُ-عَنْ طَلْحَةَ،عَنْ خَيْثَمَةَ،عَنْ عَائِشَةَ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَمَرَهَا أَنْ تُدْخِلَ عَلَى رَجُلٍ امْرَأَتَهُ قَبْلَ أَنْ يُعْطِيَهَا شَيْئًا»";
ibnemaja.urdu = "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے انہیں حکم دیا کہ خاوند کے پاس اس کی بیوی کو بھیج دیں،حالانکہ اس نے ابھی اسے کوئی چیز نہیں دی تھی۔";
ibnemaja.hukam = "";
ibnemaja.description = `[1992] أن رسول اللّٰہ ﷺ أمرھا أن تدخل
إسنادہ ضعیف / د 2128    باب الرجل یدخل بأھلہ قبل أن یعطیہا شیئًا`;
ibnemaja.anwaar = [450,1];