var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ،وَيَحْيَى بْنُ حَكِيمٍ،قَالَا: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ: أَنْبَأَنَا مُحَمَّدُ بْنُ إِسْحَاقَ،عَنْ دَاوُدَ بْنِ الْحُصَيْنِ،عَنْ عِكْرِمَةَ،عَنِ ابْنِ عَبَّاسٍ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،رَدَّ ابْنَتَهُ عَلَى أَبِي الْعَاصِ بْنِ الرَّبِيعِ بَعْدَ سَنَتَيْنِ بِنِكَاحِهَا الْأَوَّلِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے اپنی بیٹی (حضرت زینب رضی اللہ عنہا) کو دو سال کے بعد،پہلے نکاح کی بنا پر ہی،حضرت ابوالعاص بن ربیع رضی اللہ عنہ کے پاس واپس بھیج دیا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2009] أن رسول اللّٰہ ﷺ ردّ ابنتہ علی أبی العاص
إسنادہ ضعیف / د 2240،ت 1143   باب الزوجین یسلم أحدھما قبل الآخر`;
ibnemaja.anwaar = [450,1];