var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنِ الْأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنِ الْأَسْوَدِ،عَنْ عَائِشَةَ،«أَنَّهَا أَعْتَقَتْ بَرِيرَةَ،فَخَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَكَانَ لَهَا زَوْجٌ حُرٌّ»";
ibnemaja.urdu = "ام المومنین حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ انہوں نے حضرت بریرہ رضی اللہ عنہا کو آزاد کیا تو رسول اللہ ﷺ نے انہیں اختیار دے دیا اور ان کا خاوند آزاد تھا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2074] أنھا أعتقت بریرۃ
إسنادہ ضعیف / د 2235،ت1155 باب خیار الأمۃ إذا أعتقت`;
ibnemaja.anwaar = [453,1];