var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا بَقِيَّةُ،عَنْ عَبْدِ اللَّهِ بْنِ مُحَرَّرٍ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،قَالَ: سَمِعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يَقُولُ: أَنَا إِذًا لَيَهُودِيٌّ،فَقَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَجَبَتْ»";
ibnemaja.urdu = "حضرت انس رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: نبی ﷺ نے سنا کہ ایک آدمی کہہ رہا تھا: (اگر یوں ہوا تو) یقینا میں اس وقت یہودی ہوں۔رسول اللہ ﷺ نے فرمایا: (یہودیو یا دوزخ) واجب ہو گئی۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2099] أو جبت
إسنادہ ضعیف جدًا    باب من حلف بملۃ غیرالإسلام
عبد اللّٰہ بن محرر : متروک (تق: 3573) والسند ضعفہ البوصیري لتدلیس بقیۃ بن الولید ( تقدم : 551) `;
ibnemaja.anwaar = [454,1];