var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ الصَّيْرَفِيُّ أَبُو حَفْصٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ زُبَيْدٍ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرِّبَا ثَلَاثَةٌ وَسَبْعُونَ بَابًا";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: سود کے تہتر دروازے ہیں۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2275] الربا ثلاثۃ و سبعون بابًا
إسنادہ ضعیف باب التغلیظ فی الربا
إبراھیم النخعي مدلس و عنعن ( د 2235 ) و مع ذلک صححہ الحاکم ( 2/ 37 ) و الذہبي والبوصیري ( ! ) 
و للحدیث شواھد ضعیفۃ انظر الحدیث السابق : 2274 `;
ibnemaja.anwaar = [460,1];