var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ قَالَ: حَدَّثَنَا عُثْمَانُ بْنُ أَبِي عَاتِكَةَ،عَنْ عَلِيِّ بْنِ يَزِيدَ،عَنِ الْقَاسِمِ،عَنْ أَبِي أُمَامَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَلَيْكُمْ بِهَذَا الْعِلْمِ قَبْلَ أَنْ يُقْبَضَ،وَقَبْضُهُ أَنْ يُرْفَعَ» وَجَمَعَ بَيْنَ إِصْبَعَيْهِ الْوُسْطَى وَالَّتِي تَلِي الْإِبْهَامَ،هَكَذَا. ثُمَّ قَالَ: «الْعَالِمُ وَالْمُتَعَلِّمُ شَرِيكَانِ فِي الْأَجْرِ،وَلَا خَيْرَ فِي سَائِرِ النَّاسِ»";
ibnemaja.urdu = "سیدنا ابو امامہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:’’اس علم(علم دین) کو اس کے قبض ہونے سے پہلے پہلے حاصل کر لو۔قبض(ہونے کا مطلب) یہ ہے کہ اسے اٹھالیا جائے گا۔‘‘ اس کے بعد آپ ﷺ نے درمیانی انگلی اور انگوٹھے کے ساتھ والی انگلی ملا کر(اشارہ کیا اور) فرمایا:’’عالم اور طالب علم ثواب میں شریک ہیں اور دوسرے لوگوں میں کوئی خیر نہیں۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[228] علیکم بھذا العلم قبل أن یقبض
إسنادہ ضعیف جدًا    باب فضل العلماء والحث علی طلب العلم
علي بن یزید : ضعیف (ت 1282) و عثمان بن أبی العاتکۃ : ضعیف ( د 472)`;
ibnemaja.anwaar = [382,1];