var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا جَرِيرٌ عَنْ مُسْلِمٍ الْمُلَائِيِّ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجِيبُ دَعْوَةَ الْمَمْلُوكِ";
ibnemaja.urdu = "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ غلام کی دعوت قبول کر لیا کرتے تھے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2296] کان رسول اللّٰہ ﷺ یجیب دعوۃ المملوک
إسنادہ ضعیف / ت 1017،یأتي: 4178    باب ما للعبد أن یعطي ویتصدق`;
ibnemaja.anwaar = [461,1];