var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ جَابِرٍ الْجُعْفِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا ضَرَرَ وَلَا ضِرَارَ";
ibnemaja.urdu = "حضرت عبداللہ بن عباس رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: نہ (پہلے پہل) کسی کو نقصان پہنچانا اور تکلیف دینا جائز ہے،نہ بدلے کے طور پر نقصان پہنچانا اور تکلیف دینا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2341] لا ضرر ولا إ ضرار
إسنادہ ضعیف جدًا    باب من بنی في حقہ ما یضر بجارہ
جابر الجعفي : ضعیف رافضي ( تقدم : 356 ) وانظر الحدیث السابق : 2340`;
ibnemaja.anwaar = [463,1];