var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ نبی ﷺ نے (مدعی کی) قسم اور ایک گواہ کے ساتھ فیصلہ فرمایا۔";
ibnemaja.hukam = "حسن یا صحیح";
ibnemaja.description = "یہ حدیث انوار الصحیفہ میں درج نہیں کی گئی، لہٰذا کم از کم حسن یا پھر صحیح ہے۔";