var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ مُجَالِدٍ عَنْ عَامِرٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجَازَ شَهَادَةَ أَهْلِ الْكِتَابِ بَعْضِهِمْ عَلَى بَعْضٍ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے اہل کتاب کی ایک دوسرے کے بارے میں گواہی کو معتبر قرار دیا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2374] أن رسول اللّٰہ ﷺ أجاز شھادۃ أھل الکتاب
إسنادہ ضعیف / د 4452 مطولاً باب شہادۃ أھل الکتاب بعضھم علی بعض
وضعفہ البوصیري من أجل مجالدبن سعید ( ضعیف،تقدم : 11 ) `;
ibnemaja.anwaar = [464,1];