var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُخْتَارِ عَنْ إِسْحَقَ بْنِ رَاشِدٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَغْلَقُ الرَّهْنُ";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: رہن رکھی ہوئی شے (مستقل طور پر) قرض خواہ کے پاس نہیں رہے گی۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2441] لا یغلق الرھن
إسنادہ ضعیف /سنن الدارقطني 3/ 32 ح 2897 وقال : ’’ وھذا إسناد حسن متصل ‘‘    باب لا یغلق الرھن
الزھري عنعن ( تقدم : 1268 ) فالسند غیر متصل۔`;
ibnemaja.anwaar = [467,1];