var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ حَدَّثَنَا الْقَاسِمُ بْنُ عَبْدِ الْوَاحِدِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخْوَفَ مَا أَخَافُ عَلَى أُمَّتِي عَمَلُ قَوْمِ لُوطٍ";
ibnemaja.urdu = "حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: مجھے اپنی امت پر جن گناہوں (میں مبتلا ہونے) کا خطرہ ہے،ان میں سے سب سے زیادہ خطرہ قوم لوط کے عمل (میں مبتلا ہونے) کا ہے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2563] إن أخوف ما أخاف علٰی أمتي
إسنادہ ضعیف/ ت 1457 باب من عمل عمل قوم لوط
ابن عقیل ضعیف ( تقدم : 352 )`;
ibnemaja.anwaar = [471,1];