var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُقْتَلُ بِالْوَلَدِ الْوَالِدُ";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’بیٹے کے بدلے میں باپ کو قتل نہ کیا جائے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[2661] لا یقتل بالولد الوالد
إسنادہ ضعیف/ تقدم : 2599    باب لا یقتل الوالد بولدہ`;
ibnemaja.anwaar = [474,1];