var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ الْعُرُوقِيُّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ سُفْيَانَ عَنْ جَابِرٍ عَنْ أَبِي عَازِبٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا قَوَدَ إِلَّا بِالسَّيْفِ";
ibnemaja.urdu = "نعمان بن بشیر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قصاص صرف تلوار سے ہوتا ہے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[2667] لا قود إلا بالسیف
إسنادہ ضعیف جدًا    باب لا قود إلا بالسیف
جابر الجعفي : ضعیف رافضي ( تقدم : 356 ) وأبو عازب :مستور (تق: 8194) `;
ibnemaja.anwaar = [475,1];