var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ حَدَّثَنَا هُشَيْمٌ عَنْ مُغِيرَةَ عَنْ شِبَاكٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَ قَالَ عَبْدُ اللَّهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَعَفِّ النَّاسِ قِتْلَةً أَهْلَ الْإِيمَانِ";
ibnemaja.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’قتل کرنے کے انداز میں بھی سب لوگوں سے زیادہ گناہ سے بچنے والے مومن ہی ہوتے ہیں۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[2681] إن من أعف الناس قتلۃ
إسنادہ ضعیف /د 2666 باب أعف الناس قتلۃ أھل الإیمان
مغیرۃ و إبراہیم النخعي عنعنا (تقدما : 1302،354) وانظر الحدیث الآتي : 2682 `;
ibnemaja.anwaar = [475,1];