var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ طَلْحَةَ بْنِ عَمْرٍو عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ تَصَدَّقَ عَلَيْكُمْ عِنْدَ وَفَاتِكُمْ بِثُلُثِ أَمْوَالِكُمْ زِيَادَةً لَكُمْ فِي أَعْمَالِكُمْ";
ibnemaja.urdu = "ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اللہ تعالیٰ نے تم پر یہ صدقہ کیا ہے کہ وفات کے وقت تمہیں تہائی مال (میں وصیت کا حق) دے دیا ہے تاکہ تمہارے نیک اعمال میں اضافہ ہو جائے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[2709] إن اللّٰہ تصدق علیکم عند وفاتکم
إسنادہ ضعیف باب الوصیۃ بالثلث
ضعفہ البوصیري من أجل طلحۃ بن عمرو : متروک (تقدم : 857) وتابعہ عقبۃ بن عبد اللّٰہ الأصم عن عطاء عند أبي نعیم فی الحلیۃ (322/3) وعقبۃ ضعیف ( تق :4642) وللحدیث طرق کلھا ضعیفۃ۔`;
ibnemaja.anwaar = [477,1];