var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ عَنْ شَرِيكٍ عَنْ لَيْثٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَّثَ جَدَّةً سُدُسًا";
ibnemaja.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے جدہ (نانی یا دادی) کو وراثت میں چھٹا حصہ دیا۔";
ibnemaja.hukam = "حسن یا صحیح";
ibnemaja.description = "یہ حدیث انوار الصحیفہ میں درج نہیں کی گئی، لہٰذا کم از کم حسن یا پھر صحیح ہے۔";