var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الرَّبِيعُ بْنُ بَدْرٍ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَهَلَّ الصَّبِيُّ صُلِّيَ عَلَيْهِ وَوَرِثَ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہﷺ نے فرمایا: جب بچہ آواز نکالے تواس کا جنازہ پڑھا جائے گا اور وہ وارث ہوگا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2750] إذا استھل الصبي صلی علیہ
ضعیف / تقدم : 1508  باب إذا استھل المولود ورث
الربیع بن بدر : متروک (تقدم : 972) وتابعہ سفیان الثوري و عنعن ( تقدم : 90) وتابعہما إسماعیل بن مسلم المکي : ضعیف (تقدم: 301) وأبو الزبیر عنعن (تقدم :92)`;
ibnemaja.anwaar = [478,1];