var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ مُحَمَّدِ بْنِ زَائِدَةَ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِمَ اللَّهُ حَارِسَ الْحَرَسِ";
ibnemaja.urdu = "حضرت عقبہ بن عامر حہنیؓ سےر ورایت ہے رسول اللہﷺ نے فرمایا: اللہ تعالی محافظوں (مسلمانوں کا دفاع کرنے والے مجاہدین) کا پہرہ دینے والے پر رحمت فرمائے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[2769] رحم اللّٰہ حارس الحرس
إسنادہ ضعیف باب فضل الحرس والتکبیر في سبیل اللّٰہ
صالح بن محمدبن زائدۃ : ضعیف ( د 2713) و عمر بن عبدالعزیز لم یلق عقبۃ بن عامر رضي اللّٰہ عنہ وللحدیث لون آخر ضعیف عند الحاکم ( 86/2) `;
ibnemaja.anwaar = [479,1];