var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا خَالِي يَعْلَى عَنْ مُحَمَّدِ بْنِ عَوْنٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ اسْتَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَجَرَ ثُمَّ وَضَعَ شَفَتَيْهِ عَلَيْهِ يَبْكِي طَوِيلًا ثُمَّ الْتَفَتَ فَإِذَا هُوَ بِعُمَرَ بْنِ الْخَطَّابِ يَبْكِي فَقَالَ يَا عُمَرُ هَاهُنَا تُسْكَبُ الْعَبَرَاتُ";
ibnemaja.urdu = "حضرت عبداللہ بن عمر ؓ سے روایت ہے انہوں نے فرما یا:رسول اللہﷺحجر اسود کی طرف آئے ‘پھر اس پر اپنے مبارک رکھ کر د\nیر تک روتے رہے ‘پھر مڑکر دیکھا تو حضرت عمر بن خطاب﷜روتے نظر آئے۔تب آپ نے فرما یا:’’عمر! اس مقام پر آنسو بہائے جاتے ہیں۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[2945] یا عمر ! ھھنا تسکب العبرات
إسنادہ ضعیف جدًا    باب استلام الحجر
محمد بن عون : متروک (تق: 6203) والسند ضعفہ البوصیري۔`;
ibnemaja.anwaar = [483,2];