var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى عَنْ ابْنِ جُرَيْجٍ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ الْخَلَاءَ وَضَعَ خَاتَمَهُ";
ibnemaja.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے روایت ہےکہ نبی ﷺ جب بیت الخلاء میں داخل ہوتے تو انگوٹھی اتار دیتے تھے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[303] أن النبيﷺ کان إذا دخل الخلاء
إسنادہ ضعیف / د 19،ت1746،ن 5216   باب ذکر اللّٰہ عزوجل علی الخلاء`;
ibnemaja.anwaar = [387,1];