var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ: حَدَّثَنَا وَكِيعٌ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ،عَنْ فَرْقَدٍ السَّبَخِيِّ،عَنْ سَعِيدِ بْنِ جُبَيْرٍ،عَنِ ابْنِ عُمَرَ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،«كَانَ يَدَّهِنُ رَأْسَهُ بِالزَّيْتِ،وَهُوَ مُحْرِمٌ،غَيْرَ الْمُقَتَّتِ»";
ibnemaja.urdu = "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ احرام کی حالت میں اپنے سر میں ایسا تیل ڈال لیتے تھے جس میں خوشبو نہ ہوتی۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3083] أن النبيﷺ کان یدھن رأسہ بالزیت
إسنادہ ضعیف/ ت 962  باب ما یدہن بہ المحرم`;
ibnemaja.anwaar = [487,1];