var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْقَطَّانُ الْوَاسِطِيُّ قَالَ: حَدَّثَنَا يَزِيدُ بْنُ مَوْهَبٍ قَالَ: حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ الْعَزِيزِ قَالَ: حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ،عَنْ أَبِي الْمُهَزِّمِ،عَنْ أَبِي هُرَيْرَةَ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،قَالَ: فِي بَيْضِ النَّعَامِ،يُصِيبُهُ الْمُحْرِمُ،ثَمَنُهُ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے اگر احرام والا شتر مرغ کا انڈا توڑ دے تو اس کے بارے میں رسول اللہ ﷺ نے فرمایا ہے: ’’اس کی قیمت ادا کرے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[3086] أن رسول اللّٰہ ﷺ قال في بیض النعام۔۔۔ثمنہ
إسنادہ ضعیف باب جزاء الصید یصیبہ المحرم
أبو المہزم :متروک ( د 1854) وعلي بن عبدالعزیز ھو علي بن غراب (مدلس تقدم: 2474) وللحدیث شواہد ضعیفۃ۔`;
ibnemaja.anwaar = [487,1];