var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ،عَنِ ابْنِ عَوْنٍ،قَالَ أَنْبَأَنَا أَبُو رَمْلَةَ،عَنْ مِخْنَفِ بْنِ سُلَيْمٍ،قَالَ: كُنَّا وَقُوفًا عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ فَقَالَ: «يَا أَيُّهَا النَّاسُ إِنَّ عَلَى كُلِّ أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أُضْحِيَّةً وَعَتِيرَةً،أَتَدْرُونَ مَا الْعَتِيرَةُ؟ هِيَ الَّتِي يُسَمِّيهَا النَّاسُ الرَّجَبِيَّةَ»";
ibnemaja.urdu = "حضرت مخنف بن سلیم ؓ سے روایت ہے،انہوں نے فرمایا: ہم عرفہ میں نبی ﷺ کے قریب ٹھہرے ہوئے تھے۔آپ نے فرمایا:’’لوگو! ہر گھر والوں پر ہر سال قربانی اور عتیرہ (واجب) ہے۔‘‘ کیا تمہیں معلوم ہے عتیرہ کیا ہے وہی جسے لوگ رجبیہ کہتے ہیں۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3125] یا أیھا الناس! إن علی کل أھل بیت
إسنادہ ضعیف / د 2788،ت 1518،ن 4229   باب الأضاحي واجبۃ ھي أم لا ؟`;
ibnemaja.anwaar = [489,1];