var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ: حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ،عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ،قَالَ: «ضَحَّى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،بِكَبْشٍ أَقْرَنَ فَحِيلٍ،يَأْكُلُ فِي سَوَادٍ،وَيَمْشِي فِي سَوَادٍ،وَيَنْظُرُ فِي سَوَادٍ»";
ibnemaja.urdu = "حضرت ابو سعید ؓ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے سینگوں والے نر مینڈھے کی قربانی دی۔وہ سیاہی کھاتا،سیاہی میں چلتا اور سیاہی میں دیکھتا تھا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3128] ضحی رسول اللّٰہ ﷺ بکبش أقرن فحیل
سندہ ضعیف / د 2796،ت 1496،ن 4395  باب ما یستحب من الأضاحي
`;
ibnemaja.anwaar = [535,1];