var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا الْأَوْزَاعِيُّ،عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: «ذَبَحَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،عَمَّنِ اعْتَمَرَ مِنْ نِسَائِهِ فِي حَجَّةِ الْوَدَاعِ بَقَرَةً بَيْنَهُنَّ»";
ibnemaja.urdu = "حضرت ابو ہریرہ ؓ سے روایت ہے،انہوں نے فرمایا: رسو ل اللہ ﷺ نے حجۃ الوداع میں اپنی ان ازواج کی طرف سے،جنہوں نے عمرہ ادا کیاتھا،مشترکہ طور پر ایک گائے ذبح کی۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3133] ذبح رسول اللّٰہ ﷺ عمن اعتمر
إسنادہ ضعیف/ د 1751 باب عن کم تجزئ البدنۃ والبقرۃ`;
ibnemaja.anwaar = [489,1];