var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ حَمَّادِ بْنِ سَلَمَةَ،عَنْ أَبِي الْعُشَرَاءِ،عَنْ أَبِيهِ،قَالَ: قُلْتُ يَا رَسُولَ اللَّهِ مَا تَكُونُ الذَّكَاةُ،إِلَّا فِي الْحَلْقِ،وَاللَّبَّةِ قَالَ: «لَوْ طَعَنْتَ فِي فَخِذِهَا لَأَجْزَأَكَ»";
ibnemaja.urdu = "حضرت ابو العشراء (اسامہ بن مالک) رحمہ اللہ اپنے والد (مالک بن قبطم) سے روایت کرتے ہیں کہ انہوں نے فرمایا: اے اللہ کے رسول! کیا ذبح صرف حلق اور گردن ہی سے ہوتا ہے؟ آپ نے فرمایا:’’اگر تو اس کی ران میں نیزہ مار دے،تب بھی حلق کافی ہو گا۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[3184] لو طعنت في فخذھا لأجزأک
إسنادہ ضعیف / د 2825،ت 1481،ن 4413   باب زکاۃ الناد من البھائم`;
ibnemaja.anwaar = [490,1];