var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ،قَالَا حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ،عَنْ مُوسَى بْنِ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،أَنْ يُمَثَّلَ،بِالْبَهَائِمِ»";
ibnemaja.urdu = "حضرت ابو سعید خدری ؓ سے روایت ہے کہ نبی ﷺ نے جانوروں کا مثلہ کرنے سے منع فرمایا ہے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3185] نھی رسول اللّٰہ ﷺ أن یمثل بالبھائم
إسنادہ ضعیف باب النہي عن صبر البہائم وعن المثلۃ
موسی بن محمد بن إبراہیم : منکر الحدیث ( تق : 7006 ) تقدم : 3171`;
ibnemaja.anwaar = [490,1];