var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ،عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ،عَنِ ابْنِ أَبِي نَجِيحٍ،عَنْ مُجَاهِدٍ،عَنِ ابْنِ عُمَرَ،قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنْ لُحُومِ الْجَلَّالَةِ،وَأَلْبَانِهَا»";
ibnemaja.urdu = "حضرت عبداللہ بن عمرؓ سے روایت ہے،انہوں نے فرمایا: رسول اللہ ﷺ نے نجاست کھانے والے جانور کےگوشت اور دودھ سےمنع فرمایا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3189] نھی رسول اللّٰہ ﷺ عن لحوم الجلالۃ
ضعیف / د 3185،ت 1824   باب النھي عن لحوم الجلالۃ`;
ibnemaja.anwaar = [490,2];