var ibnemaja = {};
ibnemaja.arabic = "قَالَ أَبُو الْحَسَنِ بْنُ سَلَمَةَ وَحَدَّثَنَاهُ عُمَيْرُ بْنُ مِرْدَاسٍ الدَّوْنَقِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ أَبُو يَحْيَى الْبَصْرِيُّ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانِي أَنْ أَشْرَبَ قَائِمًا وَأَنْ أَبُولَ مُسْتَقْبِلَ الْقِبْلَةِ";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: مجھے رسول اللہ ﷺ نے کھڑے ہو کر پانی پینے اور قبلہ کی طرف منہ کر کے پیشاب کرنے سے منع فرمایا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[321] إن رسول اللّٰہ ﷺ نھاني أن أشرب قائمًا
إسنادہ ضعیف باب النہي عن استقبال القبلۃ بالغائط والبول
عبد اللّٰہ بن لھیعۃ مدلس،ضعیف بعد اختلاطہ وعنعن (انظر ضعیف سنن أبي داود : 739 وضعیف سنن الترمذي : 10) أبو الزبیر عنعن ( تقدم : 92 ) و فی السند إلیھما نظر و الحدیث السابق ( الأصل : 318 ) یغني عنہ۔`;
ibnemaja.anwaar = [387,1];