var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَبِي سَعْدٍ الْبَقَّالِ،أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ،يَقُولُ: «كُنَّ أَزْوَاجُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَتَهَادَيْنَ الْجَرَادَ،عَلَى الْأَطْبَاقِ»";
ibnemaja.urdu = "حضر انس بن مالک رضی اللہ عنہ سے روایت ہے،نہوں نے فرمایا: نبیﷺ کی ازواج مطہرات (رضی اللہ عنہنَّ) ایک دوسری کو ٹڈیوں کی پلیٹیں تحفے کے طور پر بھیجا کرتی تھیں۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3220] کن أزواج النبيﷺ یتھادین الجراد
إسنادہ ضعیف باب صید الحیتان والجراد
أبو سعد البقال : ضعیف مدلس ( ت 1404) ولابن عینۃ ( تقدم : 28) لون آخر في مصنف عبدالرزاق (533/4 ح 8763) `;
ibnemaja.anwaar = [491,2];