var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ: حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ قَالَ: حَدَّثَنَا هُرَيْمٌ،عَنْ لَيْثٍ،عَنْ كَعْبٍ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُوعِ،فَإِنَّهُ بِئْسَ الضَّجِيعُ،وَأَعُوذُ بِكَ مِنَ الْخِيَانَةِ،فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ»";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے‘انھوں نے کہا:رسول اللہﷺفرمایا کرتے تھے:’’اے اللہ!میں بھوک سے تیری پناہ چاہتا ہوں‘وہ بستر کی بری ساتھی ہے۔اور خیانت سے تیری پناہ میں آتا ہوں‘وہ بری ہم راز ہے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[3354] اللّٰھم إني أعوذبک من الجوع
إسنادہ ضعیف باب التعوذ من الجوع
لیث بن أبي سلیم ضعیف ( تقدم : 208 ) و کعب المدني مجھول ( تق : 5651 ) و للحدیث شواھد ضعیفۃ عند أبي داود ( 1547 ) وغیرہ۔`;
ibnemaja.anwaar = [497,1];