var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا سُلَيْمَانُ بْنُ عُتْبَةَ قَالَ: حَدَّثَنِي يُونُسُ بْنُ مَيْسَرَةَ بْنِ حَلْبَسٍ،عَنْ أَبِي إِدْرِيسَ،عَنْ أَبِي الدَّرْدَاءِ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْجَنَّةَ،مُدْمِنُ خَمْرٍ»";
ibnemaja.urdu = "حضرت ابودرداء ؓ سے روایت ہے ‘نبی ﷺنے فرما یا:ہمیشہ شراب پینے والا جنت میں داخل نہیں ہو گا۔‘‘";
ibnemaja.hukam = "حسن یا صحیح";
ibnemaja.description = "یہ حدیث انوار الصحیفہ میں درج نہیں کی گئی، لہٰذا کم از کم حسن یا پھر صحیح ہے۔";