var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُمَرَ قَالَ: حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ بِإِسْنَادِهِ نَحْوَهُ. وَزَادَ فِيهِ «وَمَنِ اكْتَحَلَ فَلْيُوتِرْ،مَنْ فَعَلَ فَقَدْ أَحْسَنَ،وَمَنْ لَا فَلَا حَرَجَ،وَمَنْ لَاكَ فَلْيَبْتَلِعْ»";
ibnemaja.urdu = "اسی حدیث کی ایک روایت میں یہ اضافہ ہے:’’جو سرمہ لگائے تو طاق تعداد میں لگائے۔جس نے ایسا کیا تو اچھا کیا۔جس نے نہ کیا تو کوئی حرج نہیں۔اور جو شخص زبان کے ذریعے سے(دانتوں کے درمیان سے) کچھ نکالے تو اسے چاہیے کہ نگل لے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[338] ومن اکتحل فلیوتر من فعل فقد أحسن  أبو ہریرۃ
ضعیف /انظر الحدیث السابق و سیأتي :3498  باب الإرتیاد للغائط والبول`;
ibnemaja.anwaar = [389,1];