var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ،عَنْ سَعْدٍ الْإِسْكَافِ،عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ،عَنْ عَلِيٍّ قَالَ: «نَزَلَ جِبْرِيلُ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،بِحِجَامَةِ الْأَخْدَعَيْنِ،وَالْكَاهِلِ»";
ibnemaja.urdu = "حضرت علی ؓ سے روایت ہے،انہوں نے فرمایا: حضرت جبریل نےنازل ہو کر نبی ﷺ کو گردن کی رگوں پر اور دونوں کندھوں کےدرمیان (گردن کے قریب،سینگی لگوانے کی ہدایت کی۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3482] نزل جبریل علی النبيﷺ بحجامۃ الأخدعین
إسنادہ ضعیف جدًا    باب موضع الحجامۃ
الأصبغ بن نباتۃ وسعد الأسکاف : متروکان (تق: 537،2241) ورمیا بالرفض۔`;
ibnemaja.anwaar = [502,1];