var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ جَرِيرِ بْنِ حَازِمٍ،عَنْ قَتَادَةَ،عَنْ أَنَسٍ،أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «احْتَجَمَ فِي الْأَخْدَعَيْنِ،وَعَلَى الْكَاهِلِ»";
ibnemaja.urdu = "حضرت انس ؓ سے روایت ہے کہ گردن کی رگوں پر اور دونوں کندھوں کےدرمیان سینگی لگوائی۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3483] أن النبيﷺ احتجم فی الأخدعین
إسنادہ ضعیف / د 3860،ت 2051    باب موضع الحجامۃ`;
ibnemaja.anwaar = [502,1];