var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے کھڑے کھڑے جوتے پہننے سے منع فرمایا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3618] نھی رسول اللّٰہ ﷺ أن ینتعل الرجل قائمًا
إسنادہ ضعیف باب الإنتعال قائمًا
أبو معاویۃ والأعمش مدلسان و عنعنا ( تقدما : 363،94) وللحدیث طرق ضعیفۃ عند الترمذي (1775،1776) وغیرہ۔`;
ibnemaja.anwaar = [507,1];