var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ أَبُو حَجَرٍ وَإِسْمَعِيلُ بْنُ تَوْبَةَ قَالَا حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ حَارِثَةَ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَتَوَضَّأُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ قَدْ أَصَابَتْ مِنْهُ الْهِرَّةُ قَبْلَ ذَلِكَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے،انہوں نے فرمایا: میں اور رسول اللہ ﷺ ایک ہی برتن سے وضو کر لیا کرتے تھے،جب کہ اس میں سے پہلے بلی نے پانی پیا ہوتا تھا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[368] کنت أتوضأ أنا و رسول اللّٰہ ﷺ
إسنادہ ضعیف باب الوضوء بسؤر الہرۃ والرخصۃ في ذلک
قال البوصیري : ’’ ھذا إسناد ضعیف،لضعف حارثۃ بن أبی الرجال ‘‘ وحارثۃ ضعیف ( تقدم : 56) وللحدیث شاہد ضعیف تقدم في ضعیف سنن أبي داود : 76 `;
ibnemaja.anwaar = [391,1];