var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ صَاحِبِ الدَّسْتُوَائِيِّ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدِ بْنِ عُبَادَةَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ سَقْيُ الْمَاءِ";
ibnemaja.urdu = "حضرت سعد بن عبادہ رضی اللہ عنہ سے روایت ہے،انہوں نے کہا:میں نے عرض کیا:اے اللہ کے رسول! کون سا صدقہ افضل ہے؟ آپ نے فرمایا: پانی پلانا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3684] سقي الماء
إسنادہ ضعیف/ د 1679،ن 3694 باب فضل صدقۃ الماء`;
ibnemaja.anwaar = [509,1];