var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا هِشَامٌ عَنْ الْحَسَنِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَنْزِلُوا عَلَى جَوَادِّ الطَّرِيقِ وَلَا تَقْضُوا عَلَيْهَا الْحَاجَاتِ";
ibnemaja.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: راستے پر قیام نہ کرو،نہ وہاں قضائے حاجت کرو۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3772] لا تنزلوا علی جواد الطریق
إسنادہ ضعیف / د 2570    باب النھي عن النزول علی الطریق`;
ibnemaja.anwaar = [511,1];