var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ مُوسَى بْنِ عُبَيْدَةَ عَنْ مُحَمَّدِ بْنِ ثَابِتٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ رَبِّ أَعُوذُ بِكَ مِنْ حَالِ أَهْلِ النَّارِ";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے،نبی ﷺ فرمایا کرتے تھے:[اَلۡحَمۡدُ لِلہِ عَلٰی کُلِّ حَالٍ،رَبِّ أَعُوۡذُبِکَ مِنۡ حَالِ أَھۡلِ النَّارِ] ہر حال میں اللہ کا شکر ہے۔اے اللہ! اہل جہنم کے حال سے تیری پناہ کا طالب ہوں۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3804] الحمد للّٰہ علی کل حال
إسنادہ ضعیف باب فضل الحامدین
موسی بن عبیدۃ : ضعیف مشہور (تقدم : 1559) `;
ibnemaja.anwaar = [512,1];