var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ قَالَ: حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ،عَنْ جَعْفَرِ بْنِ مَيْمُونٍ،عَنْ أَبِي عُثْمَانَ،عَنْ سَلْمَانَ،عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ رَبَّكُمْ حَيِيٌّ كَرِيمٌ،يَسْتَحْيِي مِنْ عَبْدِهِ أَنْ يَرْفَعَ إِلَيْهِ يَدَيْهِ،فَيَرُدَّهُمَا صِفْرًا،-أَوْ قَالَ: خَائِبَتَيْنِ-";
ibnemaja.urdu = "حضرت سلمان فارسی ؓ سے روایت ہے نبیﷺ نے فرمایا:تمھا راپروردگار حیا دار اور سخی ہے وہ اس بات سے شرماتا ہے کہ بندہ(دعا کے لیے) اسی کی طرف ہاتھ اٹھائے وہ انھیں خالی یا فرمایا: ناکام پھیر دے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3865] إن ربکم حیي کریم
إسنادہ ضعیف/ د 1488،ت 3556 باب رفع الیدین فی الدعاء
------------
معاذ علی زئی:
وتابعہ ابو المعلیٰ یحییٰ بن میمون عند المحاملی فی المالیہ ح 433 وسندہ حسن۔
انظر ابن ماجہ بتحقیق الشیخ ندیم ظہیر ح 3865`;
ibnemaja.anwaar = [515,1];