var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ: حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ: حَدَّثَنَا أَبُو الْمُهَزِّمِ يَزِيدُ بْنُ سُفْيَانَ قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ،يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْمُؤْمِنُ أَكْرَمُ عَلَى اللَّهِ عَزَّ وَجَلَّ،مِنْ بَعْضِ مَلَائِكَتِهِ»";
ibnemaja.urdu = "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا:اللہ کے ہاں مومن کی عزت بعض فرشتوں سے بھی زیادہ ہے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[3947] المؤمن أکرم علی اللّٰہ عزوجل
إسنادہ ضعیف جدًا    باب المسلمون في ذمۃ اللّٰہ عزوجل
أبو المہزم : متروک ( تقدم :3086) `;
ibnemaja.anwaar = [517,1];