var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ حَدَّثَنَا مَعْمَرٌ عَنْ عَبْدِ الْكَرِيمِ عَنْ أَبِي عُبَيْدَةَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّائِبُ مِنْ الذَّنْبِ كَمَنْ لَا ذَنْبَ لَهُ";
ibnemaja.urdu = "حضرت عبداللہ بن مسعود ؓ سے روایت ہے۔رسو ل اللہ ﷺ نے فر ما یا گنا ہ سے تو بہ کر نے والا اس شخص کی طرح (ہو جا تا) ہے جس کا کو ئی گنا ہ نہیں۔";
ibnemaja.hukam = "";
ibnemaja.description = `[4250] التائب من الذنب کمن لا ذنب لہ
إسنادہ ضعیف باب ذکر التوبۃ
أبو عبیدۃ بن عبد اللّٰہ بن مسعود عن أبیہ : منقطع۔( تقدم : 615)`;
ibnemaja.anwaar = [530,1];