var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ حَدَّثَنَا عَمْرُو بْنُ هَاشِمٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْخُلُ النَّارَ إِلَّا شَقِيٌّ قِيلَ يَا رَسُولَ اللَّهِ وَمَنْ الشَّقِيُّ قَالَ مَنْ لَمْ يَعْمَلْ لِلَّهِ بِطَاعَةٍ وَلَمْ يَتْرُكْ لَهُ مَعْصِيَةً";
ibnemaja.urdu = "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے۔رسول اللہ ﷺنے فرمایا: جہنم میں تو بدنصیب ہی جائے گا۔عرض کیا گیا۔اللہ کے رسولﷺ! بدنصیب کون ہے؟آپﷺ نے فرمایا: جس نے اللہ کی فرمانبرداری کا کوئی عمل نہیں کیا اور اللہ کی نافرمانی والا کوئی عمل نہیں چھوڑا۔";
ibnemaja.hukam = "";
ibnemaja.description = `[4298] لا یدخل النار إلا شقي
إسنادہ ضعیف باب ما یرجی من رحمۃ اللّٰہ یوم القیامۃ
ابن لہیعۃ عنعن (تقدم: 330) `;
ibnemaja.anwaar = [531,1];