var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي كَرِبٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَيْلٌ لِلْعَرَاقِيبِ مِنْ النَّارِ";
ibnemaja.urdu = "سیدنا جابر بن عبداللہ رضی اللہ عنہما سے روای تہے،انہوں نے فرمایا: میں نے رسول اللہ ﷺ سے یہ ارشاد سنا:’’ایڑیوں(عراقیب) کے لئے آگ کا عذاب ہے۔";
ibnemaja.hukam = "حسن یا صحیح";
ibnemaja.description = "یہ حدیث انوار الصحیفہ میں درج نہیں کی گئی، لہٰذا کم از کم حسن یا پھر صحیح ہے۔";