var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ حَدَّثَنَا عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي خَثْعَمٍ الثُّمَالِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالُوا يَا رَسُولَ اللَّهِ مَا الطُّهُورُ عَلَى الْخُفَّيْنِ قَالَ لِلْمُسَافِرِ ثَلَاثَةُ أَيَّامٍ وَلَيَالِيهِنَّ وَلِلْمُقِيمِ يَوْمٌ وَلَيْلَةٌ";
ibnemaja.urdu = "سیدنا ابو ہریرہ رضی اللہ عنہ سے روایت ہے،صحابہ کرام نے عرض کیا،اے اللہ کے رسول! موزے پہن کر وضو کیا حکم ہے؟ آپ ﷺ نے فرمایا: ’’مسافر کے لئے تین دن رات،اور مقیم کے لئے ایک دن رات(مسح کرنا درست ہے۔‘‘)";
ibnemaja.hukam = "";
ibnemaja.description = `[555] للمسافر ثلاثۃ أیام ولیالیھن
إسنادہ ضعیف باب ما جاء فی التوقیت فی المسح للمقیم والمسافر
عمر بن عبد اللّٰہ بن أبي خثعم ضعیف ( ت 435) وغیرہ۔والحدیث الآتي ( الأصل : 556) یغني عنہ۔`;
ibnemaja.anwaar = [398,1];