var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجْنِبُ ثُمَّ يَنَامُ وَلَا يَمَسُّ مَاءً حَتَّى يَقُومَ بَعْدَ ذَلِكَ فَيَغْتَسِلَ";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے انہوں نے فرمایا: رسول اللہ ﷺ کو جنابت کی کیفیت پیش آتی تھی،پھر آپ پانی کو ہاتھ لگائے بغیر سو جاتے تھے حتی کہ بعد میں اٹھ کر غسل فرمالیتے۔";
ibnemaja.hukam = "";
ibnemaja.description = `[581] کان رسول اللّٰہ ﷺ یجنب ثم ینام
إسنادہ ضعیف/ د 228،ت 118   باب فی الجنب ینام کھیئتہ لا یمسّ ماء`;
ibnemaja.anwaar = [399,1];