var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ قَالَ: حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ،عَنْ نَافِعٍ،عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقْرَأُ الْقُرْآنَ الْجُنُبُ،وَلَا الْحَائِضُ»";
ibnemaja.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جنبی اور حائضہ قرآن نہ پڑھیں۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[595۔596] لا یقرأ القرآن الجنب ولا الحائض
إسنادہ ضعیف / ت 131 باب ما جاء في قراء ۃ القرآن علی غیر طہارۃ`;
ibnemaja.anwaar = [400,1];