var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ الْكَرِيمِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَاخْتَبَأَتْ مَوْلَاةٌ لَهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاضَتْ فَقَالَتْ نَعَمْ فَشَقَّ لَهَا مِنْ عِمَامَتِهِ فَقَالَ اخْتَمِرِي بِهَذَا";
ibnemaja.urdu = "سیدہ عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی ﷺ ان کے گھر تشریف لائے تو ان کی ایک آزاد کردہ لونڈی چھپ گئی،نبی ﷺ نے فرمایا: ’’اسے حیض آگیا ہے؟‘‘ ام المومنین نے کہا: جی ہاں۔آپ ﷺ نے اپنی پگڑی کے کپڑے میں سے پھاڑ کر ایک حصہ اسے دیا اور فرمایا: ’’اسے اوڑھنی بنالو۔‘";
ibnemaja.hukam = "";
ibnemaja.description = `[654] اختمري بھذا
إسنادہ ضعیف باب إذا حاضت الجاریۃ لم تصلّ إلا بخمار
عبدالکریم بن أبی المخارق : ضعیف (تقدم : 308) `;
ibnemaja.anwaar = [402,1];