var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عِيسَى أَخُو سُلَيْمٍ الْقَارِيُّ عَنْ الْحَكَمِ بْنِ أَبَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُؤَذِّنْ لَكُمْ خِيَارُكُمْ وَلْيَؤُمَّكُمْ قُرَّاؤُكُمْ";
ibnemaja.urdu = "سیدنا عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’اذان وہ لوگ دیں جو زیادہ بہتر(نیک) ہوں،اور تمہیں نماز وہ افراد پڑھائیں جو قرآن پڑھنے والے(حافظ اور عالم) ہوں۔‘";
ibnemaja.hukam = "";
ibnemaja.description = `[726] لیؤذن لکم خیارکم
إسنادہ ضعیف / د 590 باب فضل الأذان و ثواب المؤذنین`;
ibnemaja.anwaar = [404,1];