var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَنْبَأَنَا عَبْدُ الْجَبَّارِ بْنُ عُمَرَ عَنْ ابْنِ أَبِي فَرْوَةَ عَنْ مُحَمَّدِ بْنِ يُوسُفَ مَوْلَى عُثْمَانَ بْنِ عَفَّانَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ عَفَّانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَهُ الْأَذَانُ فِي الْمَسْجِدِ ثُمَّ خَرَجَ لَمْ يَخْرُجْ لِحَاجَةٍ وَهُوَ لَا يُرِيدُ الرَّجْعَةَ فَهُوَ مُنَافِقٌ";
ibnemaja.urdu = "سیدنا عثمان رضی اللہ عنہ سے روایت ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص مسجد میں اذان ہو جانے کے بعد مسجد سے نکل گیا،وہ کسی مجبوری کی وجہ سے نہیں نکلا اور واپس آنے کا ارادہ بھی نہیں رکھتا تو وہ منافق ہے۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[734] من أدرکہ الأذان فی المسجد
ضعیف    باب إذا أذن و أنت فی المسجد لا تخرج
ابن أبي فروۃ : متروک ( تقدم : 345 ) وعبد الجبار بن عمر : ضعیف ( ت 2854) و قال الھیثمي : عبد الجبار بن عمر الأیلي عن عبد اللّٰہ بن عطاء بن إبراھیم و کلاھما وثق و قد ضعفہما الجمھور ( انظر مجمع الزوائد 85/7 ) ولبعض الحدیث شواھد عند الطبراني فی الأوسط ( 3854 ) والبیھقي ( 3/ 56) وغیرھما۔`;
ibnemaja.anwaar = [405,1];