var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ خَالِدِ بْنِ إِيَاسٍ عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ أَوَّلُ مَنْ أَسْرَجَ فِي الْمَسَاجِدِ تَمِيمٌ الدَّارِيُّ";
ibnemaja.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: سب سے پہلے جس نے مسجدوں میں چراغ روشن کیے،وہ جناب تمیم داری رضی اللہ عنہ ہیں۔";
ibnemaja.hukam = "";
ibnemaja.description = `[760] أول من أسرج فی المساجد
إسنادہ ضعیف جدًا    باب تطہیر المساجد وتطیی بھا
خالد بن إیاس : متروک الحدیث ( ت 288) `;
ibnemaja.anwaar = [406,1];