var ibnemaja = {};
ibnemaja.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ ثَوَابٍ حَدَّثَنَا أَبُو نُعَيْمٍ النَّخَعِيُّ عَنْ أَبِي مَالِكٍ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ أَبِي مُوسَى وَأَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَلِيُّ لَا تُقْعِ إِقْعَاءَ الْكَلْبِ";
ibnemaja.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے،نبی ﷺ نے فرمایا: اے علی! کتے کی طرح ایڑیوں پر مت بیٹھ۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[895] یا علي ! لا تقع اقعاء الکلب  أبو موسی وعلي بن أبي طالب
ضعیف    باب الجلوس بین السجدتین
أبو مالک النخعي : متروک ( تق : 8337 ) والحارث الأعور : ضعیف ( تقدم : 375 ) وانظر الحدیث السابق (894) وحدیث مسلم ( 498 ) یغني عنہ۔`;
ibnemaja.anwaar = [410,1];