var ibnemaja = {};
ibnemaja.arabic = "-حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَ: حَدَّثَنَا عَلِيُّ بْنُ الْقَاسِمِ قَالَ: أَنْبَأَنَا هَمَّامٌ،عَنْ قَتَادَةَ،عَنِ الْحَسَنِ،عَنْ سَمُرَةَ بْنِ جُنْدَبٍ،قَالَ: «أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نُسَلِّمَ عَلَى أَئِمَّتِنَا،وَأَنْ يُسَلِّمَ بَعْضُنَا عَلَى بَعْضٍ»";
ibnemaja.urdu = "سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے،انہوں نے فرمایا: ’’رسول اللہ ﷺ نے ہمیں حکم دیا کہ ہم اپنے اماموں کو سلام کہیں اور ہم ایک دوسرے کو سلام کہیں۔‘‘";
ibnemaja.hukam = "";
ibnemaja.description = `[922] أمرنا رسول اللّٰہ ﷺ أن نسلم علی أئمتنا
إسنادہ ضعیف / د 1001 [ح 925،انظر ص 535 ] باب رد السلام علی الإمام`;
ibnemaja.anwaar = [411,1];