var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى الْقُوْمَسِيُّ الْبَسْطَامِيُّ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ هَارُونَ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ وَضَعَ رُكْبَتَيْهِ قَبْلَ يَدَيْهِ وَإِذَا نَهَضَ رَفَعَ يَدَيْهِ قَبْلَ رُكْبَتَيْهِ";
nasai.urdu = "حضرت وائل بن حجر رضی اللہ عنہ سے روایت ہے،انھوں نے فرمایا: میں نے رسول اللہ ﷺ کو دیکھا جب آپ سجدہ کرتے تو اپنے گھٹنے،اپنے ہاتھوں سے پہلے رکھتے۔اور جب اٹھتے تو اپنے ہاتھ گھٹنوں سے پہلے اٹھاتے۔";
nasai.hukam = "";
nasai.description = `[1090] رأیت رسول اللّٰہ ﷺ إذا سجد وضع رکبتیہ
إسنادہ ضعیف / د 838،ت 268،جہ 882 باب أول ما یصل إلی الأرض من الإنسان`;
nasai.anwaar = [329,1];