var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا ابْنُ عَيَّاشٍ عَنْ مُغِيرَةَ عَنْ الْحَارِثِ الْعُكْلِيِّ عَنْ ابْنِ نُجَيٍّ قَالَ قَالَ عَلِيٌّ كَانَ لِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَدْخَلَانِ مَدْخَلٌ بِاللَّيْلِ وَمَدْخَلٌ بِالنَّهَارِ فَكُنْتُ إِذَا دَخَلْتُ بِاللَّيْلِ تَنَحْنَحَ لِي";
nasai.urdu = "حضرت علی رضی اللہ عنہ فرماتے ہیں: میرے لیے رسول اللہ ﷺ کے پاس جانے کے دو وقت مقرر تھے۔ایک دن کو اور ایک رات کو۔جب میں رات کو آپ کی خدمت میں حاضر ہوتا تو آپ کھنکار دیتے۔";
nasai.hukam = "";
nasai.description = `۔1213] کان لي من رسول اللّٰہ ﷺ مدخلان
إسنادہ ضعیف/ جہ 3708،أحمد 1؍80ح 608    التنحنح فی الصلاۃ
في سماع عبد اللّٰہ بن نجي من علي رضي اللّٰہ عنہ نظر والحدیث الآتي ( 1214 وسندہ حسن )یغني عنہ۔`;
nasai.anwaar = [330,1];