var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ عَوْنٍ عَنْ إِبْرَاهِيمَ قَالَ كَانُوا يَقُولُونَ إِذَا أَوْهَمَ يَتَحَرَّى الصَّوَابَ ثُمَّ يَسْجُدُ سَجْدَتَيْنِ";
nasai.urdu = "حضرت ابراہیم نخعی رحمہ اللہ بیان کرتے ہیں کہ لوگ (صحابۂ کرام) کہتے تھے: جب نمازی کو وہم ہو جائے تو وہ درست بات تلاش کرے،پھر دو سجدے کرے";
nasai.hukam = "حسن یا صحیح";
nasai.description = "یہ حدیث انوار الصحیفہ میں درج نہیں کی گئی، لہٰذا کم از کم حسن یا پھر صحیح ہے۔";