var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ قُدَامَةَ بْنِ وَبَرَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ الْجُمُعَةَ مِنْ غَيْرِ عُذْرٍ فَلْيَتَصَدَّقْ بِدِينَارٍ فَإِنْ لَمْ يَجِدْ فَبِنِصْفِ دِينَارٍ";
nasai.urdu = "حضرت سمرہ بن جندب رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’جو شخص بلاعذر جمعہ چھوڑ دے تو اسے چاہیے وہ ایک دینار صدقہ کرے۔اگر اس کے پاس دنیار نہ ہو تو نصف دینار صدقہ کرے۔‘‘";
nasai.hukam = "";
nasai.description = `[1373] 1/ من ترک الجمعۃ من غیر عذر
إسنادہ ضعیف / د 1053،یأتي : 1373ب  باب کفارۃ من ترک الجمعۃ من غیر عذر
1/ من ترک الجمعۃ متعمدًا فعلیہ دینار
إسنادہ ضعیف / د 1053،جہ 1128    باب کفارۃ من ترک الجمعۃ من غیر عذر
قتادۃ عنعن ( تقدم : 1086) `;
nasai.anwaar = [331,1];