var nasai = {};
nasai.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرٍو قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ أَبَا بَكْرٍ قَبَّلَ بَيْنَ عَيْنَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مَيِّتٌ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا سے مروی ہے کہ حضرت ابوبکر رضی اللہ عنہ نے نبی ﷺ کی وفات کے بعد آپ کی آنکھوں کے درمیان (پیشانی کو) بوسہ دیا۔";
nasai.hukam = "";
nasai.description = `[1840] أن أبا بکر قبل بین عیني النبي ﷺ
إسنادہ ضعیف تقبیل المیت
ابن شھاب الزہري عنعن (1233) والحدیث الآتي ( الأصل : 1841) یغني عنہ۔`;
nasai.anwaar = [335,2];