var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ أَبِي مَعْمَرٍ قَالَ كُنَّا عِنْدَ عَلِيٍّ فَمَرَّتْ بِهِ جَنَازَةٌ فَقَامُوا لَهَا فَقَالَ عَلِيٌّ مَا هَذَا قَالُوا أَمْرُ أَبِي مُوسَى فَقَالَ إِنَّمَا قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِجَنَازَةِ يَهُودِيَّةٍ وَلَمْ يَعُدْ بَعْدَ ذَلِكَ";
nasai.urdu = "حضرت ابو معمر بیان کرتے ہیں کہ ہم حضرت علی رضی اللہ عنہ کے پاس بیٹھے تھے کہ ایک جنازہ پاس سے گزرا۔لوگ اس کی وجہ سے کھڑے ہوگئے۔حضرت علی رضی اللہ عنہ نے فرمایا: یہ کیا ہے؟ (تم کیوں کھڑے ہوئے؟) لوگں نے کہا: یہ حضرت ابوموسیٰ رضی اللہ عنہ کی ہدایت ہے۔انھوں نے فرمایا: رسول اللہ ﷺ تو صرف ایک یہودی عورت کے جنازے کو دیکھ کر کھڑے ہوئے تھے،اس کے بعد کبھی کھڑے نہیں ہوئے۔";
nasai.hukam = "";
nasai.description = `[1924] کنا عند علي فمرت بہ جنازۃ
إسنادہ ضعیف     الرخصۃ في ترک القیام
ابن أبي نجیح مدلس و عنعن و لہ شاہد ضعیف عند الحمیدي ( 50 بتحقیقي ) و أحمد ( 1/ 141۔142 ) وغیرہما۔و حدیث مسلم ( 962 [2227۔2230]) یغني عنہ۔`;
nasai.anwaar = [371,1];