var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ،قَالَ: حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ،عَنْ مُحَمَّدِ بْنِ جُحَادَةَ،عَنْ أَبِي صَالِحٍ،عَنْ ابْنِ عَبَّاسٍ قَالَ: «لَعَنَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زَائِرَاتِ الْقُبُورِ،وَالْمُتَّخِذِينَ عَلَيْهَا الْمَسَاجِدَ وَالسُّرُجَ»";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے قبرستان جانے والی عورتوں اور قبروں پر عبادت گاہیں بنانے والوں اور چراغ جلانے والوں پر لعنت کی ہے۔‘‘";
nasai.hukam = "";
nasai.description = `[2045] لعن رسول اللّٰہ ﷺ زائرات القبور والمتخذین علیھا
إسنادہ ضعیف / د 3236،ت 320    التغلیظ في اتخاذ السرج علی القبور`;
nasai.anwaar = [336,1];