var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ مِصِّيصِيٌّ،قَالَ: أَنْبَأَنَا حِبَّانُ بْنُ مُوسَى الْمَرْوَزِيُّ،قَالَ: أَنْبَأَنَا عَبْدُ اللَّهِ،عَنْ سُفْيَانَ،عَنْ سِمَاكٍ،عَنْ عِكْرِمَةَ مُرْسَلٌ";
nasai.urdu = "عبداللہ نے حضرت سفیان سے،انہوں نے سماک سے،انہوں نے حضرت عکرمہ رحمہ اللہ سے یہ روایت مرسل بیان کی ہے۔";
nasai.hukam = "";
nasai.description = `۔2117] مرسل (أتشھد أن لا إلہ إلا اللّٰہ۔۔۔۔؟)
إسنادہ ضعیف/ وانظر الحدیث السابق : 2114 باب قبول شہادۃ الرجل الواحدعلی ھلال`;
nasai.anwaar = [337,1];