var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ أَبَانَ الْبَلْخِيُّ قَالَ حَدَّثَنَا مَعْنٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ يُقَالُ الصِّيَامُ فِي السَّفَرِ كَالْإِفْطَارِ فِي الْحَضَرِ";
nasai.urdu = "حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ فرماتے ہیں: کہا جاتا ہے کہ سفر میں روزہ رکھنا گھر میں رہ کر روزہ نہ رکھنے کے برابر ہے۔";
nasai.hukam = "";
nasai.description = `[2286۔2287] الصیام فی السفر کالإفطار فی الحضر
إسنادہ ضعیف/ جہ 1666    ذکر قولہ : الصائم فی السفر کالمفطر فی الحضر
أبو سلمۃ لم یسمع من أبیہ کما قال یحیی بن معین (المراسیل لإبن أبي حاتم ص 255 وسندہ صحیح ) `;
nasai.anwaar = [338,1];