var nasai = {};
nasai.arabic = "أَخْبَرَنَا حُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ عَفَوْتُ عَنْ الْخَيْلِ وَالرَّقِيقِ وَلَيْسَ فِيمَا دُونَ مِائَتَيْنِ زَكَاةٌ";
nasai.urdu = "حضرت علی رضی اللہ عنہ سے منقول ہے،رسول اللہ ﷺ نے فرمایا: ’’میں نے (سواری کے گھوڑوں اور (خدمت کے غلاموں میں زکاۃ معاف کر دی ہے،نیز دو سو درہم سے کم میں زکاۃ نہیں۔";
nasai.hukam = "";
nasai.description = `۔2480] قد عفوت عن الخیل والرقیق
إسنادہ ضعیف / د 1574،ت 620،جہ 1790   باب زکاۃ الورق`;
nasai.anwaar = [340,1];