var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو الْوَلِيدِ قَالَ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ مُحْرِمٌ مِنْ وَثْءٍ كَانَ بِهِ";
nasai.urdu = "حضرت جابر رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے احرام کی حالت میں سینگی لگوائی کیونکہ آپ (کے پاؤں) کو موچ آگئی تھی۔";
nasai.hukam = "";
nasai.description = `[2851] أن النبي ﷺ احتجم وھو محرم
إسنادہ ضعیف/ د 3863،جہ 3082    حجامۃ المحرم من علۃ تکون بہ`;
nasai.anwaar = [343,1];