var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ سَلَمَةَ بْنِ نُبَيْطٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى جَمَلٍ أَحْمَرَ بِعَرَفَةَ قَبْلَ الصَّلَاةِ";
nasai.urdu = "حضرت نبیط رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہﷺ کو عرفات میں نماز سے پہلے ایک سرخ اونٹ پر خطبہ ارشاد فرماتے دیکھا۔";
nasai.hukam = "";
nasai.description = `[3010۔3011] رأیت رسول اللّٰہ ﷺ یخطب علی جمل أحمر بعرفۃ
إسنادہ ضعیف/ د 1916 الخطبۃ بعرفۃ قبل الصلاۃ`;
nasai.anwaar = [344,1];