var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ الْحَسَنِ الْعُرَنِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَ إِذَا رَمَى الْجَمْرَةَ فَقَدْ حَلَّ لَهُ كُلُّ شَيْءٍ إِلَّا النِّسَاءَ قِيلَ وَالطِّيبُ قَالَ أَمَّا أَنَا فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَضَمَّخُ بِالْمِسْكِ أَفَطِيبٌ هُوَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں کہ جب محرم جمرہ عقبہ کو رمی کر لے تو اس کے لیے عورتوں کے علاوہ ہر چیز حلال ہو جاتی ہے۔ان سے پوچھا گیا: خوشبو؟ فرمایا: میں نے تو رسول اللہﷺ کو دیکھا کہ آپ نے کستوری لگا رکھی تھی۔کیا یہ خوشبو نہیں؟";
nasai.hukam = "";
nasai.description = `[3086] إذا رمی الجمرۃ فقد حل لہ
إسنادہ ضعیف / جہ 3041   باب ما یحل للمحرم بعد رمي الجمار
الحسن العرني ثقۃ أرسل عن ابن عباس رضي اللّٰہ عنہ ( د 1940) فالسند منقطع والثوري عنعن ( تقدم : 1221) و لبعض الحدیث شاھد عند مسلم ( 1189 ) و أحمد ( 244/6 ) وغیرہما وھو یغني عنہ۔
فائدۃ : روی البیہقي ( 5/ 135) عن ابن عمر قال : خطب الناس عمر بن الخطاب رضي اللّٰہ عنہ بعرفۃ فحدثھم عن مناسک الحج فقال فیما یقول : إذا کان بالغداۃ إن شاء اللّٰہ تعالی فدفعتم من جمع فمن رمی جمرۃ القصوی التي عند العقبۃ بسبع حصیات ثم انصرف فنحر ھدیًا إن کان لہ ثم حلق أو قصر فقد حل لہ ما حرم علیہ من شأن الحج۔۔۔إلخ وسندہ صحیح۔`;
nasai.anwaar = [344,1];