var nasai = {};
nasai.arabic = "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا خَالِدٌ عَنْ أَشْعَثَ عَنْ الْحَسَنِ قَالَ تَزَوَّجَ عَقِيلُ بْنُ أَبِي طَالِبٍ امْرَأَةً مِنْ بَنِي جَثْمٍ فَقِيلَ لَهُ بِالرِّفَاءِ وَالْبَنِينَ قَالَ قُولُوا كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَارَكَ اللَّهُ فِيكُمْ وَبَارَكَ لَكُمْ";
nasai.urdu = "حضرت حسن بصری بیان کرتے ہیں کہ حضرت عقیل بن ابی طالب نے بنو جشم کی اییک عورت سے شادی کی تو انہیں مبارک باد یوں دی گئی: ’’تم محبت وپیار سے رہو اور تمہں بیٹے ملیں۔‘‘ حضرت حسن نے فرمایا: اس کی بجائے اس طرح کہو جیسے رسول اللہﷺ فرمایا کرتے تھے:] بَارَکَ اللہُ فِیْکُمْ وَبَارَکَ لَکُم[’’اللہ تعالیٰ تم میں اور تمہارے لیے برکت فرمائے۔‘‘";
nasai.hukam = "";
nasai.description = `[3373] تزوج عقیل بن أبي طالب امرأۃ من بني جشم
إسنادہ ضعیف/ جہ 1906    کیف یدعی للرجل إذا تزوج
الحسن البصري مدلس وعنعن ( د 17) وللحدیث شواھد ضعیفۃ۔
وحدیث أبي داود ( الأصل : 2130) یغني عنہ۔`;
nasai.anwaar = [346,1];