var nasai = {};
nasai.arabic = "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُفِعَ الْقَلَمُ عَنْ ثَلَاثٍ عَنْ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنْ الصَّغِيرِ حَتَّى يَكْبُرَ وَعَنْ الْمَجْنُونِ حَتَّى يَعْقِلَ أَوْ يُفِيقَ";
nasai.urdu = "حضرت عائشہؓ سے روایت ہے کہ نبیﷺ نے فرمایا: ’’تین اشخاص سے قلم اٹھا لیا گیا ہے: سوتے شخص سے حتیٰ کہ وہ جاگ پڑے‘ نابالغ سے حتیٰ کہ وہ بالغ ہوجائے اور مجنون وپاگل سے حتیٰ کہ اسے عقل وہوش آجائے۔";
nasai.hukam = "";
nasai.description = `[3462] رفع القلم عن ثلاث
إسنادہ ضعیف/ د 4398،جہ 2041    باب من لا یقع طلاقہ من الأزواج
إبراھیم النخعي مدلس و عنعن ( د 2235) و لم أجد تصریح سماعہ وانظر ضعیف سنن أبي داود (4399۔4400)`;
nasai.anwaar = [347,1];