var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدِ بْنِ عُبَادَةَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي مَاتَتْ أَفَأَتَصَدَّقُ عَنْهَا قَالَ نَعَمْ قُلْتُ فَأَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ سَقْيُ الْمَاءِ";
nasai.urdu = "حضرت سعد بن عبادہ رضی اللہ عنہ سے راویت ہے کہ میں نے عرض کیا: اے اللہ کے رسول! میری والدہ محترمہ فوت ہوگئی ہیں۔کیا میں ان کی طرف سے صدقہ کرسکتاہوں؟ آپ نے فرمایا: ’’ہاں۔‘‘ میں نے عرض کیا: کون سا صدقہ زیادہ فضیلت رکھتا ہے؟ آپ نے فرمایا: ’’پانی پلانا۔‘‘";
nasai.hukam = "";
nasai.description = `[3694۔3696] نعم،سقي الماء
إسنادہ ضعیف/ د 1679،جہ 3684    ذکر الإختلاف علی سفیان
منقطع۔سعید بن المسیب لم یدرک سعد بن عبادۃ رضي اللّٰہ عنہ،ولبعض الحدیث شاھد تقدم ( الأصل : 3680)`;
nasai.anwaar = [348,1];