var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ عَنْ حَجَّاجٍ قَالَ سَمِعْتُ شُعْبَةَ يُحَدِّثُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ الْحَسَنَ يُحَدِّثُ عَنْ سَعْدِ بْنِ عُبَادَةَ أَنَّ أُمَّهُ مَاتَتْ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي مَاتَتْ أَفَأَتَصَدَّقُ عَنْهَا قَالَ نَعَمْ قَالَ فَأَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ سَقْيُ الْمَاءِ فَتِلْكَ سِقَايَةُ سَعْدٍ بِالْمَدِينَةِ";
nasai.urdu = "حضرت سعد بن عبادہ رضی اللہ عنہ سے مروی ہے کہ ان کی والدہ فوت ہوگئیں تو انہوثں نے رسول اللہﷺ سے کہا: میری والدہ فوت ہوگئی ہیں تو کیا میں ان کی طرف سے صدقہ کردوں؟ آپ نے فرمایا: ’’ہاں۔‘‘ انہوں نے کہا: افضل صدقہ کون سا ہے؟ آپ نے فرمایا: ’’پانی پلانا۔‘‘ اسی بنا پر حضرت سعد رضی اللہ عنہ نے مدینہ میں سبیل قائم کردی تھی (تاکہ مسافر وغیرہ کسی تنگی کے بغیر ہر وقت پانی پی سکیں)۔";
nasai.hukam = "";
nasai.description = `۔3696] نعم،سقي الماء
إسنادہ ضعیف/ د 1679،جہ 3684    ذکر الإختلاف علی سفیان
منقطع۔سعید بن المسیب لم یدرک سعد بن عبادۃ رضي اللّٰہ عنہ،ولبعض الحدیث شاھد تقدم ( الأصل : 3680)`;
nasai.anwaar = [348,1];