var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ عَنْ عِمْرَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ عنہ سے منقول ہے کہ رسول اللہﷺ نے فرمایا: ’’غصے کی حالت میں نذر معتبر نہیں اور اس کا کفارہ کفارئہ قسم ہے۔‘‘";
nasai.hukam = "";
nasai.description = `[3873-3878] لا نذر في غضب
إسنادہ ضعیف کفارۃ النذر
محمد بن الزبیر : متروک ( تق: 5885) ولم أجد لحدیثہ شاہدًا قویًا۔
تنبیہ : ح 3876 سندہ ضعیف و یغني عنہ حدیث ابن الجارود فی المنتقی ( 935 )`;
nasai.anwaar = [349,1];