var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ أَنْبَأَنَا حَمَّادٌ عَنْ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عِمْرَانَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ وَقِيلَ إِنَّ الزُّبَيْرَ لَمْ يَسْمَعْ هَذَا الْحَدِيثَ مِنْ عِمْرَانَ بْنِ حُصَيْنٍ";
nasai.urdu = "حضرت عمران رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’غصے کی حالت میں نذر درست نہیں‘ البتہ اس کا کفارہ قسم والا ہے۔‘‘ کہا گیا ہے کہ زبیر نے یہ حدیث حضرت عمران بن حصین رضی اللہ عنہ سے نہیں سنی۔‘‘";
nasai.hukam = "";
nasai.description = `[3873-3878] لا نذر في غضب
إسنادہ ضعیف کفارۃ النذر
محمد بن الزبیر : متروک ( تق: 5885) ولم أجد لحدیثہ شاہدًا قویًا۔
تنبیہ : ح 3876 سندہ ضعیف و یغني عنہ حدیث ابن الجارود فی المنتقی ( 935 )`;
nasai.anwaar = [349,1];