var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ قَالَ كَانَ عَمَّايَ يَزْرَعَانِ بِالثُّلُثِ وَالرُّبُعِ وَأَبِي شَرِيكَهُمَا وَعَلْقَمَةُ وَالْأَسْوَدُ يَعْلَمَانِ فَلَا يُغَيِّرَانِ";
nasai.urdu = "حضرت عبدالرحمٰن بن اسود نے فرمایا کہ میرے دو چچا تہائی یا چوتھائی حصے کے عوض کاشت کیا کرتے تھے اور میرے والد بھی ان کے ساتھ شریک ہوتے تھے اور حضرت علقمہ اور اسود اس بات کو جانتے تھے لیکن روکتے نہیں تھے۔";
nasai.hukam = "";
nasai.description = `[3964] کان عماي یزرعان بالثلث والربع
إسنادہ ضعیف ذکر إختلاف الألفاظ المأ ثورۃ فی المزارعۃ
أبو إسحاق عنعن ( تقدم : 647) و شریک القاضي مدلس و عنعن ( د 95 )`;
nasai.anwaar = [350,1];