var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ مُخَوَّلٍ عَنْ أَبِي جَعْفَرٍ عَنْ جَابِرٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اغْتَسَلَ أَفْرَغَ عَلَى رَأْسِهِ ثَلَاثًا";
nasai.urdu = "حضرت جابر رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہﷺ جب غسل فرماتے تو سر پر تین دفعہ پانی ڈالتے۔";
nasai.hukam = "حسن یا صحیح";
nasai.description = "یہ حدیث انوار الصحیفہ میں درج نہیں کی گئی، لہٰذا کم از کم حسن یا پھر صحیح ہے۔";