var nasai = {};
nasai.arabic = "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِقْسَمِيُّ قَالَ: حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ،عَنْ حَمَّادِ بْنِ سَلَمَةَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،«أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ السِّنَّوْرِ،وَالْكَلْبِ إِلَّا كَلْبَ صَيْدٍ» قَالَ أَبُو عَبْدِ الرَّحْمَنِ: «وَحَدِيثُ حَجَّاجٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ لَيْسَ هُوَ بِصَحِيحٍ»";
nasai.urdu = "حضرت جابرؓسے مروی ہے کہ رسول اللہ ﷺ نے بلی اور کتے کی قیمت سے منع فرمایا ہے مگر شکاری کتے کی قیمت لی جاسکتی ہے۔\nابو عبد الرحمن(امام نسائی رحمہ اللہ) بیان کرتے ہیں کہ جحاج کی حماد بن سلمہ سے مروی(بیان کردہ) روایت صحیح نہیں۔";
nasai.hukam = "";
nasai.description = `[4300] أن النبيﷺ نھی عن ثمن السنور
إسنادہ ضعیف / یأتي : 4672   الرخصۃ في ثمن کلب الصید
أبو الزبیر عنعن (تقدم : 1176) وللحدیث شواہد ضعیفۃ۔`;
nasai.anwaar = [353,1];