var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَتَّخِذُوا شَيْئًا فِيهِ الرُّوحُ غَرَضًا";
nasai.urdu = "حضرت ابن عباسؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’ایسی چیز جس میں روح ہو اسے نشانہ نہ بناؤ۔‘‘";
nasai.hukam = "حسن یا صحیح";
nasai.description = "یہ حدیث انوار الصحیفہ میں درج نہیں کی گئی، لہٰذا کم از کم حسن یا پھر صحیح ہے۔";