var nasai = {};
nasai.arabic = "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ فُرِضَتْ الصَّلَاةُ رَكْعَتَيْنِ رَكْعَتَيْنِ فَأُقِرَّتْ صَلَاةُ السَّفَرِ وَزِيدَ فِي صَلَاةِ الْحَضَرِ";
nasai.urdu = "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ شروع میں نماز دودورکعتیں فرض ہوئی تھی،پھر سفر کی نماز تو اتنی ہی رہنے دی گئی اور حضر کی نماز میں اضافہ کردیا گیا۔";
nasai.hukam = "حسن یا صحیح";
nasai.description = "یہ حدیث انوار الصحیفہ میں درج نہیں کی گئی، لہٰذا کم از کم حسن یا پھر صحیح ہے۔";