var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الْهُذَيْلِ عَنْ إِبْرَاهِيمَ فِي قَبْضِ الدَّنَانِيرِ مِنْ الدَّرَاهِمِ أَنَّهُ كَانَ يَكْرَهُهَا إِذَا كَانَ مِنْ قَرْضٍ";
nasai.urdu = "حضرت ابراہیم نخعی درہم کی جگہ دینار لینے میں کوئی حرج نہیں سمجھتے تھے مگر جب وہ قرض کے ہوں۔";
nasai.hukam = "";
nasai.description = `[4590] أنہ کان یکرھھا إذا کان
إسنادہ ضعیف أخذ الورق من الذھب والذھب من الورق
سفیان الثوري عنعن (تقدم : 2266) `;
nasai.anwaar = [355,1];