var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا مُوسَى بْنُ نَافِعٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ بِمِثْلِهِ قَالَ أَبُو عَبْد الرَّحْمَنِ كَذَا وَجَدْتُهُ فِي هَذَا الْمَوْضِعِ";
nasai.urdu = "حضرت سعید بن جبیر سے اسی قسم کا قول منقول ہے۔\nابو عبدالرحمٰن (امام نسائی رحمہ اللہ) بیان کرتے ہیں کہ اس جگہ میں نے ایسا ہی پایا ہے۔";
nasai.hukam = "حسن یا صحیح";
nasai.description = "یہ حدیث انوار الصحیفہ میں درج نہیں کی گئی، لہٰذا کم از کم حسن یا پھر صحیح ہے۔";