var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ عَنْ الْمُلَائِيِّ عَنْ سُفْيَانَ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ قَالَ أَنْبَأَنَا أَبُو نُعَيْمٍ عَنْ سُفْيَانَ عَنْ حَنْظَلَةَ عَنْ طَاوُسٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمِكْيَالُ عَلَى مِكْيَالِ أَهْلِ الْمَدِينَةِ وَالْوَزْنُ عَلَى وَزْنِ أَهْلِ مَكَّةَ وَاللَّفْظُ لِإِسْحَقَ";
nasai.urdu = "حضرت ابن عمرؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا: ’’ماپ مدینے والوں کے مطابق ہونا چاہیے اور وزن مکے والوں کے مطابق۔‘‘\nیہ الفاظ اسحاق کے ہیں۔";
nasai.hukam = "";
nasai.description = `[4598] المکیال مکیال أھل المدینۃ
إسنادہ ضعیف/ تقدم :2521ب    الرجحان فی الوزن`;
nasai.anwaar = [355,1];