var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ،قَالَ: أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ،قَالَ: حَدَّثَنِي أَبِي،عَنْ قَتَادَةَ،عَنْ أَبِي نَضْرَةَ،عَنْ عِمْرَانَ بْنِ حُصَيْنٍ،«أَنَّ غُلَامًا لِأُنَاسٍ فُقَرَاءَ قَطَعَ أُذُنَ غُلَامٍ لِأُنَاسٍ أَغْنِيَاءَ،فَأَتَوْا النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَجْعَلْ لَهُمْ شَيْئًا»";
nasai.urdu = "حضرت عمران بن حصین رضی اللہ تعالٰی عنہ سے روایت ہے کہ فقیر لوگوں کے ایک غلام نے مالدار لوگوں کے ایک غلام کا کان کاٹ دیا۔وہ نبی اکرمﷺ کے پاس آئے تو آپ نے ان کو کوئی معاوضہ نہ دلایا۔";
nasai.hukam = "";
nasai.description = `[4755] أن غلامًا لأناس فقراء قطع أذن غلام
إسنادہ ضعیف / د 4590    سقوط القود بین الممالیک فیما دون النفس`;
nasai.anwaar = [356,1];