var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُؤَمَّلُ بْنُ هِشَامٍ،قَالَ: حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ،قَالَ: حَدَّثَنَا أَبُو مَسْعُودٍ سَعِيدُ بْنُ إِيَاسٍ الْجُرَيْرِيُّ،عَنْ أَبِي نَضْرَةَ،عَنْ أَبِي فِرَاسٍ،أَنَّ عُمَرَ قَالَ: «رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُقِصُّ مِنْ نَفْسِهِ»";
nasai.urdu = "حضرت عمر رضی اللہ تعالٰی عنہ بیان کرتے ہیں کہ میں نے دیکھا کہ رسول اللہﷺ اپنی ذات اقدس سے قصاص دلاتے تھے۔";
nasai.hukam = "";
nasai.description = `[4781] رأیت رسول اللّٰہ ﷺ یقص من نفسہ
إسنادہ ضعیف/ د 4537 [بل سندہ حسن کما تقدم ]    القصاص من السلاطین `;
nasai.anwaar = [356,1];