var nasai = {};
nasai.arabic = "أَخْبَرَنَا عِيسَى بْنُ يُونُسَ،قَالَ: حَدَّثَنَا ضَمْرَةُ،عَنْ إِسْمَعِيلَ بْنِ عَيَّاشٍ،عَنْ ابْنِ جُرَيْجٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ: قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَقْلُ الْمَرْأَةِ مِثْلُ عَقْلِ الرَّجُلِ حَتَّى يَبْلُغَ الثُّلُثَ مِنْ دِيَتِهَا»";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا (حضرت عبداللہ بن عمرو رضی اللہ عنہ) سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’عورت کی دیت مرد کے برابر ہے حتیٰ کہ تہائی کو پہنچ جائے۔‘‘";
nasai.hukam = "";
nasai.description = `[4809] عقل المرأۃ مثل عقل الرجل
إسنادہ ضعیف عقل المرأۃ
ابن جریج مکي حجازي وعنعن وھو مدلس ( د 19) وإسماعیل بن عیاش الشامي ضعیف عن غیر أھل بلدہ (أي عن غیر الشامیین ) انظرضعیف سنن الترمذي ( 131) والتقریب (473) والحدیث الآتي ( الأصل : 4810) یغني عنہ۔`;
nasai.anwaar = [357,1];