var nasai = {};
nasai.arabic = "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ،وَمُحَمَّدُ بْنُ مُصَفَّى،قَالَا: حَدَّثَنَا الْوَلِيدُ،عَنْ ابْنِ جُرَيْجٍ،عَنْ عَمْرِو بْنِ شُعَيْبٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَطَبَّبَ وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ قَبْلَ ذَلِكَ فَهُوَ ضَامِنٌ»";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا سے روایت ہے کہ رسول اللہﷺ نے فرمایا: ’’جو شخص ایسے ہی (تکلفاً) طبیب بن کر علاج کرے،حالانکہ (اس سے قبل) وہ مستند طبیب نہیں تھا تو (اگر کوئی نقصان ہو جائے) وہ ضامن (ذمہ دار) ہوگا۔‘‘";
nasai.hukam = "";
nasai.description = `[4834۔4835] من تطبب ولم یعلم منہ طب
إسنادہ ضعیف/ د 4586،جہ 3466    صفۃ شبہ العمد وعلی من دیۃ الأجنۃ إلخ
ابن جریج مدلس ( تقدم : 4809) وعنعن وللحدیث شاھد ضعیف۔`;
nasai.anwaar = [357,1];