var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَعَافَوْا الْحُدُودَ قَبْلَ أَنْ تَأْتُونِي بِهِ فَمَا أَتَانِي مِنْ حَدٍّ فَقَدْ وَجَب";
nasai.urdu = "حضرت عمرو بن شعیب کے پردادا (حضرت عبداللہ بن عمروؓ) سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:’’(ملزموں کو) میرے پاس پیش کرنے سے پہلے حدود معاف کردیا کرو۔میرے پاس کوئی حد والا مقدمہ آیا تو حد لازماً لگے گی۔‘‘";
nasai.hukam = "";
nasai.description = `[4889] تعافوا الحدود قبل أن تأتوني بہ
إسنادہ ضعیف/ د 4376 ما یکون حرزًا ومالا یکون`;
nasai.anwaar = [358,1];