var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ أَبِي بَكْرِ بْنِ عَلِيٍّ عَنْ الْحَجَّاجِ عَنْ مَكْحُولٍ عَنْ ابْنِ مُحَيْرِيزٍ قَالَ سَأَلْتُ فَضَالَةَ بْنَ عُبَيْدٍ عَنْ تَعْلِيقِ يَدِ السَّارِقِ فِي عُنُقِهِ قَالَ سُنَّةٌ قَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَ سَارِقٍ وَعَلَّقَ يَدَهُ فِي عُنُقِهِ";
nasai.urdu = "حضرت ابن محیریز سے روایت ہے،انھوں نے کہا کہ میں نے حضرت فضالہ بن عبید ؓ سے چور کا ہاتھ اسکی گردن میں لٹکانے کے بارے میں پوچھا تو انھوں نے فرمایا (یہ) سنت ہے۔رسول اللہ ﷺ نے ایک چور کاہاتھ کاٹ کر اس کی گردن میں لٹکا دیا تھا۔";
nasai.hukam = "";
nasai.description = `[4985] سألت فضالۃ بن عبید عن تعلیق ید السارق في عنقہ
إسنادہ ضعیف/ د 4411،ت 1447،جہ 2587   تعلیق ید السارق في عنقہ`;
nasai.anwaar = [359,1];