var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّرَجُّلِ إِلَّا غِبًّا";
nasai.urdu = "حضرت عبداللہ بن مغفل﷜ سے مروی ہے کہ رسول اللہﷺ نے بلا ناغہ کنگھی کرنےسے منع فرمایا ہے۔";
nasai.hukam = "";
nasai.description = `[5058] نھی رسول اللّٰہ ﷺ عن الترجل إلا غبًا
إسنادہ ضعیف/ د 4159،ت 1756 الترجل غبًا`;
nasai.anwaar = [360,1];