var nasai = {};
nasai.arabic = "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ سَعِيدِ بْنِ عَامِرٍ عَنْ هَمَّامٍ عَنْ ابْنِ جُرَيْجٍ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ الْخَلَاءَ نَزَعَ خَاتَمَهُ";
nasai.urdu = "حضرت انس ﷜ سے روایت ہے کہ رسول اللہ ﷺ جب بیت الخلاء میں ہوتے تو انگوٹھی اتار دیتے۔";
nasai.hukam = "";
nasai.description = `[5216] أن رسول اللّٰہ ﷺ کان إذا دخل الخلاء
إسنادہ ضعیف /د 29،ت 1746،جہ 303   نزع الخاتم عند دخول الخلاء`;
nasai.anwaar = [363,1];