var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ قَالَ قَتَادَةُ كَانَ أَنَسٌ يَأْمُرُ بِالتَّذْنُوبِ فَيُقْرَضُ";
nasai.urdu = "حضرت قتادہ نے فرمایا کہ حضرت انس ﷜ ہمیں ایک طرف سے پکی ہوئی گدر کھجور لانے کا حکم دیتے،پھر اس کا وہ سرا کاٹ دیا جاتا۔";
nasai.hukam = "";
nasai.description = `[5567] کان أنس یأمرنا بالتذنوب فیقرض
إسنادہ ضعیف ذکر العلۃ التي من أجلھا نھی عن الخلیطین إلخ
سعید بن أبي عروبۃ مدلس و لم یصرح بالسماع ( د 30 ) و قتادۃ أیضًا لم یصرح بالسماع ( تقدم : 467 )`;
nasai.anwaar = [365,1];