var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ ابْنِ عُمَرَ قَالَ الْمُسْكِرُ قَلِيلُهُ وَكَثِيرُهُ حَرَامٌ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہ نے فرمایا نشہ آور چیز تھوڑی بھی حرام ہےاور زیادہ بھی";
nasai.hukam = "";
nasai.description = `[5701] المسکر قلیلہ حرام
إسنادہ ضعیف ذکر الأخبار التي اعتل بھا من أباح شراب المسکر
سلیمان التیمي عنعن ( تقدم : 5647) و الحدیث الآتي ( الأصل : 5702) یغني عنہ۔`;
nasai.anwaar = [367,1];