var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ جَرِيرٍ عَنْ مُغِيرَةَ عَنْ الشَّعْبِيِّ قَالَ كَانَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ يَرْزُقُ النَّاسَ الطِّلَاءَ يَقَعُ فِيهِ الذُّبَابُ وَلَا يَسْتَطِيعُ أَنْ يَخْرُجَ مِنْهُ";
nasai.urdu = "حضرت شعبی سے روایت ہے انھوں نے کہاکہ حضرت علی رضی اللہ عنہ لوگوں کو وہ طلاء پینے دیتے تھے جس میں اگر مکھی گرجاتی تو نکل نہیں سکتی تھی۔";
nasai.hukam = "";
nasai.description = `[5721] کان علي رضي اللّٰہ عنہ یرزق الناس الطلاء
إسنادہ ضعیف ذکر ما یجوز شربہ من الطلاء ومالایجوز
مغیرۃ عنعن (تقدم : 1344) `;
nasai.anwaar = [368,1];