var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ هُشَيْمٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّهُ كَانَ يَشْرَبُ مِنْ الطِّلَاءِ مَا ذَهَبَ ثُلُثَاهُ وَبَقِيَ ثُلُثُهُ";
nasai.urdu = "حضرت ابو موسیٰ اشعری رضی اللہ عنہ سے مروی ہے وہ ایسا طلاء پیتے تھے جس میں سے دو تہائی خشک ہوچکا ہوتا اور ایک تہائی باقی رہ گیا ہوتا۔";
nasai.hukam = "";
nasai.description = `[5724] أنہ کان یشرب من الطلاء
إسنادہ ضعیف ذکر ما یجوز شربہ من الطلاء ومالایجوز
إسماعیل بن أبي خالد مدلس و عنعن ( تقدم : 4784) `;
nasai.anwaar = [368,1];