var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ حَيْوَةَ بْنِ شُرَيْحٍ قَالَ أَخْبَرَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ اشْرَبْ الْعَصِيرَ مَا لَمْ يُزْبِدْ";
nasai.urdu = "حضرت سعید بن مسیب نے فرمایا کہ انگوروں کا جوس اس وقت پی سکتے ہو جب تک اس میں جھاگ پیدا نہ ہو۔";
nasai.hukam = "";
nasai.description = `[5734] اشرب العصیرۃ ما لم یزبد
إسنادہ ضعیف ذکر ما یجوز شربہ فی الطلاء وما لا یجوز
ابن شھاب الزہري عنعن ( تقدم : 216۔217 ) `;
nasai.anwaar = [368,1];