var nasai = {};
nasai.arabic = "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ سُفْيَانَ عَنْ أَبِي جَعْفَرٍ عَنْ أَبِي سَلْمَانَ عَنْ أَبِي مَحْذُورَةَ قَالَ كُنْتُ أُؤَذِّنُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُنْتُ أَقُولُ فِي أَذَانِ الْفَجْرِ الْأَوَّلِ حَيَّ عَلَى الْفَلَاحِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ";
nasai.urdu = "حضرت ابومحذورہ رضی اللہ عنہ بیان کرتے ہیں کہ میں رسول اللہ ﷺ کے حکم سے اذان کہا کرتا تھا اور میں فجر کی پہلی اذان میں [حی علی الفلاح] کے بعد [الصلاۃ خیر من النوم،الصلاۃ خیر من النوم،اللہ أکبر اللہ أکبر،لا إلہ إلا اللہ] کہا کرتا تھا۔";
nasai.hukam = "";
nasai.description = `[648۔649] کنت أؤذن لرسول اللّٰہ ﷺ
إسنادہ ضعیف التثویب في أذان الفجر
أبو سلمان ہمام المؤذن مجھول الحال و أبو جعفر مجھول لیس ھو الفراء و الحدیث السابق ( الأصل : 634) یغني عنہ۔`;
nasai.anwaar = [325,1];