var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى وَعَبْدُ الرَّحْمَنِ قَالَا حَدَّثَنَا سُفْيَانُ بِهَذَا الْإِسْنَادِ نَحْوَهُ قَالَ أَبُو عَبْد الرَّحْمَنِ وَلَيْسَ بِأَبِي جَعْفَرٍ الْفَرَّاءِ";
nasai.urdu = "حضرت سفیان کی یہ حدیث اسی سند کے ساتھ ہمیں عمرو بن علی کے واسطے سے بھی پہنچی ہے۔امام ابو عبدالرحمٰن (نسائی) رحمہ اللہ فرماتے ہیں: (سند میں مذکور حضرت سفیان کے استاد) ابوجعفر سے،ابوجعفر فراء مراد نہیں۔";
nasai.hukam = "";
nasai.description = `۔649] کنت أؤذن لرسول اللّٰہ ﷺ
إسنادہ ضعیف التثویب في أذان الفجر
أبو سلمان ہمام المؤذن مجھول الحال و أبو جعفر مجھول لیس ھو الفراء و الحدیث السابق ( الأصل : 634) یغني عنہ۔`;
nasai.anwaar = [325,1];