var nasai = {};
nasai.arabic = "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ عَنْ كَثِيرِ بْنِ كَثِيرٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ بِالْبَيْتِ سَبْعًا ثُمَّ صَلَّى رَكْعَتَيْنِ بِحِذَائِهِ فِي حَاشِيَةِ الْمَقَامِ وَلَيْسَ بَيْنَهُ وَبَيْنَ الطُّوَّافِ أَحَدٌ";
nasai.urdu = "حضرت کثیر اپنے والد سے بیان کرتے ہیں کہ میں نے رسول اللہ ﷺ کو دیکھا،آپ نے بیت اللہ کے سات چکر لگائے،پھر بیت اللہ کے سامنے کھڑے ہو کر مقام ابراہیم کے ایک کنارے کے ساتھ دو رکعتیں پڑھیں اور آپ کے اور طواف کرنے والوں کے درمیان کوئی نہ تھا۔";
nasai.hukam = "";
nasai.description = `[759] رأیت رسول اللّٰہ ﷺ طاف بالبیت سبعًا
إسنادہ ضعیف / د 2016،جہ 2958،یأتي : 2962  الرخصۃ في ذلک
کثیر لم یسمع من أبیہ،بینھما مجہول،انظرضعیف سنن أبي داود : 2016 `;
nasai.anwaar = [326,1];