var nasai = {};
nasai.arabic = "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ أُوتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعًا مِنْ الْمَثَانِي السَّبْعَ الطُّوَلَ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ نبی ﷺ کو سبع مثانی دی گئیں،یعنی سات لمبی سورتیں۔";
nasai.hukam = "";
nasai.description = `[916] أوتي النبيﷺ سبعًا من المثاني
إسنادہ ضعیف / د 1459    تأویل قول اللّٰہ عزوجل:﴿ ولقدآتیناک سبعًا۔۔﴾`;
nasai.anwaar = [327,1];