var nasai = {};
nasai.arabic = "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ فِي قَوْلِهِ عَزَّ وَجَلَّ سَبْعًا مِنْ الْمَثَانِي قَالَ السَّبْعُ الطُّوَلُ";
nasai.urdu = "حضرت ابن عباس رضی اللہ عنہما نے اللہ تعالیٰ کے فرمان (سبعا من المثانی) کے بارے میں فرمایا کہ اس سے سات لمبی سورتیں مراد ہیں۔";
nasai.hukam = "";
nasai.description = `[917] السبع الطول
إسنادہ ضعیف الصف بین القدمین فی الصلاۃ
أبو إسحاق عنعن ( تقدم : 647 ) `;
nasai.anwaar = [327,1];