var nasai = {};
nasai.arabic = "أَخْبَرَنَا الْفَضْلُ بْنُ سَهْلٍ قَالَ حَدَّثَنِي أَبُو الْجَوَّابِ قَالَ حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ عَنْ أَبِي إِسْحَقَ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَ رَمَقْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِشْرِينَ مَرَّةً يَقْرَأُ فِي الرَّكْعَتَيْنِ بَعْدَ الْمَغْرِبِ وَفِي الرَّكْعَتَيْنِ قَبْلَ الْفَجْرِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ";
nasai.urdu = "حضرت ابن عمر رضی اللہ عنہما سے مروی ہے،انھوں نے فرمایا: میں نے بیس (۲۰) دفعہ رسول اللہ ﷺ کو مغرب کے بعد کی دو ستنوں اور فجر سے قبل کی دو سنتوں میں (قل یایھا الکفرون) اور (قل ھو اللہ احد) پڑھتے دیکھا ہے۔";
nasai.hukam = "";
nasai.description = `[993] رمقت رسول اللّٰہ ﷺ عشرین مرّۃ
إسنادہ ضعیف/ ت 417،جہ 1149 القراء ۃ فی الرکعتین بعد المغرب`;
nasai.anwaar = [328,1];