var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ رَجُلٍ عَنْ أَبِي الْعَالِيَةِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي سُجُودِ الْقُرْآنِ بِاللَّيْلِ يَقُولُ فِي السَّجْدَةِ مِرَارًا سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ رسول اللہ ﷺ رات کو سجدہ قرآن میں یہ دعا تکرار سے پڑھا کرتے تھے « سجد وجہی للذی خلقہ وشق سمعہ وبصرہ بحولہ وقوتہ» ’’میرا چہرہ اس ذات کے لیے سجدہ ریز ہے جس نے اس کو پیدا کیا اور اپنی طاقت اور قوت سے اس کے کان اور آنکھ بنائے۔‘‘";
abudawood.hukam = "";
abudawood.description = `[1414] کان رسول اللّٰہ ﷺ یقول في سجود القرآن۔۔۔سجد وجھي
إسنادہ ضعیف / ت 580،3425،ن 1130  باب ما یقول إذا سجد
رجل : مجہول،والحدیث صحیح فی السجود مطلقًا،انظر سنن أبي داود (760) وصحیح مسلم ( 771 )`;
abudawood.anwaar = [56,1];