var abudawood = {};
abudawood.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا عِيسَى عَنْ زَكَرِيَّا عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمٍ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَهْلَ الْقُرْآنِ أَوْتِرُوا فَإِنَّ اللَّهَ وِتْرٌ يُحِبُّ الْوِتْرَ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا: ’’اے قرآن والو! وتر پڑھا کرو۔بلاشبہ اللہ عزوجل وتر (اکیلا) ہے،وتر کو پسند کرتا ہے۔‘‘";
abudawood.hukam = "";
abudawood.description = `[1416] یا أھل القرآن أوتروا
إسنادہ ضعیف/ ت 453،ن 1676،جہ 1169 باب استحباب الوتر
أبو إسحاق السبیعي مدلس وعنعن ( تقدم : 162) وللحدیث شواھد ضعیفۃ عند أحمد ( 1/ 107) وأبي نعیم ( حلیۃ الأولیاء 313/7) وغیرہما۔`;
abudawood.anwaar = [57,1];