var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ،حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ،حَدَّثَنَا خُصَيْفٌ،عَنْ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ،قَالَ: سَأَلْتُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ: بِأَيِّ شَيْءٍ كَانَ يُوتِرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟... فَذَكَرَ مَعْنَاهُ،قَالَ: وَفِي الثَّالِثَةِ بِقُلْ هُوَ اللَّهُ أَحَدٌ[أول سورة الإخلاص]،وَالْمُعَوِّذَتَيْنِ.";
abudawood.urdu = "عبدالعزیز بن جریج کہتے ہیں کہ میں نے ام المؤمنین سیدہ عائشہ رضی اللہ عنہا سے سوال کیا کہ رسول اللہ ﷺ وتروں میں کیا پڑھا کرتے تھے؟ تو مذکورہ بالا حدیث کے ہم معنی بیان کیا اور کہا: ’’تیسری رکعت میں «قل ہو اللہ أحد» اور ’’معوذتین‘‘ (سورۃ الفلق اور سورۃ الناس) پڑھا کرتے تھے۔‘‘";
abudawood.hukam = "";
abudawood.description = `[1424] وفی الثالثۃ بقل ھو اللّٰہ أحد
إسنادہ ضعیف/ ت 463،جہ 1173[و الحدیث حسن ]    باب ما یقرأ فی الوتر
خصیف ضعیف مشہور ( تقدم : 266 ) و لہ شاہد حسن لذاتہ عند ابن حبان ( 2423)`;
abudawood.anwaar = [57,1];