var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ حَدَّثَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ مَيْمُونٍ صَاحِبَ الْأَنْمَاطِ حَدَّثَنِي أَبُو عُثْمَانَ عَنْ سَلْمَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ رَبَّكُمْ تَبَارَكَ وَتَعَالَى حَيِيٌّ كَرِيمٌ يَسْتَحْيِي مِنْ عَبْدِهِ إِذَا رَفَعَ يَدَيْهِ إِلَيْهِ أَنْ يَرُدَّهُمَا صِفْرًا";
abudawood.urdu = "سیدنا سلمان فارسی رضی اللہ عنہ سے روایت ہے انہوں نے کہا کہ رسول اللہ ﷺ نے فرمایا ’’بلاشبہ تمہارا رب بہت حیا والا اور سخی ہے۔بندہ جب اس کی طرف اپنے ہاتھ اٹھاتا ہے تو اسے حیا آتی ہے کہ انہیں خالی لوٹا دے۔‘‘";
abudawood.hukam = "";
abudawood.description = `[1488] إن ربکم حیي کریم
إسنادہ ضعیف/ ت 3556،جہ 3865   باب الدعاء
جعفر بن میمون ضعیف ( تقدم : 819) وتابعہ سلیمان التیمي وھو مدلس ( طبقات المدلسین : 54/ 2 وھو من الثالثۃ ) وعنعن وزعم الحافظ ابن حجر خلافہ وقولہ مرجوح۔وانظر الحدیث الآتي : 2312
------------
معاذ علی زئی:
وتابعہ ابو المعلیٰ یحییٰ بن میمون عند المحاملی فی المالیہ ح 433 وسندہ حسن۔
انظر ابن ماجہ بتحقیق شیخ ندیم ظہیر ح 3865`;
abudawood.anwaar = [59,1];