var abudawood = {};
abudawood.arabic = "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ مَرَّ عَلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَدْعُو بِأُصْبُعَيَّ فَقَالَ أَحِّدْ أَحِّدْ وَأَشَارَ بِالسَّبَّابَةِ";
abudawood.urdu = "سیدنا سعد بن ابی وقاص رضی اللہ عنہ بیان کرتے ہیں کہ نبی کریم ﷺ میرے پاس سے گزرے اور میں اپنی دو انگلیاں اٹھائے دعا کر رہا تھا تو آپ ﷺ نے فرمایا ’’ایک سے،ایک سے۔‘‘ اور انگشت شہادت سے اشارہ فرمایا۔";
abudawood.hukam = "";
abudawood.description = `[1499] مر علي النبي ﷺ وأنا أدعوبأصبعي
إسنادہ ضعیف/ ن 1274 باب الدعاء 
الأعمش مدلس ( تقدم : 14 ) وعنعن وللحدیث شواھد ضعیفۃ عند الترمذي ( 3557) وابن أبي شیبۃ ( 10 / 383 ح 29685 ) وأحمد ( 3/ 183 ح 12901 ) وغیرھم فالحدیث ضعیف والإشارۃ بالإصبع الواحدۃ السبابۃ صحیح انظر کتابي : نیل المقصود في تحقیق سنن أبي داود ( 991 ) `;
abudawood.anwaar = [60,1];