var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا ضُبَارَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي السُّلَيْكِ عَنْ دُوَيْدِ بْنِ نَافِعٍ حَدَّثَنَا أَبُو صَالِحٍ السَّمَّانُ قَالَ قَالَ أَبُو هُرَيْرَةَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الشِّقَاقِ وَالنِّفَاقِ وَسُوءِ الْأَخْلَاقِ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ انہوں نے کہا،رسول اللہ ﷺ یہ دعا فرمایا کرتے تھے «اللہم إنی أعوذ بک من الشقاق،والنفاق،وسوء الأخلاق» ’’اے اللہ! میں تیری پناہ چاہتا ہوں اس بات سے کہ (حق کی) مخالفت کروں یا منافق اور بداخلاق بنوں۔‘‘";
abudawood.hukam = "";
abudawood.description = `[1546] اللھم إني أعوذ بک من الشقاق
إسنادہ ضعیف/ ن 5473 باب فی الإستعاذۃ
ضبارۃ مجہول ( تقدم : 430) `;
abudawood.anwaar = [61,1];