var abudawood = {};
abudawood.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سَعْدِ بْنِ سِنَانٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُعْتَدِي الْمُتَعَدِّي فِي الصَّدَقَةِ كَمَانِعِهَا";
abudawood.urdu = "سیدنا انس بن مالک رضی اللہ عنہ سے مروی ہے رسول اللہ ﷺ نے فرمایا ’’زکوٰۃ وصول کرنے میں زیادتی کرنے والا،اسی طرح ہے جیسے کہ زکوٰۃ نہ دینے والا۔‘‘";
abudawood.hukam = "";
abudawood.description = `[1585] المعتدي فی الصدقۃ کمانعھا
إسنادہ ضعیف / ت 646،جہ 1808   باب في زکاۃ السائمۃ
سعد بن سنان صدوق لکن : روایۃ یزید بن أبي حبیب عن سعد بن سنان منکرۃ کما فی الضعفاء الکبیر للعقیلي (119/2) عن أحمد بن حنبل و سندہ حسن و ھذہ منھا وللحدیث شاھد ضعیف عند الطبراني فی الکبیر (306/2)`;
abudawood.anwaar = [64,1];