var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبَّدَ رَأْسَهُ بِالْعَسَلِ";
abudawood.urdu = "سیدنا عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں کہ رسول اللہ ﷺ نے «عسل» کے ساتھ اپنے بال چپکائے ہوئے تھے۔";
abudawood.hukam = "";
abudawood.description = `[1748] أن النبيﷺ لبد رأسہ بالعسل
إسنادہ ضعیف باب التلبید
ابن إسحاق عنعن ( تقدم: 47) `;
abudawood.anwaar = [69,1];