var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ وَمُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ قَالَا حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَبَحَ عَمَّنْ اعْتَمَرَ مِنْ نِسَائِهِ بَقَرَةً بَيْنَهُنَّ";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے اپنی ازواج کی طرف سے،جنہوں نے عمرہ کیا تھا،ایک گائے ذبح کی تھی۔";
abudawood.hukam = "";
abudawood.description = `[1751] أن رسول اللّٰہ ﷺ ذبح عمن اعتمر 
إسنادہ ضعیف/ جہ 3133    باب في ھدي البقر
یحیی بن أبي کثیر مدلس ( تقدم : 293) وعنعن۔وحدیث البخاري (1709) و مسلم ( 125 / 1211،1319) یغني عنہ۔`;
abudawood.anwaar = [69,2];