var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا هُشَيْمٌ عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُلَبِّي الْمُعْتَمِرُ حَتَّى يَسْتَلِمَ الْحَجَرَ قَالَ أَبُو دَاوُد رَوَاهُ عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ وَهَمَّامٌ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ مَوْقُوفًا";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما نبی کریم ﷺ سے نقل کرتے ہیں کہ آپ ﷺ فرمایا ’’عمرہ کرنے والا حجر اسود کو ہاتھ لگانے (یا بوسہ دینے) تک تلبیہ کہتا رہے۔‘‘ امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ اس حدیث کو عبدالملک بن ابی سلیمان اور ہمام نے عطاء سے انہوں نے سیدنا ابن عباس رضی اللہ عنہما سے موقوف روایت کیا ہے۔";
abudawood.hukam = "";
abudawood.description = `[1817] یلبي المعتمر حتی یستلم الحجر
إسنادہ ضعیف/ ت 919  باب متی یقطع المعتمر التلبیۃ؟
محمد بن أبي لیلی ضعیف ( تقدم : 752) `;
abudawood.anwaar = [71,1];