var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ إِدْرِيسَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ بِإِسْنَادِهِ فِي مِثْلِ هَذَا الْحَدِيثِ زَادَ وَلَمْ يَقُمْ عِنْدَهَا";
abudawood.urdu = "یزید بن ابی زیاد نے اپنی سند سے اسی کے مثل روایت کیا اور اضافہ کیا کہ آپ ﷺ جمرہ کے پاس رکے نہیں۔";
abudawood.hukam = "";
abudawood.description = `۔1968] رأیت رسول اللّٰہ ﷺ عند جمرۃ العقبۃ راکبًا
إسنادہ ضعیف/انظر الحدیث السابق :1966    باب في رمي الجمار `;
abudawood.anwaar = [76,1];