var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ،حَدَّثَنَا هَمَّامٌ،حَدَّثَنَا قَتَادَةُ عَنِ النَّضْرِ بْنِ أَنَسٍ،عَنْ بَشِيرِ بْنِ نَهِيكٍ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،قَال:َ >مَنْ كَانَتْ لَهُ امْرَأَتَانِ،فَمَالَ إِلَى إِحْدَاهُمَا, جَاءَ يَوْمَ الْقِيَامَةِ وَشِقُّهُ مَائِلٌ.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ،نبی کریم ﷺ سے بیان کرتے ہیں کہ آپ ﷺ نے فرمایا ’’جس شخص کی دو بیویاں ہوں اور پھر وہ کسی ایک کی طرف مائل ہو گیا تو وہ قیامت کے روز اس کیفیت میں آئے گا کہ اس کا ایک پہلو جھکا ہوا ہو گا۔‘‘";
abudawood.hukam = "";
abudawood.description = `[2133] من کانت لہ امرأتان فمال إلی إحداھما
إسنادہ ضعیف / ت 1141،ن 3394،جہ 1969   باب فی القسم بین النساء
قتادۃ عنعن ( تقدم : 29) وللحدیث شاہد عند أبي نعیم في أخبار أصبہان (300/2) فیہ محمد بن الحارث الحارثي ضعیف (تق: 5797) `;
abudawood.anwaar = [81,1];