var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ زَيْدٍ،حَدَّثَنَا أَبِي،عَنْ سُفْيَانَ،عَنْ يَحْيَى بْنِ سَعِيدٍ،عَنْ سُلَيْمَانَ بْنِ يَسَارٍ, فِي خُرُوجِ فَاطِمَةَ،قَالَ: إِنَّمَا كَانَ ذَلِكَ مِنْ سُوءِ الْخُلُقِ.";
abudawood.urdu = "فاطمہ بنت قیس رضی اللہ عنہا کے گھر تبدیل کرنے کے سلسلے میں سلیمان بن یسار سے مروی ہے کہ ’’یہ اس کی بدخلقی کی وجہ سے تھا۔‘‘ (زبان کی تیز تھیں)۔";
abudawood.hukam = "";
abudawood.description = `[2294] إنما کان ذلک من سوء الخلق
إسنادہ ضعیف باب من أنکر ذلک علی فاطمۃ بنت قیس
السند مرسل مع عنعنۃ الثوري (تقدم : 130) `;
abudawood.anwaar = [86,1];