var abudawood = {};
abudawood.arabic = "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ،حَدَّثَنَا شُعْبَةُ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ،عَنْ مِقْسَمٍ عَنِ ابْنِ عَبَّاسٍ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ صَائِمٌ مُحْرِمٌ.";
abudawood.urdu = "مقسم،سیدنا ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ رسول اللہ ﷺ نے روزے اور احرام کی حالت میں سینگی لگوائی ہے۔";
abudawood.hukam = "";
abudawood.description = `[2373] أن رسول اللّٰہ احتجم وھو صائم محرم
إسنادہ ضعیف/ ت 777  باب فی الرخصۃ في ذلک
یزید بن أبي زیاد : ضعیف ( تقدم : 749 ) والحدیث السابق ( الأصل : 2372) یغني عنہ۔`;
abudawood.anwaar = [88,1];