var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ،أَخْبَرَنَا يَحْيَى بْنُ آدَمَ،عَنْ قُطْبَةَ بْنِ عَبْدِ الْعَزِيزِ بْنِ سِيَاهٍ عَنِ الْأَعْمَشِ،عَنْ أَبِي يَحْيَى الْقَتَّاتِ،عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ،قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ التَّحْرِيشِ بَيْنَ الْبَهَائِمِ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما سے مروی ہے کہ رسول اللہ ﷺ نے اس بات سے منع فرمایا ہے کہ جانوروں کو آپس میں لڑایا جائے۔";
abudawood.hukam = "";
abudawood.description = `[2562] نھی رسول اللّٰہ ﷺ عن التحریش بین البھائم
إسنادہ ضعیف / ت 1708    باب فی التحریش بین البھائم
الأعمش عنعن ( تقدم : 14) `;
abudawood.anwaar = [94,1];