var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ بَحْرِ بْنِ بَرِّيٍّ،حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ،حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ،عَنْ نَافِعٍ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: >إِذَا خَرَجَ ثَلَاثَةٌ فِي سَفَرٍ فَلْيُؤَمِّرُوا أَحَدَهُمْ<.";
abudawood.urdu = "سیدنا ابو سعید خدری رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جب تین افراد سفر پر نکلیں تو چاہیئے کہ ایک کو اپنا امیر مقرر کر لیں۔‘‘";
abudawood.hukam = "";
abudawood.description = `[2608] إذا خرج ثلاثۃ في سفر فلیؤمروا أحدھم
إسنادہ ضعیف باب فی القوم یسافرون یؤمرون أحدھم
ابن عجلان عنعن (تقدم : 128) وانظر الحدیث الآتي : 2609`;
abudawood.anwaar = [95,1];