var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى وَزِيَادُ بْنُ أَيُّوبَ،قَالَا: حَدَّثَنَا هُشَيْمٌ،أَخْبَرَنَا مُغِيرَةُ،عَنْ شِبَاكٍ،عَنْ إِبْرَاهِيمَ،عَنْ هُنَيِّ بْنِ نُوَيْرَةَ،عَنْ عَلْقَمَةَ،عَنْ عَبْدِ اللَّهِ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: >أَعَفُّ النَّاسِ قِتْلَةً أَهْلُ الْإِيمَانِ<.";
abudawood.urdu = "سیدنا عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’قتل کرنے کے معاملے میں سب سے اچھے لوگ اہل ایمان ہوتے ہیں۔‘‘ (وہ مقتول کے ناک کان وغیرہ نہیں کاٹتے)۔";
abudawood.hukam = "";
abudawood.description = `[2666] أعف الناس قتلۃً أھل الإیمان
إسنادہ ضعیف / جہ 2681،2682 باب فی النھي عن المثلۃ
مغیرۃ و إبراہیم النخعي عنعنا ( تقدما : 1073،2235) `;
abudawood.anwaar = [97,1];