var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الْأَعْمَشِ،عَنْ أَبِي سُفْيَانَ،عَنْ جَابِرٍ،قَالَ: كُنْتُ أَمِيحُ أَصْحَابِي الْمَاءَ يَوْمَ بَدْرٍ .";
abudawood.urdu = "سیدنا جابر (بن عبداللہ رضی اللہ عنہ) کا بیان ہے کہ میں بدر کے روز اپنے اصحاب کے لیے کنویں سے پانی بھرتا رہا تھا۔(کنویں میں اتر کر ہاتھوں سے ڈول بھرتا تھا کیونکہ نیچے پانی کم تھا)۔";
abudawood.hukam = "";
abudawood.description = `[2731] کنت أمیح أصحابي الماء یوم بدر
إسنادہ ضعیف باب فی المرأۃ والعبد یحذیان من الغنیمۃ
الأعمش عنعن ( تقدم : 14) ویعارضہ حدیث مسلم (1813) وھو الصواب۔`;
abudawood.anwaar = [99,1];