var abudawood = {};
abudawood.arabic = "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ،حَدَّثَنَا حَفْصٌ،عَنْ جَعْفَرٍ،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ،قَالَ: كَانَ رَسُولُ اللَّهِ يُضَحِّي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ فَحِيلٍ،يَنْظُرُ فِي سَوَادٍ،وَيَأْكُلُ فِي سَوَادٍ،وَيَمْشِي فِي سَوَادٍ.";
abudawood.urdu = "سیدنا ابوسعید رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ ﷺ ایسا مینڈھا قربانی کیا کرتے تھے جو سینگوں والا اور نر (غیر خصی) ہوتا ‘ جو سیاہی میں دیکھتا (آنکھیں سیاہ ہوتیں) ‘ سیاہی میں کھاتا (منہ کالا ہوتا) اور سیاہی میں چلتا تھا (پاؤں بھی کالے ہوتے)۔";
abudawood.hukam = "";
abudawood.description = `[2796] کان رسول اللّٰہ ﷺ یضحي بکبش أقرن
سندہ ضعیف / ت 1496،ن 4395،جہ 3128 باب ما یستحب من الضحایا
حفص بن غیاث مدلس و عنعن / و أبو جعفر محمد بن علي لم یسمع من أبي سعید کما في اتحاف المھرۃ (403/5) و حدیث مسلم ( 1967) یغني عنہ۔`;
abudawood.anwaar = [185,1];