var abudawood = {};
abudawood.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،حَدَّثَنَا عَبْدُ الرَّزَّاقِ،أَخْبَرَنَا مَعْمَرٌ،عَنْ الزُّهْرِيِّ،عَنْ سَعِيدٍ،قَالَ: الْفَرَعُ أَوَّلُ النَّتَاجِ, كَانَ يُنْتَجُ لَهُمْ فَيَذْبَحُونَهُ.";
abudawood.urdu = "جناب سعید بن مسیب رحمہ اللہ سے مروی ہے کہ «فرع» اس بچے کو کہتے تھے جو ان کے جانوروں میں سب سے پہلے پیدا ہوتا،پھر وہ اسے ذبح کر دیتے تھے۔";
abudawood.hukam = "";
abudawood.description = `[2832] الفرع أول النتاج
إسنادہ ضعیف باب فی العتیرۃ
سندہ ضعیف من أجل عنعنۃ الزھري ( تقدم : 145) ومعناہ صحیح بالإتفاق۔`;
abudawood.anwaar = [102,1];