var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنْ الْأُمَمِ لَأَمَرْتُ بِقَتْلِهَا فَاقْتُلُوا مِنْهَا الْأَسْوَدَ الْبَهِيمَ";
abudawood.urdu = "سیدنا عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’اگر یہ بات نہ ہوتی کہ کتے بھی (اللہ کی مخلوق اور) امتوں میں سے ایک امت ہیں،تو میں ان کے قتل کرنے کا حکم دے دیتا،(بہرحال) ان میں سے جو کالا سیاہ ہو،اسے مار ڈالا کرو۔“";
abudawood.hukam = "";
abudawood.description = `[2845] لو لا أن الکلاب أمۃ من الأمم
إسنادہ ضعیف / ت 1486،1489،ن 4285،جہ 3205    باب اتخاذ الکلب للصید وغیرہ
الحسن البصري عنعن ( تقدم : 17) و للحدیث شواہد ضعیفۃ عند الطبراني ( الکبیر 11/ 349) و أبي یعلی (2442) و ابن حبان ( الموارد : 1083،الإحسان : 5629) وغیرہم والحدیث الآتي ( الأصل : 2846) یغني عنہ۔`;
abudawood.anwaar = [103,1];