var abudawood = {};
abudawood.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أَحْمَدَ أَخْبَرَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَتْ صَفِيَّةُ مِنْ الصَّفِيِّ";
abudawood.urdu = "ام المؤمنین سیدہ عائشہ رضی اللہ عنہا کا بیان ہے کہ سیدہ صفیہ رضی اللہ عنہا (ام المؤمنین) آپ ﷺ کے حصہ «صفی» میں آئی تھیں۔";
abudawood.hukam = "";
abudawood.description = `[2994] کانت صفیۃ من الصفي
إسنادہ ضعیف باب ما جاء في سھم الصفي
الثوري عنعن ( تقدم : 130) `;
abudawood.anwaar = [109,1];