var abudawood = {};
abudawood.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا جَرِيرٌ عَنْ قَابُوسَ بْنِ أَبِي ظَبْيَانَ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَكُونُ قِبْلَتَانِ فِي بَلَدٍ وَاحِدٍ";
abudawood.urdu = "سیدنا ابن عباس رضی اللہ عنہما بیان کرتے ہیں کہ سول اللہ ﷺ نے فرمایا ’’ایک ملک (عرب) میں دو قبلے نہیں ہو سکتے۔‘‘";
abudawood.hukam = "";
abudawood.description = `[3032] لا تکون قبلتان في بلد واحد
إسنادہ ضعیف / ت 633،634    باب في إخراج الیھود من جزیرۃ العرب
قابوس : فیہ لین ( تق : 5445) ضعیف ضعفہ الجمہور۔`;
abudawood.anwaar = [110,1];