var abudawood = {};
abudawood.arabic = "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ مُعَاذٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ";
abudawood.urdu = "جنال مسروق نے بسند حضرت معاذ رضی اللہ عنہ نبی ﷺ سے مذکورہ بالا روایت کے ہم معنی ورایت بیان کی۔";
abudawood.hukam = "";
abudawood.description = `۔3039] أن النبي ﷺ لما وجھہ إلی الیمن
ضعیف / ت 623،ن 2455،جہ 1803[تقدم : 1576]    باب في أخذ الجزیۃ`;
abudawood.anwaar = [111,1];