var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَمُحَمَّدُ بْنُ مَكِّيٍّ الْمَرْوَزِيُّ الْمَعْنَى قَالَا حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ وَلَيْسَ بِالنَّهْدِيِّ عَنْ أَبِيهِ عَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَءُوا يس عَلَى مَوْتَاكُمْ وَهَذَا لَفْظُ ابْنِ الْعَلَاءِ";
abudawood.urdu = "سیدنا معقل بن یسار رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا ’’اپنے مرنے والوں پر سورۃ یسن پڑھا کرو۔‘‘ اور یہ لفظ ابن العلاء کے ہیں۔";
abudawood.hukam = "";
abudawood.description = `[3121] اقرؤا ((یٰس)) علی موتاکم
إسنادہ ضعیف/ جہ 1448    باب القراء ۃ عند المیت
أبو عثمان ھذا مجہول کما قال ابن المدیني وغیرہ وأبوہ لا یعرف،انظر التحریر (8240) والحدیث ضعفہ الدار قطني۔`;
abudawood.anwaar = [115,1];