var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أُخْبِرْتُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُبْرِزْ فَخِذَكَ وَلَا تَنْظُرَنَّ إِلَى فَخِذِ حَيٍّ وَلَا مَيِّتٍ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے روایت ہے کہ نبی کریم ﷺ نے فرمایا ’’اپنی ران عریاں نہ کر اور نہ کبھی کسی زندہ یا میت کی ران کو دیکھ۔‘‘";
abudawood.hukam = "";
abudawood.description = `[3140] لا تبرز فخذک ولا تنظر إلی فخذ حيٍّ ولا میتٍ
ضعیف جدًا / جہ 1460 ویأتي : 4015    باب في ستر المیت عند غسلہ
حبیب ( تقدم : 298 ) عنعن والواسطۃ بینہ وبین شیخہ ھو عمرو بن خالد الواسطي والواسطي متروک رماہ وکیع بالکذب ( تق : 5021) `;
abudawood.anwaar = [116,1];