var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا يَحْيَى عَنِ ابْنِ أَبِي ذِئْبٍ،حَدَّثَنِي صَالِحٌ مَوْلَى التَّوْأَمَةِ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم:َ >مَنْ صَلَّى عَلَى جَنَازَةٍ فِي الْمَسْجِدِ،فَلَا شَيْءَ عَلَيْهِ<.";
abudawood.urdu = "سیدنا ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جس نے کسی میت کا جنازہ مسجد میں ادا کیا تو اس پر کوئی گناہ نہیں۔“";
abudawood.hukam = "";
abudawood.description = `[3191] من صلّی علٰی جنازۃ فی المسجد
إسنادہ ضعیف / جہ 1517   باب الصلاۃ علی الجنازۃ فی المسجد
صالح بن نبھان مولی التوأمۃ اختلط واختلف المحدثون في سماع ابن أبي ذئب منہ أقبل اختلاطہ أم بعد اختلاطہ ؟ و قال البخاري : ’’ و ابن أبي ذئب سماعہ منہ أخیرًا یروي عنہ مناکیر۔‘‘ (العلل الکبیر للترمذي و معرفۃ السنن والآثار للبیہقي 3؍181) فالسند ضعیف من أجل الشک في تحدیثہ قبل اختلاطہ و مع ذلک ھو ضعیف ضعفہ الجمھور و الحدیث ضعیف باتفاق المحدثین۔`;
abudawood.anwaar = [118,1];