var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ،حَدَّثَنَا أَبِي،عَنْ مُحَمَّدِ بْنِ أَبِي يَحْيَى،عَنْ يَزِيدَ الْأَعْوَرِ،عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ مِثْلَهُ.";
abudawood.urdu = "یزید اعور نے سیدنا یوسف بن عبداللہ بن سلام رضی اللہ عنہ سے اس کے مثل روایت کیا۔";
abudawood.hukam = "";
abudawood.description = `[3260] ھذہ إدام ھذہ
إسنادہ ضعیف / ت فی الشمائل 183 ویأتي : 3830 باب الرجل یحلف أن لا یتأدم
یزید بن أبي أمیۃ الأعور : مجہول (تق : 7690)`;
abudawood.anwaar = [119,1];