var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ،حَدَّثَنَا أَبُو الْأَحْوَصِ،حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ،عَنْ عَطَاءٍ،عَنْ نَاسٍ مِنْ آلِ صَفْوَانَ قَالَ اسْتَعَارَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَاهُ.";
abudawood.urdu = "آل صفوان کے بعض لوگوں سے روایت ہے کہ نبی کریم ﷺ نے زرہیں عاریتاً لی تھیں۔اور مذکورہ بالا روایت کے ہم معنی بیان کیا۔";
abudawood.hukam = "";
abudawood.description = `[3564] استعار النبي ﷺ
إسنادہ ضعیف باب في تضمین العاریۃ
انظر الحدیثین السابقین : 3562،3563 و ناس من آل صفوان : مجاھیل کلھم۔`;
abudawood.anwaar = [126,1];