var abudawood = {};
abudawood.arabic = "حَدَّثَنَا هَارُونُ بْنُ زَيْدِ ابْنِ أَبِي الزَّرْقَاءِ،حَدَّثَنَا أَبِي،حَدَّثَنَا جَعْفَرٌ, أَنَّهُ بَلَغَهُ عَنِ الزُّهْرِيِّ بِهَذَا الْحَدِيثِ.";
abudawood.urdu = "ہارون بن زید بن ابی الزوقاء نے کہا ہمیں میرے والد نے بیان کیا انہوں نے کہا ہمیں جعفر نے بیان کیا کہ اسے زہری سے یہ حدیث پہنچی۔";
abudawood.hukam = "";
abudawood.description = `[3775] نھی رسول اللّٰہ ﷺ عن مطمعین
إسنادہ ضعیف باب ما جاء فی الجلوس علی مائدۃ
فیہ مجہول،وانظر الحدیث السابق: 3774 `;
abudawood.anwaar = [134,1];