var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الْجَلَّالَةِ وَأَلْبَانِهَا";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے نجاست خور جانور کھانے اور اس کا دودھ پینے سے منع فرمایا ہے۔";
abudawood.hukam = "";
abudawood.description = `[3785] نھی عن لبن الجلالۃ
إسنادہ ضعیف/ ت 1824،جہ 3189    باب النھي عن أکل الجلالۃ وألبانھا
ابن أبي نجیح مدلس ( تقدم : 364) وعنعن۔`;
abudawood.anwaar = [134,1];