var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْجَرَّاحُ أَبُو وَكِيعٍ عَنْ أَبِي إِسْحَقَ عَنْ شَرِيكٍ عَنْ عَلِيٍّ عَلَيْهِ السَّلَام قَالَ نُهِيَ عَنْ أَكْلِ الثُّومِ إِلَّا مَطْبُوخًا قَالَ أَبُو دَاوُد شَرِيكُ بْنُ حَنْبَلٍ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ نے بیان کیا کہ لہسن کھانے سے منع کیا گیا ہے سوائے اس کے کہ پکا ہوا ہو۔امام ابوداؤد رحمہ اللہ فرماتے ہیں کہ سند میں مذکور راوی ’’شریک‘‘ سے مراد شریک بن حنبل ہے۔";
abudawood.hukam = "";
abudawood.description = `[3828] نھی عن أکل الثوم إلا مطبوخًا
إسنادہ ضعیف/ ت 1808 باب في أکل الثوم
أبو إسحاق عنعن (تقدم : 162) واختلط أیضًا ( انظر التقریب : 5065 ) والحدیث ضعفہ الترمذي۔`;
abudawood.anwaar = [136,1];