var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ عَلَى وِرْكِهِ مِنْ وَثْءٍ كَانَ بِهِ";
abudawood.urdu = "سیدنا جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے درد کی وجہ سے اپنی سرین پر سینگی لگوائی تھی۔";
abudawood.hukam = "";
abudawood.description = `[3863] إن رسول اللّٰہ ﷺ احتجم علی ورکہ
إسنادہ ضعیف/ ن 2851،جہ 3082    باب في قطع العرق وموضع الحجم
أبو الزبیر عنعن ( تقدم : 1215 ) والحدیث السابق ( الأصل : 1836) یغني عنہ۔وانظر الحدیث السابق : 1837`;
abudawood.anwaar = [138,1];