var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ،حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ جَابِرِ بْنِ زَيْدٍ وَالْحَسَنِ مِثْلَهُ";
abudawood.urdu = "جناب قتادہ نے جابر بن زید اور حسن (حسن بصری) سے اسی کے مثل بیان کیا۔امام ابوداؤد رحمہ اللہ نے فرمایا کہ سعید،حماد کی نسبت زیادہ حفظ والے ہیں۔";
abudawood.hukam = "";
abudawood.description = `۔3952] من ملک ذا رحم فھو حر
إسنادہ ضعیف باب فیمن ملک ذا رحم محرم
سعید بن أبي عروبۃ وقتادۃ عنعنا۔( تقدما: 33،29) و للحدیث شاھد ضعیف في مصنف ابن أبي شیبۃ ( 33/6 ح20079) `;
abudawood.anwaar = [141,1];