var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ حَدَّثَنَا عُبَيْدٌ يَعْنِي ابْنَ عَقِيلٍ عَنْ هَارُونَ عَنْ عَبْدِ اللَّهِ بْنِ جَابِرٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ ضُعْفٍ";
abudawood.urdu = "جناب عطیہ نے سیدنا ابوسعید رضی اللہ عنہ سے انہوں نے نبی کریم ﷺ سے «من ضعف» نقل کیا ہے۔(یعنی ضاد پر ضمہ کے ساتھ)۔";
abudawood.hukam = "";
abudawood.description = `[3979] من ضعف
إسنادہ ضعیف/انظر الحدیث السابق : 3978   باب:1`;
abudawood.anwaar = [142,1];