var abudawood = {};
abudawood.arabic = "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ الْحِمْصِيُّ حَدَّثَنَا الْوَلِيدُ قَالَ قَالَ هِشَامٌ يَعْنِي ابْنَ الْغَازِ الْمُضَرَّجَةُ الَّتِي لَيْسَتْ بِمُشَبَّعَةٍ وَلَا الْمُوَرَّدَةُ";
abudawood.urdu = "ہشام بن الغاز نے وضاحت کی کہ «المضرجۃ» سے مراد یہ ہے کہ وہ چادر نہ بہت سرخ رنگ کی تھی اور نہ گلابی۔";
abudawood.hukam = "";
abudawood.description = `[4067] المضرجۃ التي لیست بمشبعۃ
إسنادہ ضعیف باب فی الحمرۃ
الولید بن مسلم عنعن (تقدم: 415) `;
abudawood.anwaar = [144,1];