var abudawood = {};
abudawood.arabic = "قَالَ أَبُو دَاوُد: حُدِّثْتُ عَنِ ابْنِ وَهْبٍ،قَالَ:،حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: >يُوشِكُ الْمُسْلِمُونَ أَنْ يُحَاصَرُوا إِلَى الْمَدِينَةِ،حَتَّى يَكُونَ أَبْعَدَ مَسَالِحِهِمْ سَلَاحِ.";
abudawood.urdu = "سیدنا ابن عمر رضی اللہ عنہما سے روایت کہ رسول اللہ ﷺ نے فرمایا ’’عنقریب مسلمانوں کو مدینہ میں محصور کر لیا جائے گا اور ان کی عمل داری زیادہ سے زیادہ (خیبر کے قریب) مقام سلاح تک ہو گی۔‘‘";
abudawood.hukam = "إسنادہ حسن";
abudawood.description = `مشکوۃ المصابیح: 5427
جریر بن حازم: لم یثبت بأنہ کان یدلس واللہ أعلم، وانظر الحاکم (4/ 511 ح 8560) وصححہ علی شرط مسلم ووافقہ الذہبی وسندہ حسن`;