var abudawood = {};
abudawood.arabic = "-حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ،حَدَّثَنَا عِيسَى بْنُ يُونُسَ،عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ عَنِ الْوَلِيدِ بْنِ سُفْيَانَ الْغَسَّانِيِّ،عَنْ يَزِيدَ بْنِ قُتَيْبٍ السَّكُونِيِّ،عَنْ أَبِي بَحْرِيَّةَ،عَنْ مُعَاذِ بْنِ جَبَلٍ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: >الْمَلْحَمَةُ الْكُبْرَى،وَفَتْحُ الْقُسْطَنْطِينِيَّةِ،وَخُرُوجُ الدَّجَّالِ, فِي سَبْعَةِ أَشْهُرٍ<.";
abudawood.urdu = "سیدنا معاذ بن جبل رضی اللہ عنہ سے مروی ہے کہ رسول اللہ ﷺ نے فرمایا ’’جنگ عظیم،فتح قسطنطینیہ اور دجال کی آمد سات مہینوں میں ہو گی۔“ <اردو> </اردو>";
abudawood.hukam = "";
abudawood.description = `[4295] الملحمۃ الکبری وفتح القسطنطینیۃ
إسنادہ ضعیف/ ت 2238،جہ 4092   باب في تواتر الملاحم
أبو بکر بن أبي مریم : ضعیف وکان قد سرق بیتہ فاختلط (تق: 7974) وشیخہ ولید بن سفیان الغساني: مجہول ( تق : 7425) و یزید بن قطیب مقبول (تق: 7764) أي مجہول الحال۔`;
abudawood.anwaar = [153,1];