var abudawood = {};
abudawood.arabic = "وَبِهِ عَنْ أَبِي إِسْحَقَ عَنْ عَلْقَمَةَ وَالْأَسْوَدِ قَالَ عَبْدُ اللَّهِ فِي شِبْهِ الْعَمْدِ خَمْسٌ وَعِشْرُونَ حِقَّةً وَخَمْسٌ وَعِشْرُونَ جَذَعَةً وَخَمْسٌ وَعِشْرُونَ بَنَاتِ لَبُونٍ وَخَمْسٌ وَعِشْرُونَ بَنَاتِ مَخَاضٍ";
abudawood.urdu = "سیدنا علی رضی اللہ عنہ سے مروی ہے کہ قتل خطا میں دیت کے اونٹ چار طرح کے ہوں: پچیس اونٹنیاں تین سالہ،پچیس اونٹنیاں چار سالہ،پچیس اونٹنیاں دو سالہ اور پچیس اونٹنیاں ایک سالہ ہوں۔";
abudawood.hukam = "";
abudawood.description = `[4552] فی الخطاء أرباعًا
إسنادہ ضعیف/انظر الحدیث السابق :4551    باب في دیۃ الخطأ شبہ العمد`;
abudawood.anwaar = [160,2];