var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ،حَدَّثَنَا سَعِيدٌ،عَنْ قَتَادَةَ،عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ،عَنْ زَيْدِ بْنِ ثَابِتٍ فِي الدِّيَةِ الْمُغَلَّظَةِ... فَذَكَرَ مِثْلَهُ سَوَاءً.";
abudawood.urdu = "جناب سعید بن مسیب نے سیدنا زید بن ثابت رضی اللہ عنہ سے دیت مغلظہ میں مذکورہ بالا کی طرح بیان کیا۔";
abudawood.hukam = "";
abudawood.description = `[4555] فی الدیۃ المغلظۃ
إسنادہ ضعیف باب في دیۃ الخطأ شبہ العمد
سعید بن أبي عروبۃ (تقدم : 33) وقتادۃ ( تقدم : 29) مدلسان وعنعنا۔`;
abudawood.anwaar = [161,1];