var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ عَنْ مُجَاهِدٍ عَنْ رَجُلٍ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الْأَعْمَالِ الْحُبُّ فِي اللَّهِ وَالْبُغْضُ فِي اللَّهِ";
abudawood.urdu = "سیدنا ابوذر رضی اللہ عنہ کا بیان ہے کہ رسول اللہ ﷺ نے فرمایا ’’اعمال میں سے افضل عمل اللہ کے لیے محبت کرنا اور اسی کے لیے بغض رکھنا ہے۔‘‘";
abudawood.hukam = "";
abudawood.description = `[4599] أفضل الأعمال الحب فی اللّٰہ والبغض فی اللّٰہ
إسنادہ ضعیف باب مجانبۃ أھل الأھوا ء و بغضھم
یزید بن أبي زیاد ضعیف (تقدم : 749) والرجل : مجہول۔`;
abudawood.anwaar = [162,1];