var abudawood = {};
abudawood.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصٍ،قَالَ: حَدَّثَنِي أَبِي،حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ،عَنْ سِمَاكٍ بِإِسْنَادِهِ وَمَعْنَى هَذَا الْحَدِيثِ الطَّوِيلِ.";
abudawood.urdu = "جناب ابراہیم بن طہمان نے بواسطہ سماک اس کی سند سے مذکورہ بالا طویل حدیث کے ہم معنی بیان کیا۔";
abudawood.hukam = "";
abudawood.description = `۔4725] ما تسمون ھذہ ؟
إسنادہ ضعیف/ ت 3320،جہ 193    باب فی الجھمیۃ
سماک بن حرب اختلط کما تقدم بالإشارۃ (2238) ولا نعرف تحدیثہ بہ قبل اختلاطہ و عبد اللّٰہ بن عمیرۃ لا یعرف لہ سماع من الأحنف کما قال البخاري رحمہ اﷲ ( التاریخ الکبیر 159/5) `;
abudawood.anwaar = [165,1];