var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيُّ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ حَدَّثَنَا أَبُو عُبَيْدَةَ الْوَلِيدُ بْنُ كَامِلٍ عَنْ الْمُهَلَّبِ بْنِ حُجْرٍ الْبَهْرَانِيِّ عَنْ ضُبَاعَةَ بِنْتِ الْمِقْدَادِ بْنِ الْأَسْوَدِ عَنْ أَبِيهَا قَالَ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي إِلَى عُودٍ وَلَا عَمُودٍ وَلَا شَجَرَةٍ إِلَّا جَعَلَهُ عَلَى حَاجِبِهِ الْأَيْمَنِ أَوْ الْأَيْسَرِ وَلَا يَصْمُدُ لَهُ صَمْدًا";
abudawood.urdu = "سیدہ ضباعہ بنت مقداد بن اسود اپنے والد (سیدنا مقداد رضی اللہ عنہ) سے روایت کرتی ہیں،انہوں نے کہا،میں نے دیکھا کہ رسول اللہ ﷺ جب بھی کسی لکڑی،ستون یا درخت کی طرف (منہ کر کے) نماز پڑھتے تو اسے ہمیشہ اپنے دائیں یا بائیں ابرو کی طرف رکھتے،بالکل عین سامنے نہ رکھتے تھے۔";
abudawood.hukam = "";
abudawood.description = `[693] ما رأیت رسول اللّٰہ ﷺ یصلي إلی عود ولا عمود
إسنادہ ضعیف باب إذا صلّی إلی ساریۃ أو نحو ھا
ضباعۃ بنت المقداد لاتعرف (تق : 8630) والمھلب بن حجر مجہول (تق : 6936) والولید بن کامل : 
لین الحدیث (تق : 7450) `;
abudawood.anwaar = [37,1];