var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ ابْنِ أَبِي لَيْلَى عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ قَالَ صَلَّيْتُ إِلَى جَنْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ تَطَوُّعٍ فَسَمِعْتُهُ يَقُولُ أَعُوذُ بِاللَّهِ مِنْ النَّارِ وَيْلٌ لِأَهْلِ النَّارِ";
abudawood.urdu = "جناب عبدالرحمٰن بن ابی لیلیٰ اپنے والد سے بیان کرتے ہیں،کہا کہ میں نے (ایک بار) رسول اللہ ﷺ کے پہلو میں کھڑے ہو کر نفل نماز پڑھی۔میں نے آپ ﷺ کو سنا کہتے تھے «أعوذ باللہ من النار ویل لأہل النار» ’’آگ سے اللہ کی پناہ۔ہلاکت ہے دوزخیوں کے لیے۔‘‘";
abudawood.hukam = "";
abudawood.description = `[881] أعوذ باللّٰہ من النار
إسنادہ ضعیف /جہ 1352    باب الدعاء فی الصلوۃ
ابن أبي لیلی ضعیف (تقدم : 752) `;
abudawood.anwaar = [44,1];