var abudawood = {};
abudawood.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ،حَدَّثَنَا الْوَلِيدُ،عَنْ عِيسَى بْنِ أَيُّوبَ،قَالَ: قَوْلُهُ: >التَّصْفِيحُ لِلنِّسَاءِ<: تَضْرِبُ بِأُصْبُعَيْنِ مِنْ يَمِينِهَا عَلَى كَفِّهَا الْيُسْرَى.";
abudawood.urdu = "جناب عیسیٰ بن ایوب بیان کرتے ہیں کہ عورتوں کا تالی بجانا یوں ہے کہ وہ اپنے دائیں ہاتھ کی دو انگلیاں اپنی بائیں ہتھیلی پر ماریں۔";
abudawood.hukam = "";
abudawood.description = `[942] قولہ التصفیح للنساء تضرب بإصبعین من یمینھا
إسنادہ ضعیف باب التصفیق فی الصلوۃ
الولید بن مسلم عنعن (تقدم : 415) `;
abudawood.anwaar = [46,1];