var tirmizi = {};
tirmizi.arabic = "وَقَدْ رَوَى هَذَا الْحَدِيثَ ابْنُ لَهِيعَةَ،عَنْ أَبِي الزُّبَيْرِ،عَنْ جَابِرٍ،عَنْ أَبِي قَتَادَةَ أَنَّهُ رَأَى النَّبِيَّ ﷺ يَبُولُ مُسْتَقْبِلَ الْقِبْلَةِ. حَدَّثَنَا بِذَلِكَ قُتَيْبَةُ،حَدَّثَنَا ابْنُ لَهِيعَةَ.\nوَحَدِيثُ جَابِرٍ عَنْ النَّبِيِّ ﷺ أَصَحُّ مِنْ حَدِيثِ ابْنِ لَهِيعَةَ،وَابْنُ لَهِيعَةَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ،ضَعَّفَهُ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ وَغَيْرُهُ مِنْ قِبَلِ حِفْظِهِ.";
tirmizi.urdu = "عبداللہ بن لہیعہ نے یہ حدیث ابوالزبیرسے اورابوالزبیرنے جابر رضی اللہ عنہ سے کہ ابوقتادہ رضی اللہ عنہ نے نبی اکرم ﷺکو قبلہ کی طرف منہ کرکے پیشاب کرتے ہوئے دیکھا ہے۔\nجابر رضی اللہ عنہ کی نبی اکرمﷺسے یہ حدیث ابن لہیعہ کی حدیث(جس میں جابرکے بعد ابوقتادہ رضی اللہ عنہ کا واسطہ ہے) سے زیادہ صحیح ہے،ابن لہیعہ محدّثین کے نزدیک ضعیف ہیں،یحییٰ بن سعیدالقطان وغیرہ نے ان کی حفظ کے اعتبارسے تضعیف کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[10] أنہ رأی النبي ﷺ یبول مستقبل القبلۃ
إسنادہ ضعیف باب ما جاء من الرخصۃ في ذلک
ابن لھیعۃ ضعیف بعد اختلاطہ و مدلس ( د 739 ) وأبو الزبیر مدلس ( د 2 ) والحدیث السابق (الأصل :9) یغني عنہ۔`;
tirmizi.anwaar = [189,1];