var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ وَأَحْمَدُ بْنُ مَنِيعٍ وَإِسْحَقُ بْنُ مَنْصُورٍ وَمَحْمُودُ بْنُ غَيْلَانَ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ يَمْشُونَ أَمَامَ الْجَنَازَةِ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں: میں نے نبی اکرمﷺ،ابوبکر اور عمرسب کو جنازے کے آگے آگے چلتے دیکھاہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 1668
الراجح أنہ حدیث صحیح وأعل بما لا یقدح`;