var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ عَنْ رَاشِدِ بْنِ سَعْدٍ عَنْ ثَوْبَانَ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَةٍ فَرَأَى نَاسًا رُكْبَانًا فَقَالَ أَلَا تَسْتَحْيُونَ إِنَّ مَلَائِكَةَ اللَّهِ عَلَى أَقْدَامِهِمْ وَأَنْتُمْ عَلَى ظُهُورِ الدَّوَابِّ قَالَ وَفِي الْبَاب عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ وَجَابِرِ بْنِ سَمُرَةَ قَالَ أَبُو عِيسَى حَدِيثُ ثَوْبَانَ قَدْ رُوِيَ عَنْهُ مَوْقُوفًا قَالَ مُحَمَّدٌ الْمَوْقُوفُ مِنْهُ أَصَحُّ";
tirmizi.urdu = "ثوبان رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ ﷺ کے ساتھ ایک جنازے میں نکلے،آپ نے کچھ لوگوں کو سوار دیکھا تو فرمایا: 'کیا تمہیں شرم نہیں آتی؟ اللہ کے فرشتے پیدل چل رہے ہیں اور تم جانوروں کی پیٹھوں پر بیٹھے ہو' ۱؎۔\nامام ترمذی کہتے ہیں:۱-ثوبان کی حدیث،ان سے موقوفاً بھی مروی ہے۔محمدبن اسماعیل بخاری کہتے ہیں: ان کی موقوف روایت زیادہ صحیح ہے،۲-اس باب میں مغیرہ بن شعبہ اور جابر بن سمرہ رضی اللہ عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1012] ألاتستحیون ؟ إن ملائکۃ اللّٰہ علی أقدامھم
إسنادہ ضعیف / جہ 1480   باب ما جاء في کراہیۃ الرکوب خلف الجنازۃ
أبو بکر بن أبي مریم : ضعیف ( د 4295) `;
tirmizi.anwaar = [215,1];