var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ مُسْلِمٍ الْأَعْوَرِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُ الْمَرِيضَ وَيَشْهَدُ الْجَنَازَةَ وَيَرْكَبُ الْحِمَارَ وَيُجِيبُ دَعْوَةَ الْعَبْدِ وَكَانَ يَوْمَ بَنِي قُرَيْظَةَ عَلَى حِمَارٍ مَخْطُومٍ بِحَبْلٍ مِنْ لِيفٍ عَلَيْهِ إِكَافٌ مِنْ لِيفٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مُسْلِمٍ عَنْ أَنَسٍ وَمُسْلِمٌ الْأَعْوَرُ يُضَعَّفُ وَهُوَ مُسْلِمُ بْنُ كَيْسَانَ الْمُلَائِيُّ تُكُلِّمَ فِيهِ وَقَدْ رَوَى عَنْهُ شُعْبَةُ وَسُفْيَانُ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ مریض کی عیادت کرتے،جنازے میں شریک ہوتے،گدھے کی سواری کرتے اور غلام کی دعوت قبول فرماتے تھے۔بنوقریظہ ۱؎ والے دن آپ ایک ایسے گدھے پر سوار تھے،جس کی لگام کھجور کی چھال کی رسی کی تھی،اس پر زین بھی چھال ہی کی تھی۔\nامام ترمذی کہتے ہیں: ہم اس حدیث کوصرف مسلم کی روایت سے جانتے ہیں جسے وہ انس سے روایت کرتے ہیں۔اور مسلم اعور ضعیف گردانے جاتے ہیں۔یہی مسلم بن کیسان مُلائی ہیں،جس پرکلام کیاگیا ہے،ان سے شعبہ اور سفیان نے روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1017] کان یعود المریض ویشھد الجنازۃ
إسنادہ ضعیف / جہ 2296،4178    باب آخر [في سنۃ عیادۃ المریض وشھود الجنازۃ ]
مسلم الأعور : ضعیف ( تقدم : 984،985 ) `;
tirmizi.anwaar = [215,1];