var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ عِمْرَانَ بْنِ أَنَسٍ الْمَكِّيِّ عَنْ عَطَاءٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اذْكُرُوا مَحَاسِنَ مَوْتَاكُمْ وَكُفُّوا عَنْ مَسَاوِيهِمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ قَالَ سَمِعْت مُحَمَّدًا يَقُولُ عِمْرَانُ بْنُ أَنَسٍ الْمَكِّيُّ مُنْكَرُ الْحَدِيثِ وَرَوَى بَعْضُهُمْ عَنْ عَطَاءٍ عَنْ عَائِشَةَ قَالَ وَعِمْرَانُ بْنُ أَبِي أَنَسٍ مِصْرِيٌّ أَقْدَمُ وَأَثْبَتُ مِنْ عِمْرَانَ بْنِ أَنَسٍ الْمَكِّيِّ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' تم اپنے مُردوں کی اچھائیوں کو ذکرکیا کرو اور ان کی برائیاں بیان کرنے سے بازرہو'۔امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-میں نے محمدبن اسماعیل بخاری کوکہتے سناکہ عمران بن انس مکی منکرالحدیث ہیں،۲-بعض نے عطا سے اور عطا نے ام المومنین عائشہ رضی اللہ عنہا سے روایت کی ہے،۳-عمران بن ابی انس مصری عمران بن انس مکی سے پہلے کے ہیں اوران سے زیادہ ثقہ ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1019] اذکروا محاسن موتاکم
إسنادہ ضعیف / د 4900    باب آخر [فی الأمر بذکر محاسن الموتی۔۔۔۔]`;
tirmizi.anwaar = [215,1];