var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ عَلَى الْجَنَازَةِ بِفَاتِحَةِ الْكِتَابِ قَالَ وَفِي الْبَاب عَنْ أُمِّ شَرِيكٍ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ لَيْسَ إِسْنَادُهُ بِذَلِكَ الْقَوِيِّ إِبْرَاهِيمُ بْنُ عُثْمَانَ هُوَ أَبُو شَيْبَةَ الْوَاسِطِيُّ مُنْكَرُ الْحَدِيثِ وَالصَّحِيحُ عَنْ ابْنِ عَبَّاسٍ قَوْلُهُ مِنْ السُّنَّةِ الْقِرَاءَةُ عَلَى الْجَنَازَةِ بِفَاتِحَةِ الْكِتَابِ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرمﷺ نے جنازے میں سورۂ فاتحہ پڑھی۔\nامام ترمذی کہتے ہیں:۱-ابن عباس رضی اللہ عنہما کی حدیث کی سند قوی نہیں ہے،۲-ابراہیم بن عثمان ہی ابوشیبہ واسطی ہیں اور وہ منکرالحدیث ہیں۔صحیح چیز جو ابن عباس سے مروی ہے کہ ـ جنازے کی صلاۃ میں سورۂ فاتحہ پڑھنا سنت میں سے ہے،۳-اس باب میں ام شریک سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1026] أن النبيﷺ قرأ علی الجنازۃ بفاتحۃ الکتاب
إسنادہ ضعیف جدًا / جہ 1495  باب ما جاء فی القراء ۃ علی الجنازۃ بفاتحۃ الکتاب
إبراہیم بن عثمان : متروک الحدیث (تق : 215) وللحدیث شواہد کثیرۃ،والحدیث الآتي (الأصل : 1027) یغني عنہ۔`;
tirmizi.anwaar = [215,2];