var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ وَالْفَضْلُ بْنُ مُوسَى عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَبْدِ اللَّهِ بْنُ بُرَيْدَةَ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى امْرَأَةٍ فَقَامَ وَسَطَهَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ شُعْبَةُ عَنْ حُسَيْنٍ الْمُعَلِّمِ";
tirmizi.urdu = "سمرہ بن جندب رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺ نے ایک عورت ۱؎ کی صلاۃِ جنازہ پڑھائی،تو آپ اس کے بیچ میں یعنی اس کی کمرکے پاس کھڑے ہوے۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-شعبہ نے بھی اسے حسین المعلم سے روایت کیا ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;