var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ أَنَّ أُمَّ سَعْدٍ مَاتَتْ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَائِبٌ فَلَمَّا قَدِمَ صَلَّى عَلَيْهَا وَقَدْ مَضَى لِذَلِكَ شَهْرٌ";
tirmizi.urdu = "سعید بن مسیب سے روایت ہے کہ ام سعد کا انتقال ہوگیا اور نبی اکرمﷺ موجود نہیں تھے،جب آپ تشریف لائے تو ان کی صلاۃِ جنازہ پڑھی۔اس واقعہ کو ایک ماہ گزرچکا تھا۔";
tirmizi.hukam = "";
tirmizi.description = `[1038] أن أم سعد ماتت والنبي ﷺ غائب
إسنادہ ضعیف باب ما جاء فی الصلاۃ علی القبر 
قتادۃ مدلس ( تقدم : 30) وعنعن والحدیث مرسل۔`;
tirmizi.anwaar = [216,1];