var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ. حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ. حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ قَال: سَمِعْتُ أَبَا الْمُهَزِّمِ قَالَ: صَحِبْتُ أَبَا هُرَيْرَةَ عَشْرَ سِنِينَ سَمِعْتُهُ يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَنْ تَبِعَ جَنَازَةً،وَحَمَلَهَا ثَلاَثَ مَرَّاتٍ،فَقَدْ قَضَى مَا عَلَيْهِ مِنْ حَقِّهَا.\nقَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ غَرِيبٌ. وَرَوَاهُ بَعْضُهُمْ بِهَذَا الإِسْنَادِ وَلَمْ يَرْفَعْهُ. وَأَبُوالْمُهَزِّمِ اسْمُهُ يَزِيدُ بْنُ سُفْيَانَ وَضَعَّفَهُ شُعْبَةُ";
tirmizi.urdu = "عبادبن منصورکہتے ہیں کہ میں نے ابوالمہزم کوکہتے سناکہ میں دس سال ابوہریرہ کے ساتھ رہا۔میں نے انہیں سنا،وہ کہہ رہے تھے کہ میں نے رسول اللہ ﷺ کو فرماتے سناہے:' جو کسی جنازے کے ساتھ گیا اوراسے تین بارکندھا دیاتو،اس نے اپنا حق پورا کردیا جو اس پر تھا'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-اسے بعض نے اسی سند سے روایت کیا ہے لیکن اسے مرفوع نہیں کیا ہے،۳-ابوالمہزم کانام یزید بن سفیان ہے۔شعبہ نے انہیں ضعیف کہاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1041] من تبع جنازۃ وحملھا ثلاث مرات
إسنادہ ضعیف جدًا    باب آخر [قدر ما یجزئ من اتباع الجنازۃ۔۔۔]
أبو المھزم : متروک (د 1854) `;
tirmizi.anwaar = [216,1];