var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ وَنَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ وَيُوسُفُ بْنُ مُوسَى الْقَطَّانُ الْبَغْدَادِيُّ قَالُوا حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ عَنْ عَلِيِّ بْنِ عَبْدِ الْأَعْلَى عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّحْدُ لَنَا وَالشَّقُّ لِغَيْرِنَا وَفِي الْبَاب عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ وَعَائِشَةَ وَابْنِ عُمَرَ وَجَابِرٍ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرمﷺ نے فرمایا:'بغلی قبرہمارے لیے ہے اور صندوقی قبر اوروں کے لیے ہے' ۱؎۔\nامام ترمذی کہتے ہیں:۱-ابن عباس کی حدیث اس طریق سے حسن غریب ہے،۲-اس باب میں جریر بن عبداللہ،عائشہ،ابن عمر اور جابر رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1045] اللحد لنا والشق لغیرنا
إسنادہ ضعیف / د 3208،ن 2011،جہ 1554   باب ما جاء في قول النبي ﷺ اللحد لنا`;
tirmizi.anwaar = [216,1];