var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ عَنْ أَبِي كُدَيْنَةَ عَنْ قَابُوسَ بْنِ أَبِي ظَبْيَانَ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقُبُورِ الْمَدِينَةِ فَأَقْبَلَ عَلَيْهِمْ بِوَجْهِهِ فَقَالَ السَّلَامُ عَلَيْكُمْ يَا أَهْلَ الْقُبُورِ يَغْفِرُ اللَّهُ لَنَا وَلَكُمْ أَنْتُمْ سَلَفُنَا وَنَحْنُ بِالْأَثَرِ قَالَ وَفِي الْبَاب عَنْ بُرَيْدَةَ وَعَائِشَةَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ وَأَبُو كُدَيْنَةَ اسْمُهُ يَحْيَى بْنُ الْمُهَلَّبِ وَأَبُو ظَبْيَانَ اسْمُهُ حُصَيْنُ بْنُ جُنْدُبٍ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ مدینے کی چند قبروں کے پاس سے گزرے،توان کی طرف رخ کرکے آپ نے فرمایا:'السَّلاَمُ عَلَیْکُمْ،یَا أَہْلَ الْقُبُورِ! یَغْفِرُ اللَّہُ لَنَا وَلَکُمْ،أَنْتُمْ سَلَفُنَا وَنَحْنُ بِالأَثَرِ'(سلامتی ہوتم پر اے قبروالو! اللہ ہمیں اورتمہیں بخشے تم ہمارے پیش روہو اور ہم بھی تمہارے پیچھے آنے والے ہیں۔امام ترمذی کہتے ہیں:۱-ابن عباس کی حدیث غریب ہے،۲-اس باب میں بریدہ رضی اللہ عنہ اور عائشہ رضی اللہ عنہا سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1053] السلام علیکم یا أھل القبور!
إسنادہ ضعیف باب ما یقول الرجل إذا دخل المقابر
قابوس : ضعیف ( د 3032) `;
tirmizi.anwaar = [216,1];