var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَتَوَضَّأُ بَعْدَ الْغُسْلِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ أَبُو عِيسَى وَهَذَا قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالتَّابِعِينَ أَنْ لَا يَتَوَضَّأَ بَعْدَ الْغُسْلِ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم ﷺ غسل کے بعد وضو نہیں کرتے تھے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-صحابہ کرام اور تابعین میں سے کئی اہل علم کا قول ہے کہ غسل کے بعد وضو نہ کرے۔";
tirmizi.hukam = "";
tirmizi.description = `[107] أن النبي ﷺ کان لا یتوضأ بعد الغسل
إسنادہ ضعیف/ د 250،جہ 579  باب فی الوضوء بعد الغسل
أبو إسحاق مدلس وعنعن۔( د 162) `;
tirmizi.anwaar = [192,1];