var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُؤَدِّبُ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَتْنَا أُمُّ الْأَسْوَدِ عَنْ مُنْيَةَ بِنْتِ عُبَيْدِ بْنِ أَبِي بَرْزَةَ عَنْ جَدِّهَا أَبِي بَرْزَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عَزَّى ثَكْلَى كُسِيَ بُرْدًا فِي الْجَنَّةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ";
tirmizi.urdu = "ابوبرزہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ' جس نے کسی ایسی عورت کی تعزیت(ماتم پُرسی) کی جس کا لڑکامرگیا ہو،تو اسے جنت میں اس کے بدلہ ایک عمدہ کپڑا پہنایاجائے گا'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-اس کی سند قوی نہیں ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1076] من عزی ثکلی کسي بردًا فی الجنۃ
إسنادہ ضعیف باب آخر في فضل التعزیۃ
منیۃ،لا یعرف حالھا (تق: 8687) `;
tirmizi.anwaar = [217,1];