var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عِيسَى بْنُ مَيْمُونٍ الْأَنْصَارِيُّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْلِنُوا هَذَا النِّكَاحَ وَاجْعَلُوهُ فِي الْمَسَاجِدِ وَاضْرِبُوا عَلَيْهِ بِالدُّفُوفِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ حَسَنٌ فِي هَذَا الْبَابِ وَعِيسَى بْنُ مَيْمُونٍ الْأَنْصَارِيُّ يُضَعَّفُ فِي الْحَدِيثِ وَعِيسَى بْنُ مَيْمُونٍ الَّذِي يَرْوِي عَنْ ابْنِ أَبِي نَجِيحٍ التَّفْسِيرَ هُوَ ثِقَةٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ ﷺ نے فرمایا:' اس نکاح کا اعلان کرو،اسے مسجدوں میں کرو اور اس پردف بجاؤ'۔\nامام ترمذی کہتے ہیں:۱-اس باب میں یہ حدیث غریب حسن ہے،۲-عیسیٰ بن میمون انصاری حدیث میں ضعیف قرار دیے جاتے ہیں،۳-عیسیٰ بن میمون جو ابن ابی نجیح سے تفسیرروایت کرتے ہیں،ثقہ ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1089] أعلنوا ھذا النکاح
إسنادہ ضعیف / جہ 1895   باب ما جاء في إعلان النکاح
عیسی بن میمون : ضعیف (تق: 5335)بل : متروک الحدیث ( التحریر 145/3) وطریق ابن ماجہ فیہ متروک۔`;
tirmizi.anwaar = [218,1];