var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ وَائِلِ بْنِ دَاوُدَ،عَنِ ابْنِهِ،عَنْ الزُّهْرِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ ﷺ أَوْلَمَ عَلَى صَفِيَّةَ بِنْتِ حُيَيٍّ بِسَوِيقٍ وَتَمْرٍ.\nقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ.";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺ نے صفیہ بنت حیی کا ولیمہ ستو اور کھجور سے کیا۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3220`;