var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ،عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ،عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ،عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ،عَنْ ابْنِ عُمَرَ،قَالَ: رَقِيتُ يَوْمًا عَلَى بَيْتِ حَفْصَةَ،فَرَأَيْتُ النَّبِيَّ ﷺ عَلَى حَاجَتِهِ مُسْتَقْبِلَ الشَّامِ،مُسْتَدْبِرَ الْكَعْبَةِ.\nقَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ۔";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ ایک روزمیں (اپنی بہن) حفصہ رضی اللہ عنہا کے گھر کی چھت پر چڑھا تو نبی اکرم ﷺ کو دیکھاکہ آپ شام کی طرف منہ اور کعبہ کی طرف پیٹھ کرکے قضائے حاجت فرمارہے ہیں ۱ ؎ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;