var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا عَبْدُاللهِ بْنُ الْمُبَارَكِ،أَخْبَرَنَا يُونُسُ بْنُ يَزِيدَ،عَنْ الزُّهْرِيِّ،عَنْ سَهْلِ بْنِ سَعْدٍ،عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ: إِنَّمَا كَانَ الْمَاءُ مِنْ الْمَاءِ رُخْصَةً فِي أَوَّلِ الإسْلاَمِ،ثُمَّ نُهِيَ عَنْهَا.";
tirmizi.urdu = "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ صرف منی (نکلنے) پرغسل واجب ہوتا ہے،یہ رخصت ابتدائے اسلام میں تھی،پھر اس سے روک دیاگیا۔1";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 448`;