var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يُوسُفُ بْنُ حَمَّادٍ الْبَصْرِيُّ،حَدَّثَنَا عَبْدُ الأَعْلَى،عَنْ سَعِيدٍ،عَنْ قَتَادَةَ،عَنْ جَابِرِ بْنِ زَيْدٍ،عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ ﷺ قَالَ: الْبَغَايَا اللاّتِي يُنْكِحْنَ أَنْفُسَهُنَّ بِغَيْرِ بَيِّنَةٍ. قَالَ يُوسُفُ بْنُ حَمَّادٍ: رَفَعَ عَبْدُ الأَعْلَى هَذَا الْحَدِيثَ فِي التَّفْسِيرِ. وَأَوْقَفَهُ فِي كِتَابِ الطَّلاَقِ وَلَمْ يَرْفَعْهُ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرمﷺ نے فرمایا:' زنا کارہیں وہ عورتیں جو گواہوں کے بغیر خود نکاح کرلیتی ہیں'۔یوسف بن حماد کہتے ہیں کہ عبدالاعلی نے اس حدیث کوکتاب التفسیرمیں مرفوع بیان کیا ہے اور کتاب الطلاق میں اسے انہوں نے موقوفاً بیان کیا ہے،مرفوع نہیں کیا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1103] البغایا اللاتي ینکحن أنفسھن
إسنادہ ضعیف باب ما جاء لا نکاح إلاببینۃ
قتادۃ مدلس ( تقدم : 30) وعنعن۔`;
tirmizi.anwaar = [218,1];