var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْأُمَوِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ سَيِّدِهِ فَهُوَ عَاهِرٌ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "اس سند سے بھی جابر رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:' جس غلام نے اپنے آقا کی اجازت کے بغیر شادی کی وہ زانی ہے'۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔1112] أیما عبد تزوّج بغیر إذن سیدہ
إسنادہ ضعیف / د 2078    باب ما جاء في نکاح العبد بغیر إذن سیدہ`;
tirmizi.anwaar = [218,1];