var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ أَبِي الْجَحَّافِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ إِنَّمَا الْمَاءُ مِنْ الْمَاءِ فِي الِاحْتِلَامِ قَالَ أَبُو عِيسَى سَمِعْت الْجَارُودَ يَقُولُ سَمِعْتُ وَكِيعًا يَقُولُ لَمْ نَجِدْ هَذَا الْحَدِيثَ إِلَّا عِنْدَ شَرِيكٍ قَالَ أَبُو عِيسَى وَأَبُو الْجَحَّافِ اسْمُهُ دَاوُدُ بْنُ أَبِي عَوْفٍ وَيُرْوَى عَنْ سُفْيَانَ الثَّوْرِيِّ قَالَ حَدَّثَنَا أَبُو الْجَحَّافِ وَكَانَ مَرْضِيًّا قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ عُثْمَانَ بْنِ عَفَّانَ وَعَلِيِّ بْنِ أَبِي طَالِبٍ وَالزُّبَيْرِ وَطَلْحَةَ وَأَبِي أَيُّوبَ وَأَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ الْمَاءُ مِنْ الْمَاءِ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں: ' منی نکلنے سے ہی غسل واجب ہوتا ہے' کا تعلق احتلام سے ہے ۱؎۔\nامام ترمذی کہتے ہیں: اس باب میں عثمان بن عفان،علی بن ابی طالب،زبیر،طلحہ،ابوایوب اور ابوسعید رضی اللہ عنہم نے نبی اکرم ﷺ سے مرفوعاروایت کی ہے کہ آپ نے فرمایامنی نکلنے ہی پرغسل واجب ہوتا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[112] إنما الماء من الماء
إسنادہ ضعیف باب ما جاء أن الماء من الماء
شریک القاضي مدلس وعنعن۔( ضعیف سنن أبي داود: 266)`;
tirmizi.anwaar = [192,1];