var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا مَالِكٌ ح و حَدَّثَنَا الْأَنْصَارِيُّ حَدَّثَنَا مَعْنٌ قَالَ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ سُئِلَ عَنْ رَجُلٍ لَهُ جَارِيتَانِ أَرْضَعَتْ إِحْدَاهُمَا جَارِيَةً وَالْأُخْرَى غُلَامًا أَيَحِلُّ لِلْغُلَامِ أَنْ يَتَزَوَّجَ بِالْجَارِيَةِ فَقَالَ لَا اللِّقَاحُ وَاحِدٌ قَالَ أَبُو عِيسَى وَهَذَا تَفْسِيرُ لَبَنِ الْفَحْلِ وَهَذَا الْأَصْلُ فِي هَذَا الْبَابِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے: ان سے ایک ایسے شخص کے بارے میں پوچھا گیا جس کے پاس دولونڈیاں ہوں،ان میں سے ایک نے ایک لڑکی کو دودھ پلایا ہے اور دوسری نے ایک لڑکے کو۔تو کیا اس لڑکے کے لیے جائز ہے کہ وہ اس لڑکی سے شادی کرے۔انہوں نے (ابن عباس) نے کہا: نہیں۔اس لیے کہ لقاح ایک ہی ہے ۱ ؎۔\nامام ترمذی کہتے ہیں: یہی اس باب میں اصل ہے۔احمد اوراسحاق بن راہویہ بھی اسی کے قائل ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1149] لا،اللقاح واحد
إسنادہ ضعیف باب ما جاء في لبن الفحل
ابن شھاب الزھري مدلس وعنعن۔( تقدم : 440 )`;
tirmizi.anwaar = [219,2];