var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ زَوْجُ بَرِيرَةَ عَبْدًا فَخَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَارَتْ نَفْسَهَا وَلَوْ كَانَ حُرًّا لَمْ يُخَيِّرْهَا";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں: بریرہ کے شوہرغلام تھے،رسول اللہ ﷺنے بریرہ کواختیار دیا،توانہوں نے خود کو اختیار کیا،(عروہ کہتے ہیں:) اگربریرہ کے شوہرآزاد ہوتے تو آپ بریرہ کو اختیار نہ دیتے ۱ ؎۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;