var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا وَكِيعٌ عَنْ عَبْدِ الْمَلِكِ بْنِ مُسْلِمٍ وَهُوَ ابْنُ سَلَّامٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا فَسَا أَحَدُكُمْ فَلْيَتَوَضَّأْ وَلَا تَأْتُوا النِّسَاءَ فِي أَعْجَازِهِنَّ قَالَ أَبُو عِيسَى وَعَلِيٌّ هَذَا هُوَ عَلِيُّ بْنُ طَلْقٍ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' اللہ اس شخص کی طرف(رحمت کی نظرسے) نہیں دیکھے گا جو کسی مرد یاکسی عورت کی دبر میں صحبت کرے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3195
وانظر مشکوۃ المصابیح (3585)`;