var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْظُرُ اللَّهُ إِلَى رَجُلٍ أَتَى رَجُلًا أَوْ امْرَأَةً فِي الدُّبُرِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "علی بن طلق رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:'جب تم میں سے کوئی ہوا خارج کرے تو چاہئے کہ وضو کرے اورتم عورتوں کی دبر میں صحبت نہ کرو'۔امام ترمذی کہتے ہیں: علی سے مراد علی بن طلق ہیں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 1006`;