var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ مُوَرِّقٍ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَرْأَةُ عَوْرَةٌ فَإِذَا خَرَجَتْ اسْتَشْرَفَهَا الشَّيْطَانُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:' عورت (سراپا) پردہ ہے،جب وہ باہر نکلتی ہے تو شیطان اس کو تاکتا ہے' ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1173] إسنادہ ضعیف،قتادۃ مدلس وعنعن ( تقدم: 30)
------------
اضافہ از معاذ علی زئی:
یہ روایت موقوفاً صحیح سند سے ثابت ہے۔دیکھئے مصنف ابن ابی شیبہ (ح7615،سندہ صحیح) اور المعجم الکبیر للطبرانی (ح8914،9480،سندہ حسن)۔شیخ رحمہ اللہ نے بھی صحیح ابن خزیمہ کی تخریج میں المعجم الکبیر للطبرانی والی سند کو ’’سندہ حسن‘‘ قرار دیا،والحمدللہ۔`;
tirmizi.anwaar = [220,1];