var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ،عَنْ الأَعْمَشِ،عَنْ أَبِي إِسْحَاقَ،عَنْ الأَسْوَدِ،عَنْ عَائِشَةَ قَالَتْ: كَانَ رَسُولُ اللهِ ﷺ يَنَامُ،وَهُوَ جُنُبٌ وَلاَ يَمَسُّ مَاءً.";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہﷺسوتے اور پانی کو ہاتھ نہ لگاتے اورآپ جنبی ہوتے ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[118۔119] کان رسول اللّٰہ ﷺ ینام وھو جنب
إسنادہ ضعیف/جہ 581  باب فی الجنب ینام قبل أن یغتسل
أبو إسحاق مدلس( تقدم: 107) و صرح بالسماع عندالبیہقي ( 1/ 201۔202) ولکن السند إلیہ ضعیف۔`;
tirmizi.anwaar = [192,1];