var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا وَكِيعٌ،عَنْ سُفِيانَ،عَنْ أَبِي إِسْحَاقَ نَحْوَهُ.\nقَالَ أَبُوعِيسَى: وَهَذَا قَوْلُ سَعِيدِ بْنِ الْمُسَيِّبِ وَغَيْرِهِ. وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ الأَسْوَدِ،عَنْ عَائِشَةَ،عَنْ النَّبِيِّ ﷺ،أَنَّهُ كَانَ يَتَوَضَّأُ قَبْلَ أَنْ يَنَامَ. وَهَذَا أَصَحُّ مِنْ حَدِيثِ أَبِي إِسْحَاقَ عَنْ الأَسْوَدِ. وَقَدْ رَوَى عَنْ أَبِي إِسْحَاقَ هَذَا الْحَدِيثَ شُعْبَةُ وَالثَّوْرِيُّ وَغَيْرُ وَاحِدٍ. وَيَرَوْنَ أَنَّ هَذَا غَلَطٌ مِنْ أَبِي إِسْحَاقَ";
tirmizi.urdu = "اس سند سے بھی ابو اسحاق سے اسی طرح مروی ہے۔\nامام ترمذی کہتے ہیں: ۱-یہی سعید بن مسیب وغیرہ کاقول ہے،۲-کئی سندوں سے عائشہ سے روایت ہے کہ نبی اکرمﷺ سونے سے پہلے وضو کرتے تھے،۳-یہ ابواسحاق سبیعی کی حدیث(رقم ۱۱۸) سے جسے انہوں نے اسودسے روایت کیا ہے زیادہ صحیح ہے،اورابواسحاق سبیعی سے یہ حدیث شعبہ،ثوری اوردیگر کئی لوگوں نے بھی روایت کی ہے اور ان کے خیا ل میں اس میں غلطی ابواسحاق سبیعی سے ہوئی ہے ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `۔119] کان رسول اللّٰہ ﷺ ینام وھو جنب
إسنادہ ضعیف/جہ 581  باب فی الجنب ینام قبل أن یغتسل
أبو إسحاق مدلس( تقدم: 107) و صرح بالسماع عندالبیہقي ( 1/ 201۔202) ولکن السند إلیہ ضعیف۔`;
tirmizi.anwaar = [192,1];