var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا قَبِيصَةُ عَنْ سُفْيَانَ عَنْ أَبِي حَمْزَةَ عَنْ الْحَسَنِ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ التَّاجِرُ الصَّدُوقُ الْأَمِينُ مَعَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ الثَّوْرِيِّ عَنْ أَبِي حَمْزَةَ وَأَبُو حَمْزَةَ اسْمَهُ عَبْدُ اللَّهِ بْنُ جَابِرٍ وَهُوَ شَيْخٌ بَصْرِيٌّ حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ أَبِي حَمْزَةَ بِهَذَا الْإِسْنَادِ نَحْوَهُ";
tirmizi.urdu = "ابوسعیدخدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺنے فرمایا:' سچا اور امانت دار تاجر(قیامت کے دن) انبیاء،صدیقین اور شہداء کے ساتھ ہوگا'۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن ہے،ہم اسے بروایت ثوری صرف اسی سند سے جانتے ہیں انہوں نے ابوحمزہ سے روایت کی ہے،۲-اور ابوحمزہ کانام عبداللہ بن جابرہے اوروہ بصرہ کے شیخ ہیں،۳-دوسری سندسے سفیان ثوری نے ابوحمزہ سے اسی سند سے اسی جیسی حدیث روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1209] التاجر الصدوق الأمین
إسنادہ ضعیف باب ما جاء فی التجار وتسمیۃ النبي ﷺ
أبو حمزۃ میمون : ضعیف (تقدم : 659) وقیل : ھو غیرہ،و سفیان الثوري و الحسن البصري مدلسان و عنعنا۔`;
tirmizi.anwaar = [221,1];