var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَعِيدُ بْنُ يَعْقُوبَ الطَّالَقَانِيُّ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ عَنْ حُسَيْنِ بْنِ قَيْسٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِ الْمِكْيَالِ وَالْمِيزَانِ إِنَّكُمْ قَدْ وُلِّيتُمْ أَمْرَيْنِ هَلَكَتْ فِيهِ الْأُمَمُ السَّالِفَةُ قَبْلَكُمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ حَدِيثِ حُسَيْنِ بْنِ قَيْسٍ وَحُسَيْنُ بْنُ قَيْسٍ يُضَعَّفُ فِي الْحَدِيثِ وَقَدْ رُوِيَ هَذَا بِإِسْنَادٍ صَحِيحٍ عَنْ ابْنِ عَبَّاسٍ مَوْقُوفًا";
tirmizi.urdu = "عبد اللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے ناپ تول والوں سے فرمایا: 'تمہارے دو ایسے کام ۱؎ کیے گئے ہیں جس میں تم سے پہلے کی امتیں ہلاک ہوگئیں' ۲؎۔\nامام ترمذی کہتے ہیں: ہم اس حدیث کو صرف بروایت حسین بن قیس مرفوع جانتے ہیں،ا ورحسین بن قیس حدیث میں ضعیف گردانے جاتے ہیں۔نیزیہ صحیح سندسے ابن عباس سے موقوفاً مروی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1217] إنکم قد ولیتم أمرین
إسنادہ ضعیف جدًا    باب ما جاء فی المکیال والمیزان
حسین بن قیس : متروک ( تقدم : 188) `;
tirmizi.anwaar = [221,1];