var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ عَنْ ابْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ تَلَقِّي الْبُيُوعِ قَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ وَابْنِ عُمَرَ وَرَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے مال بیچنے والوں سے بازارمیں پہنچنے سے پہلے جاکرملنے سے منع فریاما ہے۔\nامام ترمذی کہتے ہیں: اس باب میں علی،ابن عباس،ابوہریرہ،ابوسعیدخدری،ابن عمر،اورایک اور صحابی رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;