var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ حُرَيْثٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ رُبَّمَا اغْتَسَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْجَنَابَةِ ثُمَّ جَاءَ فَاسْتَدْفَأَ بِي فَضَمَمْتُهُ إِلَيَّ وَلَمْ أَغْتَسِلْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ بِإِسْنَادِهِ بَأْسٌ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ وَالتَّابِعِينَ أَنَّ الرَّجُلَ إِذَا اغْتَسَلَ فَلَا بَأْسَ بِأَنْ يَسْتَدْفِئَ بِامْرَأَتِهِ وَيَنَامَ مَعَهَا قَبْلَ أَنْ تَغْتَسِلَ الْمَرْأَةُ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ بسااوقات نبی اکرم ﷺجنابت کا غسل فرماتے پھرآکرمجھ سے گرمی حاصل کرتے تو میں آپ کو چمٹا لیتی،اورمیں بغیرغسل کے ہوتی تھی۔امام ترمذی کہتے ہیں: ۱-اس حدیث کی سند میں کوئی اشکالنہیں ۱؎،۲-صحابہ کرام اور تابعین میں سے بہت سے اہل علم کا یہی قول ہے کہ مرد جب غسل کرلے تو اپنی بیوی سے چمٹ کرگرمی حاصل کرنے میں اسے کوئی مضائقہ نہیں،وہ عورت کے غسل کرنے سے پہلے اس کے ساتھ (چمٹ کر) سوسکتاہے،سفیان ثوری،شافعی،احمد اور اسحاق بن راہویہ بھی یہی کہتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[123] ربما اغتسل النبيﷺ من الجنابۃ
إسنادہ ضعیف/ جہ 580 باب ما جاء فی الرجل یستدفئ بالمرأۃ بعد الغسل
حریث بن أبي مطر : ضعیف کما فی التقریب (1182) `;
tirmizi.anwaar = [192,2];