var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ الشَّيْبَانِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيَّرَ أَعْرَابِيَّا بَعْدَ الْبَيْعِ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "جابر رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺنے بیع کے بعد ایک اعرابی کو اختیار دیا۔یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1249] أن النبي ﷺ خیر أعرابیًا بعد البیع
إسنادہ ضعیف/ جہ 2184    باب [ماجاء في خیار المتبایعین]
أبو الزبیر عنعن( تقدم : 10) وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [221,1];