var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا شَرِيكٌ،عَنْ أَبِي الْيَقْظَانِ،عَنْ عَدِيِّ بْنِ ثَابِتٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،عَنْ النَّبِيِّ ﷺ أَنَّهُ قَالَ فِي الْمُسْتَحَاضَةِ: تَدَعُ الصَّلاَةَ أَيَّامَ أَقْرَائِهَا الَّتِي كَانَتْ تَحِيضُ فِيهَا،ثُمَّ تَغْتَسِلُ،وَتَتَوَضَّأُ عِنْدَ كُلِّ صَلاَةٍ،وَتَصُومُ وَتُصَلِّي.";
tirmizi.urdu = "عدی کے داداعبید بن عازب رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے مستحاضہ کے سلسلہ میں فرمایا: 'وہ ان دنوں میں جن میں اسے حیض آتاہوصلاۃ چھوڑے رہے،پھروہ غسل کرے،اور(استحاضہ کا خون آنے پر) ہر صلاۃ کے لیے وضو کرے،صوم رکھے اور صلاۃ پڑھے '۔";
tirmizi.hukam = "";
tirmizi.description = `[126۔127] تدع الصلاۃ أیام أقرائھا
إسنادہ ضعیف/د 257،جہ 625   باب ما جاء أن المستحاضۃ تتوضأ لکل صلاۃ
أبو الیقظان ضعیف مدلس( د 297) وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [193,1];