var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،أَخْبَرَنَا شُرَيْكٌ: نَحْوَهُ بِمَعْنَاهُ. قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ قَدْ تَفَرَّدَ بِهِ شَرِيكٌ عَنْ أَبِي الْيَقْظَانِ. قَالَ: وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ،فَقُلْتُ: عَدِيُّ بْنُ ثَابِتٍ،عَنْ أَبِيهِ،عَنْ جَدِّهِ،جَدُّ عَدِيٍّ مَا اسْمُهُ؟ فَلَمْ يَعْرِفْ مُحَمَّدٌ اسْمَهُ. وَذَكَرْتُ لِمُحَمَّدٍ قَوْلَ يَحْيَى بْنِ مَعِينٍ: أَنَّ اسْمَهُ دِينَارٌ فَلَمْ يَعْبَأْ بِهِ. و قَالَ أَحْمَدُ وَإِسْحَاقُ فِي الْمُسْتَحَاضَةِ: إِنْ اغْتَسَلَتْ لِكُلِّ صَلاَةٍ هُوَ أَحْوَطُ لَهَا،وَإِنْ تَوَضَّأَتْ لِكُلِّ صَلاَةٍ أَجْزَأَهَا،وَإِنْ جَمَعَتْ بَيْنَ الصَّلاَتَيْنِ بِغُسْلٍ وَاحِدٍ أَجْزَأَهَا۔";
tirmizi.urdu = "اس سندسے بھی شریک نے اسی مفہوم کے ساتھ اسی طرح کی حدیث بیان کی ہے۔\nامام ترمذی کہتے ہیں:۱-اس حدیث میں شریک ابوالیقظان سے روایت کرنے میں منفردہیں،۲-احمد اور اسحاق بن راہویہ مستحاضہ عورت کے بارے میں کہتے ہیں کہ اگروہ ہر صلاۃ کے وقت غسل کرے تو یہ اس کے لیے زیادہ احتیاط کی بات ہے اور اگروہ ہرصلاۃ کے لیے وضو کرے تویہ اس کے لیے کافی ہے اور اگروہ ایک غسل سے دو صلاۃجمع کرے تو بھی کافی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔127] تدع الصلاۃ أیام أقرائھا
إسنادہ ضعیف/د 257،جہ 625   باب ما جاء أن المستحاضۃ تتوضأ لکل صلاۃ
أبو الیقظان ضعیف مدلس( د 297) وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [193,1];