var tirmizi = {};
tirmizi.arabic = "أَخْبَرَنَا أَبُو كُرَيْبٍ أَخْبَرَنَا وَكِيعٌ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ أَبِي الْمُهَزِّمِ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى عَنْ ثَمَنِ الْكَلْبِ إِلَّا كَلْبَ الصَّيْدِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا يَصِحُّ مِنْ هَذَا الْوَجْهِ وَأَبُو الْمُهَزِّمِ اسْمُهُ يَزِيدُ بْنُ سُفْيَانَ وَتَكَلَّمَ فِيهِ شُعْبَةُ بْنُ الْحَجَّاجِ وَضَعَّفَهُ وَقَدْ رُوِيَ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوُ هَذَا وَلَا يَصِحُّ إِسْنَادُهُ أَيْضًا";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ(رسول اللہ ﷺنے) کتے کی قیمت سے منع فرمایاہے سوائے شکاری کتے کی قیمت کے۔امام ترمذی کہتے ہیں:۱-یہ حدیث اس طریق سے صحیح نہیں ہے،۲-ابومہزم کانام یزید بن سفیان ہے،ان کے سلسلہ میں شعبہ بن حجاج نے کلام کیا ہے اور ان کی تضعیف کی ہے،۳-اورجابر سے مروی ہے انہوں نے نبی اکرم ﷺسے اسی جیسی حدیث روایت کی ہے،اور ا س کی سند بھی صحیح نہیں ہے،دیکھیے الصحیحۃ رقم: ۲۹۷۱۔";
tirmizi.hukam = "";
tirmizi.description = `[1281] نھی عن ثمن الکلب إلا
إسنادہ ضعیف باب [الرخصۃ في ثمن کلب الصید ]
أبو المھزم : متروک تقدم ( 1041)`;
tirmizi.anwaar = [222,1];