var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ الْخُزَاعِيُّ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ صَالِحِ بْنِ أَبِي جُبَيْرٍ عَنْ أَبِيهِ عَنْ رَافِعِ بْنِ عَمْرٍو قَالَ كُنْتُ أَرْمِي نَخْلَ الْأَنْصَارِ فَأَخَذُونِي فَذَهَبُوا بِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَافِعُ لِمَ تَرْمِي نَخْلَهُمْ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ الْجُوعُ قَالَ لَا تَرْمِ وَكُلْ مَا وَقَعَ أَشْبَعَكَ اللَّهُ وَأَرْوَاكَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ";
tirmizi.urdu = "رافع بن عمرو رضی اللہ عنہما کہتے ہیں: میں انصار کے کھجور کے درختوں پر پتھرمارتاتھا،ان لوگوں نے مجھے پکڑ لیا اور نبی اکرمﷺکے پاس لے گئے آپ نے پوچھا:'رافع!تم ان کے کھجورکے درختوں پر پتھرکیوں مارتے ہو؟ میں نے عرض کیا: اللہ کے رسول! بھوک کی وجہ سے،آپ نے فرمایا: 'پتھرمت مارو،جو خود بخود گرجائے اسے کھاؤ اللہ تمہیں آسودہ اور سیراب کرے '۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1288] یا رافع ! لم ترمي نخلھم ؟
إسنادہ ضعیف باب ما جاء فی الرخصۃ في أکل الثمرۃ للماربھا
أبو جبیر لم یوثقہ غیر الترمذي وھو مقبول عند الحافظ ابن حجر ( تق: 8010) أي مجہول الحال وللحدیث شاہد ضعیف عند أبي داود(2622)و ابن ماجہ ( 2299 )`;
tirmizi.anwaar = [222,1];