var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا إِسْحَقُ بْنُ سُلَيْمَانَ الرَّازِيُّ عَنْ مُغِيرَةَ بْنِ مُسْلِمٍ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ يُحِبُّ سَمْحَ الْبَيْعِ سَمْحَ الشِّرَاءِ سَمْحَ الْقَضَاءِ قَالَ وَفِي الْبَاب عَنْ جَابِرٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ رَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ يُونُسَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا: 'اللہ تعالیٰ بیچنے،خریدنے اورقرض کے مطالبہ میں نرمی وآسانی کو پسند کرتاہے'۔امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-بعض لوگوں نے اس حدیث کو بسند یونس عن سعیدالمقبری عن ابی ہریرۃ روایت کی ہے،۳-اس باب میں جابر رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1319] إن اللّٰہ یحب سمح البیع
إسنادہ ضعیف باب ما جاء في سمح البیع والشراء والقضاء
یونس بن عبید مدلس ( طبقات المدلسین : 64/ 2 وھو من الثالثۃ ) وعنعن وللحدیث لون آخر ضعیف عندالحاکم (2/ 56) والحدیث الآتي ( الأصل : 1320 ) یغني عنہ۔`;
tirmizi.anwaar = [222,2];