var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ قَال سَمِعْتُ عَبْدَ الْمَلِكِ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ أَنَّ عُثْمَانَ قَالَ لِابْنِ عُمَرَ اذْهَبْ فَاقْضِ بَيْنَ النَّاسِ قَالَ أَوَ تُعَافِينِي يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ فَمَا تَكْرَهُ مِنْ ذَلِكَ وَقَدْ كَانَ أَبُوكَ يَقْضِي قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَانَ قَاضِيًا فَقَضَى بِالْعَدْلِ فَبِالْحَرِيِّ أَنْ يَنْقَلِبَ مِنْهُ كَفَافًا فَمَا أَرْجُو بَعْدَ ذَلِكَ وَفِي الْحَدِيثِ قِصَّةٌ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ غَرِيبٌ وَلَيْسَ إِسْنَادُهُ عِنْدِي بِمُتَّصِلٍ وَعَبْدُ الْمَلِكِ الَّذِي رَوَى عَنْهُ الْمُعْتَمِرُ هَذَا هُوَ عَبْدُ الْمَلِكِ بْنُ أَبِي جَمِيلَةَ";
tirmizi.urdu = "عبداللہ بن موہب کہتے ہیں کہ عثمان رضی اللہ عنہ نے ابن عمر رضی اللہ عنہما سے کہا: جاؤ(قاضی بن کر) لوگوں کے درمیان فیصلے کرو،انہوں نے کہا: امیرالمومنین! کیاآپ مجھے معاف رکھیں گے،عثمان رضی اللہ عنہ نے کہا:'تم اسے کیوں برا سمجھتے ہو،تمہارے باپ تو فیصلے کیا کرتے تھے؟' اس پر انہوں نے کہا: میں نے رسول اللہ ﷺ کو فرماتے سناہے: 'جوقاضی ہوا اوراس نے عدل انصاف کے ساتھ فیصلے کئے تو لائق ہے کہ وہ اس سے برابر سرابر چھوٹ جائے'(یعنی نہ ثواب کامستحق ہونہ عقاب کا) اس کے بعد میں(بھلائی کی)کیا امید رکھوں،حدیث میں ایک قصہ بھی ہے۔\nامام ترمذی کہتے ہیں: ۱-ابن عمر رضی اللہ عنہما کی حدیث غریب ہے،میرے نزدیک اس کی سندمتصل نہیں ہے۔اور عبدالملک جس سے معتمر نے اِسے روایت کیا ہے عبدالملک بن ابی جمیلہ ہیں،۲-اس باب میں ابوہریرہ رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1322] 1/ من کان قاضیًا فقضی بالعدل
إسنادہ ضعیف
باب ما جاء عن رسول اللّٰہ ﷺ فی القاضي
عبد الملک بن أبي جمیلۃ : مجہول (تق: 4170)
2/ القضاۃ ثلاثۃ
إسنادہ ضعیف/ د 3573،جہ 2315
باب ما جاء عن رسول اللّٰہ ﷺ فی القاضي
الأعمش وشریک القاضي عنعنا ( تقدما : 169،112 )`;
tirmizi.anwaar = [223,1];