var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ عَبْدِ الْأَعْلَى عَنْ بِلَالِ بْنِ أَبِي مُوسَى عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ الْقَضَاءَ وُكِلَ إِلَى نَفْسِهِ وَمَنْ أُجْبِرَ عَلَيْهِ يُنْزِلُ اللَّهُ عَلَيْهِ مَلَكًا فَيُسَدِّدُهُ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا: 'جو قضا کا مطالبہ کرتاہے وہ اپنی ذات کے حوالے کردیاجاتاہے(اللہ کی مدداس کے شامل حال نہیں ہوتی) اورجس کو جبراً قاضی بنایا جاتاہے،اللہ اس کے پاس ایک فرشتہ بھیجتا ہے جو اُسے راہ راست پررکھتاہے'۔";
tirmizi.hukam = "";
tirmizi.description = `[1323] من سأل القضاء وکل إلی نفسہ
إسنادہ ضعیف / د 3578،جہ 2309  باب ما جاء عن رسول اللّٰہ ﷺ فی القاضي`;
tirmizi.anwaar = [223,1];