var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُالرَّحْمَانِ بْنُ مَهْدِيٍّ قَالاَ: حَدَّثَنَا شُعْبَةُ،عَنْ أَبِي عَوْنٍ،عَنِ الْحَارِثِ بْنِ عَمْرٍو،ابْنِ أَخٍ لِلْمُغِيرَةِ بْنِ شُعْبَةَ،عَنْ أُنَاسٍ مِنْ أَهْلِ حِمْصٍ،عَنْ مُعَاذٍ،عَنِ النَّبِيِّ ﷺ،نَحْوَهُ.\nقَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ. وَلَيْسَ إِسْنَادُهُ عِنْدِي بِمُتَّصِلٍ. وَأَبُو عَوْنٍ الثَّقَفِيُّ،اسْمُهُ مُحَمَّدُ بْنُ عُبَيْدِ اللهِ";
tirmizi.urdu = "اس سندسے بھی معاذ سے اسی طرح کی حدیث مرفوعاً مروی ہے۔\nامام ترمذی کہتے ہیں: ۱-اس حدیث کو ہم صرف اسی طریق سے جانتے ہیں،۲-اور اس کی سندمیرے نزدیک متصل نہیں ہے،۳-ابوعون ثقفی کانام محمدبن عبیداللہ ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔1328] کیف تقضي؟
إسنادہ ضعیف / د 3593    باب ما جاء فی القاضي کیف یقضي`;
tirmizi.anwaar = [223,1];