var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ حَنَشٍ عَنْ عَلِيٍّ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَقَاضَى إِلَيْكَ رَجُلَانِ فَلَا تَقْضِ لِلْأَوَّلِ حَتَّى تَسْمَعَ كَلَامَ الْآخَرِ فَسَوْفَ تَدْرِي كَيْفَ تَقْضِي قَالَ عَلِيٌّ فَمَا زِلْتُ قَاضِيًا بَعْدُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں کہ مجھ سے رسول اللہ ﷺ نے فرمایا: 'جب تمہارے پاس دوآدمی فیصلہ کے لیے آئیں توتم پہلے کے حق میں فیصلہ نہ کرو جب تک کہ دوسرے کی بات نہ سن لو ۱؎ عنقریب تم جان لوگے کہ تم کیسے فیصلہ کرو'۔علی کہتے ہیں: اس کے بعد میں برابرفیصلے کرتارہا۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1331] إذا تقاضی إلیک رجلان
إسنادہ ضعیف/ د 3582 باب ما جاء فی القاضي لا یقضي إلخ`;
tirmizi.anwaar = [223,1];