var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ،عَنْ يَزِيدَ بْنِ أَبِي مَرْيَمَ،عَنْ الْقَاسِمِ بْنِ مُخَيْمِرَةَ،عَنْ أَبِي مَرْيَمَ صَاحِبِ رَسُولِ اللهِ ﷺ،عَنِ النَّبِيِّ ﷺ نَحْوَ هَذَا الْحَدِيثِ بِمَعْنَاهُ. وَيَزِيدُ بْنُ أَبِي مَرْيَمَ،شَامِيٌّ. وَبُرَيْدُ بْنُ أَبِي مَرْيَمَ،كُوفِيٌّ. وَأَبُو مَرْيَمَ هُوَ عَمْرُو بْنُ مُرَّةَ الْجُهَنِيُّ.";
tirmizi.urdu = "ابومریم رضی اللہ عنہ نے نبی اکرمﷺسے اسی حدیث کی طرح اسی مفہوم کی حدیث روایت کی ہے۔\nیزید بن ابی مریم شام کے رہنے والے ہیں اور برید بن ابی مریم کو فہ کے رہنے والے ہیں اور ابومریم کانام عمرو بن مرہ جہنی ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 3728`;