var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ خُصَيْفٍ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ يَقَعُ عَلَى امْرَأَتِهِ وَهِيَ حَائِضٌ قَالَ يَتَصَدَّقُ بِنِصْفِ دِينَارٍ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم ﷺ نے اس آدمی کے بارے میں جو اپنی بیوی سے حیض کی حالت میں جماع کرتاہے فرمایا: 'وہ آدھا دینار صدقہ کرے'۔";
tirmizi.hukam = "";
tirmizi.description = `[136] یتصدق بنصف دینار
إسنادہ ضعیف / د 266 باب ما جاء فی الکفارۃ في ذلک`;
tirmizi.anwaar = [193,1];