var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا سُوَيْدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ حُمَيْدٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعَارَ قَصْعَةً فَضَاعَتْ فَضَمِنَهَا لَهُمْ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ غَيْرُ مَحْفُوظٍ وَإِنَّمَا أَرَادَ عِنْدِي سُوَيْدٌ الْحَدِيثَ الَّذِي رَوَاهُ الثَّوْرِيُّ وَحَدِيثُ الثَّوْرِيِّ أَصَحُّ اسْمُ أَبِي دَاوُدَ عُمَرُ بْنُ سَعْدٍ";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں: نبی اکرمﷺنے ایک پیالہ منگنی لیا وہ ٹوٹ گیا،توآپ نے جن سے پیالہ لیاتھا انہیں اس کا تاوان اداکیا۔امام ترمذی کہتے ہیں: ۱-یہ حدیث محفوظ نہیں ہے،۲-سوید نے مجھ سے وہی حدیث بیان کرنی چاہی تھی جسے ثوری نے روایت کی ہے ۱؎،۳-ثوری کی حدیث زیادہ صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1360] أن النبيﷺ استعار قصعۃ
إسنادہ ضعیف باب ما جاء فیمن یکسر لہ الشئ إلخ
سوید بن عبد العزیز ضعیف ( تق : 2692)و قال الھیثمي : وضعفہ جمھور الأئمۃ ( مجمع الزوائد 3/ 147 ) وقال أیضًا : و فیہ سوید بن عبدالعزیز و قد أجمعوا علی ضعفہ ( مجمع الزوائد 141/1 ) !! 
والحدیث السابق ( الأصل : 1359) یغني عنہ۔`;
tirmizi.anwaar = [224,1];