var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ يَزِيدَ الرَّقَاشِيِّ حَدَّثَنَا أَبُو الْحَكَمِ الْبَجَلِيُّ قَال سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ وَأَبَا هُرَيْرَةَ يَذْكُرَانِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ أَهْلَ السَّمَاءِ وَأَهْلَ الْأَرْضِ اشْتَرَكُوا فِي دَمِ مُؤْمِنٍ لَأَكَبَّهُمْ اللَّهُ فِي النَّارِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَأَبُو الْحَكَمِ الْبَجَلِيُّ هُوَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي نُعْمٍ الْكُوفِيُّ";
tirmizi.urdu = "ابوسعید خدری اورابوہریرہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' اگر آسمان اور زمین والے (سارے کے سارے) ایک مومن کے خون میں ملوث ہوجائیں تواللہ ان (سب) کو اوندھے منہ جہنم میں ڈال دے گا'۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1398] لو أن أھل السماء وأھل الأرض اشترکوا
إسنادہ ضعیف باب الحکم فی الدماء
یزید الرقاشي زاہد ضعیف ( تق : 7683) و قال الھیثمي : ضعفہ الجمھور ( مجمع الزوائد 6/ 226) وللحدیث شواہد ضعیفۃ عند البیہقي (22/8) وغیرہ۔`;
tirmizi.anwaar = [224,1];