var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا مَعْنٌ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَمَ يَهُودِيًّا وَيَهُودِيَّةً قَالَ أَبُو عِيسَى وَفِي الْحَدِيثِ قِصَّةٌ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺنے ایک یہودی مرد اورایک یہودی عورت کو رجم کیا۔\nامام ترمذی کہتے ہیں: ۱-اور یہ حدیث حسن صحیح ہے،۲-حدیث میں ایک قصہ کا بھی ذکرہے ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;