var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا هَمَّامٌ عَنْ الْقَاسِمِ بْنِ عَبْدِ الْوَاحِدِ الْمَكِّيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عُقَيْلٍ أَنَّهُ سَمِعَ جَابِرًا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخْوَفَ مَا أَخَافُ عَلَى أُمَّتِي عَمَلُ قَوْمِ لُوطٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عُقَيْلِ بْنِ أَبِي طَالِبٍ عَنْ جَابِرٍ";
tirmizi.urdu = "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' مجھے اپنی امت کے بارے میں جس چیز کاسب سے زیادہ خوف ہے وہ قوم لوط کاعمل (اغلام بازی)ہے'۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-اور ہم اسے صرف اسی سند(عن عبد اللہ بن محمد بن عقیل بن أبوطالب عن جابر) سے ہی جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1457] إن أخوف ما أخاف علی أمتي عمل قوم لوط
إسنادہ ضعیف / جہ 2563   باب ما جاء في حد اللوطي
ابن عقیل : ضعیف ( تقدم :997) `;
tirmizi.anwaar = [225,1];