var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ فَحِيلٍ يَأْكُلُ فِي سَوَادٍ وَيَمْشِي فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَفْصِ بْنِ غِيَاثٍ";
tirmizi.urdu = "ابوسعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺنے سینگ والے ایک نرمینڈھے کی قربانی کی،وہ سیاہی میں کھاتاتھا،سیاہی میں چلتاتھااورسیاہی میں دیکھتاتھا ۱؎۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح غریب ہے،۲-ہم اس کو صرف حفص بن غیاث ہی کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1496] ضحی رسول اللّٰہ ﷺ بکبش أقرن فحیل
سندہ ضعیف / د 2796،ن 4395،جہ 3128 باب ما یستحب من الأضاحي`;
tirmizi.anwaar = [317,1];