var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ وَهَنَّادٌ قَالَا حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ حَجَّاجِ بْنِ أَرْطَاةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ أَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ عَشْرَ سِنِينَ يُضَحِّي قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ مدینہ میں دس سال مقیم رہے اورآپ (ہرسال) قربانی کرتے رہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1507] أقام رسول اللّٰہ ﷺ بالمدینۃ
إسنادہ ضعیف/ انظر الحدیث السابق : 1506  باب [الدلیل علی أن الأضحیۃ سنۃ]`;
tirmizi.anwaar = [227,1];