var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ الرَّبَابِ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ الْغُلَامِ عَقِيقَةٌ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الْأَذَى حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ عُيَيْنَةَ عَنْ عَاصِمِ بْنِ سُلَيْمَانَ الْأَحْوَلِ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ الرَّبَابِ عَنْ سَلْمَانَ بْنِ عَامِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "سلمان بن عامر ضبی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' لڑکے کی پیدائش پر عقیقہ لازم ہے،لہذا اس کی طرف سے خون بہاؤ (جانور ذبح کرو) اوراس سے گندگی دورکرو'۔اس سند سے بھی سلمان بن عامر رضی اللہ عنہ سے اسی جیسی حدیث روایت مروی ہے۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1514] رأیت رسول اللّٰہ ﷺ أذن في أذن الحسن
إسنادہ ضعیف / د 5105    باب الأذان في أذن المولود`;
tirmizi.anwaar = [227,1];