var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا أَبُو الْمُغِيرَةِ عَنْ عُفَيْرِ بْنِ مَعْدَانَ عَنْ سُلَيْمِ بْنِ عَامِرٍ عَنْ أَبِي أُمَامَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ الْأُضْحِيَّةِ الْكَبْشُ وَخَيْرُ الْكَفَنِ الْحُلَّةُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَعُفَيْرُ بْنُ مَعْدَانَ يُضَعَّفُ فِي الْحَدِيثِ";
tirmizi.urdu = "ابوامامہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:'قربانی کے جانوروں میں سب سے بہتر مینڈھاہے اورسب سے بہترکفن حلہ (تہبنداورچادر)ہے'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-عفیربن معدان حدیث کی روایت میں ضعیف ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1517] خیر الأضحیۃ الکبش
إسنادہ ضعیف / جہ 3130   باب (خیر الأضحیۃ الکبش)
عفیر: ضعیف (تق: 4626) `;
tirmizi.anwaar = [228,1];