var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ عَوْنٍ حَدَّثَنَا أَبُو رَمْلَةَ عَنْ مِخْنَفِ بْنِ سُلَيْمٍ قَالَ كُنَّا وُقُوفًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَاتٍ فَسَمِعْتُهُ يَقُولُ يَا أَيُّهَا النَّاسُ عَلَى كُلِّ أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أُضْحِيَّةٌ وَعَتِيرَةٌ هَلْ تَدْرُونَ مَا الْعَتِيرَةُ هِيَ الَّتِي تُسَمُّونَهَا الرَّجَبِيَّةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَلَا نَعْرِفُ هَذَا الْحَدِيثَ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ ابْنِ عَوْنٍ";
tirmizi.urdu = "مخنف بن سلیم رضی اللہ عنہ کہتے ہیں: ہم لوگ نبی اکرمﷺکے ساتھ میدان عرفات میں ٹھہرے ہوئے تھے،میں نے آپ کو فرماتے سنا: لوگو! ہرگھروالے پرہرسال ایک قربانی اورعتیرہ ہے،تم لوگ جانتے ہوعتیرہ کیا ہے؟عتیرہ وہ ہے جسے تم لوگ رجبیہ کہتے ہو۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اس کو ابن عون ہی کی سندسے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1518] یا أیھا الناس ! علٰی کل أھل بیت
إسنادہ ضعیف/ د 2788،ن 4229،جہ 3125    باب [الأضحیۃ في کل عام]`;
tirmizi.anwaar = [228,1];