var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْعَدَنِيُّ الْمَكِّيُّ وَيُكْنَى بِأَبِي عَبْدِ اللَّهِ الرَّجُلِ الصَّالِحِ هُوَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ نَوْفَلِ بْنِ مُسَاحِقٍ عَنْ ابْنِ عِصَامٍ الْمُزَنِيِّ عَنْ أَبِيهِ وَكَانَتْ لَهُ صُحْبَةٌ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ جَيْشًا أَوْ سَرِيَّةً يَقُولُ لَهُمْ إِذَا رَأَيْتُمْ مَسْجِدًا أَوْ سَمِعْتُمْ مُؤَذِّنًا فَلَا تَقْتُلُوا أَحَدًا هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَهُوَ حَدِيثُ ابْنِ عُيَيْنَةَ";
tirmizi.urdu = "عصام مزنی رضی اللہ عنہ کہتے ہیں: رسول اللہ ﷺ جب کوئی لشکریاسریہ بھیجتے تو ان سے فرماتے: جب تم کوئی مسجد دیکھو یا موذن کی آواز سنوتوکسی کونہ مارو ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،اوریہ ابن عیینہ سے آئی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1549] إذا رأیتم مسجدًا أوسمعتم مؤذنًا
إسنادہ ضعیف/ د 2635 باب [النھي عن الإغارۃ]`;
tirmizi.anwaar = [228,1];