var tirmizi = {};
tirmizi.arabic = "حَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ ثَوْبَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَاتَ وَهُوَ بَرِيءٌ مِنْ ثَلَاثٍ الْكِبْرِ وَالْغُلُولِ وَالدَّيْنِ دَخَلَ الْجَنَّةَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ";
tirmizi.urdu = "ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' جو مرگیا اورتین چیزوں یعنی تکبر(گھمنڈ)،مال غنیمت میں خیانت اورقرض سے بری رہا،وہ جنت میں داخل ہوگا'۔\nامام ترمذی کہتے ہیں: اس باب میں ابوہریرہ اورزید بن خالد جہنی رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 2921
وللحدیث شواھد`;