var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ ثَوْبَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ فَارَقَ الرُّوحُ الْجَسَدَ وَهُوَ بَرِيءٌ مِنْ ثَلَاثٍ الْكَنْزِ وَالْغُلُولِ وَالدَّيْنِ دَخَلَ الْجَنَّةَ هَكَذَا قَالَ سَعِيدٌ الْكَنْزُ وَقَالَ أَبُو عَوَانَةَ فِي حَدِيثِهِ الْكِبْرُ وَلَمْ يَذْكُرْ فِيهِ عَنْ مَعْدَانَ وَرِوَايَةُ سَعِيدٍ أَصَحُّ";
tirmizi.urdu = "ثوبان رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺنے فرمایا:' جس کے جسم سے روح نکلی اور وہ تین چیزوں یعنی کنز،غلول اورقرض سے بری رہا،وہ جنت میں داخل ہوگا ' ۱؎۔\nسعید بن ابی عروبہ نے اسی طرح اپنی روایت میں 'الکنز'بیان کیا ہے اور ابوعوانہ نے اپنی روایت میں 'الکبر' بیان کیا ہے،اوراس میں ' عن معدان' کا ذکرنہیں کیا ہے،سعید کی روایت زیادہ صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1573] من فارق الروح الجسد
إسنادہ ضعیف باب ما جاء فی الغلول
قتادۃ عنعن في ھٰذا اللفظ : ’’ الکنز ‘‘ ( و تقدم :30) و روی الإمام أحمد ( 5/ 282) عن ثوبان رضي اللّٰہ عنہ أن رسول اللّٰہ ﷺ قال: (( من فارق الروح الجسد وھو برئ من ثلاث دخل الجنۃ: الغلال والدین [قال بھز:] والکبر)) وسندہ صحیح وھو یغني عنہ۔`;
tirmizi.anwaar = [229,1];