var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ سَعِيدٍ الْكِنْدِيُّ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ إِسْرَائِيلَ عَنْ ثُوَيْرٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ كِسْرَى أَهْدَى لَهُ فَقَبِلَ وَأَنَّ الْمُلُوكَ أَهْدَوْا إِلَيْهِ فَقَبِلَ مِنْهُمْ وَفِي الْبَاب عَنْ جَابِرٍ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَثُوَيْرُ بْنُ أَبِي فَاخِتَةَ اسْمُهُ سَعِيدُ بْنُ عِلَاقَةَ وَثُوَيْرٌ يُكْنَى أَبَا جَهْمٍ";
tirmizi.urdu = "علی رضی اللہ عنہ سے روایت ہے: نبی اکرمﷺ کے لیے فارس کے بادشاہ کسریٰ نے آپ کے لیے تحفہ بھیجا تو آپ نے اسے قبول کر لیا،(کچھ)اور بادشاہوں نے آپ کے لیے تحفہ بھیجاتوآپ نے ان کے تحفے قبول کئے۔\nامام ترمذ ی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-راوی ثویر ابوفاختہ کے بیٹے ہیں،ابوفاختہ کانام سعید بن علاقہ ہے اور ثویرکی کنیت ابوجہم ہے،۳-اس باب میں جابرسے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1576] أن کسری أھدی لہ فقبل
إسنادہ ضعیف باب ما جاء في قبول ھدایا المشرکین
ثویر : ضعیف ( تقدم : 501) `;
tirmizi.anwaar = [229,1];