var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى الْكُوفِيُّ حَدَّثَنَا أَبُو بكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ كُنَّا نَتَحَدَّثُ أَنَّ أَصْحَابَ بَدْرٍ يَوْمَ بَدْرٍ كَعِدَّةِ أَصْحَابِ طَالُوتَ ثَلَاثُ مِائَةٍ وَثَلَاثَةَ عَشَرَ رَجُلًا قَالَ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ الثَّوْرِيُّ وَغَيْرُهُ عَنْ أَبِي إِسْحَقَ";
tirmizi.urdu = "براء رضی اللہ عنہ کہتے ہیں: ہم لوگ کہاکرتے تھے کہ غزوئہ بدرکے دن بدری لوگ تعداد میں طالوت کے ساتھیوں کے برابرتین سوتیرہ تھے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-ثوری اوردوسرے لوگوں نے بھی ابواسحاق سبیعی سے اس کی روایت کی ہے،۳-اس باب میں ابن عباس سے بھی روایت ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;