var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ أَخْبَرَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَئِنْ عِشْتُ إِنْ شَاءَ اللَّهُ لَأُخْرِجَنَّ الْيَهُودَ وَالنَّصَارَى مِنْ جَزِيرَةِ الْعَرَبِ";
tirmizi.urdu = "عمربن خطاب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' اگرمیں زندہ رہاتو ان شاء اللہ جزیرہ عرب سے یہودونصاریٰ کو نکال باہرکردوں گا ' ۱؎۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;