var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ،عَنْ أَيُّوبَ،عَنْ ابْنِ أَبِي مُلَيْكَةَ،عَنْ أُمِّ سَلَمَةَ أَنَّهَا قَالَتْ: كَانَ رَسُولُ اللهِ ﷺ أَشَدَّ تَعْجِيلاً لِلظُّهْرِ مِنْكُمْ،وَأَنْتُمْ أَشَدُّ تَعْجِيلاً لِلْعَصْرِ مِنْهُ.";
tirmizi.urdu = "ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہﷺ ظہرمیں تم لوگوں سے زیادہ جلدی کرتے تھے اور تم لوگ عصرمیں رسول اللہﷺ سے زیادہ جلدی کرتے ہو ۱؎۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 619`;