var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ هِشَامٍ الدَّسْتُوَائِيِّ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا طِيَرَةَ وَأُحِبُّ الْفَأْلَ قَالُوا يَا رَسُولَ اللَّهِ وَمَا الْفَأْلُ قَالَ الْكَلِمَةُ الطَّيِّبَةُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:'ایک کی بیماری دوسرے کولگ جانے اوربدفالی وبدشگونی کی کوئی حقیقت نہیں ہے ۱؎ اورمجھ کو فال نیک پسندہے '،لوگوں نے پوچھا: اللہ کے رسول! فال نیک کیا چیز ہے؟ آپ نے فرمایا:'اچھی بات'۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;