var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ ابْنِ أَبِي لَيْلَى،عَنْ عَطَائٍ،عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَ: قَالَ رَسُولُ اللهِ ﷺ: مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللهِ أَوْ خَلَفَهُ فِي أَهْلِهِ فَقَدْ غَزَا. قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "زیدبن خالد جہنی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺنے فرمایا:' جس نے کسی مجاہد کا سامان سفرتیارکیا،یا اس کے گھروالے کی خبرگیری کی حقیقت میں اس نے جہاد کیا'۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 3826`;