var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ،حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ أَبِي بِشْرٍ،عَنْ بَشِيرِ بْنِ ثَابِتٍ،عَنْ حَبِيبِ بْنِ سَالِمٍ،عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: أَنَا أَعْلَمُ النَّاسِ بِوَقْتِ هَذِهِ الصَّلاَةِ: كَانَ رَسُولُ اللهِ ﷺ يُصَلِّيهَا لِسُقُوطِ الْقَمَرِ لِثَالِثَةٍ.";
tirmizi.urdu = "نعمان بن بشیر رضی اللہ عنہما کہتے ہیں کہ اس صلاۃ ِعشاء کے وقت کولوگوں میں سب سے زیادہ میں جانتا ہوں،رسول اللہ ﷺ اسے تیسری تاریخ کا چاند ڈوبنے کے وقت پڑھتے تھے ۱؎۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 613`;