var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ أَبَانَ،حَدَّثَنَا عَبْدُالرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ أَبِي عَوَانَةَ،بِهَذَا الإِسْنَادِ نَحْوَهُ.\nقَالَ أَبُو عِيسَى: رَوَى هَذَا الْحَدِيثَ هُشَيْمٌ،عَنْ أَبِي بِشْرٍ،عَنْ حَبِيبِ بْنِ سَالِمٍ،عَنْ النُّعْمَانِ ابْنِ بَشِيرٍ،وَلَمْ يَذْكُرْ فِيهِ هُشَيْمٌ عَنْ بَشِيرِ بْنِ ثَابِتٍ. وَحَدِيثُ أَبِي عَوَانَةَ أَصَحُّ عِنْدَنَا،لأَنَّ يَزِيدَ بْنَ هَارُونَ رَوَى عَنْ شُعْبَةَ،عَنْ أَبِي بِشْرٍ،نَحْوَ رِوَايَةِ أَبِي عَوَانَةَ.";
tirmizi.urdu = "اس طریق سے بھی ابوعوانہ سے اسی سندسے اسی طرح مروی ہے۔امام ترمذی نے پہلے ابوعوانہ کا طریق ذکرکیا پھرہشیم کے طریق کا اور فرمایا: ابوعوانہ والی حدیث ہمارے نزدیک زیادہ صحیح ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;