var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَاصِمِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ النَّاسَ يَعْلَمُونَ مَا أَعْلَمُ مِنْ الْوِحْدَةِ مَا سَرَى رَاكِبٌ بِلَيْلٍ يَعْنِي وَحْدَهُ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' اگر لوگ تنہائی کا وہ نقصان جان لیتے جو میں جانتاہوں تو کوئی سواررات میں تنہانہ چلے ' ۱؎۔امام ترمذی کہتے ہیں: ابن عمرکی حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;