var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا يَحْيَى بْنُ إِسْحَقَ وَهُوَ السَّالِحَانِيُّ حَدَّثَنَا يَزِيدُ بْنُ حَيَّانَ قَال سَمِعْتُ أَبَا مِجْلَزٍ لَاحِقَ بْنَ حُمَيْدٍ يُحَدِّثُ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَتْ رَايَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَوْدَاءَ وَلِوَاؤُهُ أَبْيَضَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ ابْنِ عَبَّاسٍ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ کا جھنڈاکالا اور پرچم سفیدتھا۔\nامام ترمذی کہتے ہیں: ابن عباس کی یہ روایت اس سندسے حسن غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3887`;