var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ قُطْبَةَ بْنِ عَبْدِ الْعَزِيزِ عَنْ الْأَعْمَشِ عَنْ أَبِي يَحْيَى عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّحْرِيشِ بَيْنَ الْبَهَائِمِ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے جانوروں کو باہم لڑانے سے منع فرمایا ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[1708] نھی رسول اللّٰہ ﷺ عن التحریش
إسنادہ ضعیف / د 2562    باب ما جاء في کراہیۃ التحریش بین البھائم`;
tirmizi.anwaar = [231,1];