var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ يَوْمَ الْفَتْحِ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ قَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَعُمَرَ وَابْنِ حُرَيْثٍ وَابْنِ عَبَّاسٍ وَرُكَانَةَ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "جابر رضی اللہ عنہ کہتے ہیں کہ نبی اکرم ﷺ فتح مکہ کے دن مکہ میں اس حال میں داخل ہوئے کہ آپ کے سرپر سیاہ عمامہ تھا ۱؎۔\nامام ترمذی کہتے ہیں: اس باب میں علی،عمر،ابن حریث،ابن عباس اوررکانہ رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;