var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ قَالَ كَانَ الْحَسَنُ وَالْحُسَيْنُ يَتَخَتَّمَانِ فِي يَسَارِهِمَا هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "محمد الباقرکہتے ہیں: حسن اورحسین اپنے بائیں ہاتھ میں انگوٹھی پہنتے تھے۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1743] کان الحسن والحسین یتختمان
إسنادہ ضعیف باب ما جاء في لبس الخاتم فی الیمین
السند منقطع،محمد بن علي الباقر لم یدرک الحسن والحسین رضي اللّٰہ عنہما۔`;
tirmizi.anwaar = [232,1];