var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ وَالْحَجَّاجُ بْنُ مِنْهَالٍ قَالَا حَدَّثَنَا هَمَّامٌ عَنْ ابْنِ جُرَيْجٍ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلَاءَ نَزَعَ خَاتَمَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ جب پاخانہ جاتے تو اپنی انگوٹھی اتاردیتے ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1746] کان إذا دخل الخلاء نزع خاتمہ
إسنادہ ضعیف / د 19،ن 5216،جہ 303  باب ما جاء في نقش الخاتم فی الیمین`;
tirmizi.anwaar = [232,1];