var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ هِشَامٍ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّرَجُّلِ إِلَّا غِبًّا حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ عَنْ الْحَسَنِ بِهَذَا الْإِسْنَادِ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ وَفِي الْبَاب عَنْ أَنَسٍ";
tirmizi.urdu = "عبداللہ بن مغفل رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے کنگھی کرنے سے منع فرمایا،سوائے اس کے کہ ناغہ کرکے کی جائے۔اس سند سے بھی عبد اللہ بن مغفل رضی اللہ عنہ سے اسی جیسی روایت ہے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں انس سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1756] نھی رسول اللّٰہ ﷺ عن الترجل إلا غبًا
إسنادہ ضعیف / د 4159،ن 5058 باب ما جاء فی النھي عن الترجل إلا غبًا`;
tirmizi.anwaar = [232,1];