var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ الْحَسَنِ بْنِ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ هُوَ الشَّيْبَانِيُّ عَنْ الشَّعْبِيِّ قَالَ قَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ أَهْدَى دِحْيَةُ الْكَلْبِيُّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُفَّيْنِ فَلَبِسَهُمَا قَالَ أَبُو عِيسَى و قَالَ إِسْرَائِيلُ عَنْ جَابِرٍ عَنْ عَامِرٍ وَجُبَّةً فَلَبِسَهُمَا حَتَّى تَخَرَّقَا لَا يَدْرِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَذَكِيٌّ هُمَا أَمْ لَا وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَأَبُو إِسْحَقَ اسْمُهُ سُلَيْمَانُ وَالْحَسَنُ بْنُ عَيَّاشٍ هُوَ أَخُو أَبِي بَكْرِ بْنِ عَيَّاشٍ";
tirmizi.urdu = "مغیرہ بن شعبہ رضی اللہ عنہ کہتے ہیں: دحیہ کلبی نے رسول اللہ ﷺکے لیے دوموزے تحفہ بھیجے،چنانچہ آپ نے انہیں پہنا۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-اسرائیل نے اپنی روایت میں کہاہے (جسے وہ بطریق عن جابر روایت کرتے ہیں): ایک جبہ بھی بھیجا،آپ نے ان دونوں موزوں کو پہنا یہاں تک کہ وہ پھٹ گئے،نبی اکرم ﷺ نہیں جانتے تھے کہ وہ مذبوح جانورکی کھال کے ہیں یا غیرمذبوح،۳-ابواسحاق سبیعی کا نام سلیمان ہے،۴-حسن بن عیاش ابوبکربن عیاش کے بھائی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1769] وجبۃ فلبسھما حتی تحرقا
إسنادہ ضعیف باب ما جاء في لبس الجبۃ والخفین
حدیث إسرائیل عن جابر عن عامر : ضعیف ( جابر الجعفي ضعیف تقدم : 206) و باقی الحدیث صحیح۔`;
tirmizi.anwaar = [232,2];