var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ الْبَصْرِيُّ حَدَّثَنَا الْحَارِثُ بْنُ نَبْهَانَ عَنْ مَعْمَرٍ عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْتَعِلَ الرَّجُلُ وَهُوَ قَائِمٌ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَرَوَى عُبَيْدُ اللَّهِ بْنُ عَمْرٍو الرَّقِّيُّ هَذَا الْحَدِيثَ عَنْ مَعْمَرٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ وَكِلَا الْحَدِيثَيْنِ لَا يَصِحُّ عِنْدَ أَهْلِ الْحَدِيثِ وَالْحَارِثُ بْنُ نَبْهَانَ لَيْسَ عِنْدَهُمْ بِالْحَافِظِ وَلَا نَعْرِفُ لِحَدِيثِ قَتَادَةَ عَنْ أَنَسٍ أَصْلًا";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں: رسول اللہ ﷺ نے منع فرمایا کہ کوئی شخص کھڑے ہوکرجوتاپہنے ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-عبیداللہ بن عمرورقی نے اس حدیث کو معمرسے،معمرنے قتادہ سے،قتادہ نے انس سے روایت کی ہے،یہ دونوں حدیثیں محدثین کے نزدیک صحیح نہیں ہیں،حارث بن نبہان کا حافظہ محدثین کے نزدیک قوی نہیں ہے،۳-قتادہ کی انس سے مروی حدیث کی ہم کوئی اصل نہیں جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1775] نھی رسول اللّٰہ ﷺ أن ینتعل الرجل
ضعیف جدًا   باب ما جاء في کراہیۃ أن ینتعل الرجل وھو قائم
الحارث بن نبھان : متروک ( تق: 1051) وللحدیث شواہد ضعیفۃ عند ابن ماجہ (3618،3619) وغیرہ۔`;
tirmizi.anwaar = [233,1];