var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو جَعْفَرٍ السِّمْنَانِيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ الرَّقِّيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو الرَّقِّيُّ عَنْ مَعْمَرٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَنْتَعِلَ الرَّجُلُ وَهُوَ قَائِمٌ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ و قَالَ مُحَمَّدُ بْنُ إِسْمَعِيلَ وَلَا يَصِحُّ هَذَا الْحَدِيثُ وَلَا حَدِيثُ مَعْمَرٍ عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ عَنْ أَبِي هُرَيْرَةَ";
tirmizi.urdu = "انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے کھڑے ہوکر جوتاپہننے سے منع فرمایا۔\nٍ امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-محمدبن اسماعیل بخاری کہتے ہیں: یہ حدیث صحیح نہیں ہے،اورنہ ہی معمرکی حدیث جسے وہ عماربن ابی عمارسے اور عمار ابوہریرہ سے روایت کرتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1776] أن رسول اللّٰہ ﷺ نھی أن ینتعل الرجل
إسنادہ ضعیف باب ما جاء في کراہیۃ أن ینتعل الرجل وھو قائم
قتادۃ عنعن ( تقدم : 30)`;
tirmizi.anwaar = [233,1];