var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ السَّلُولِيُّ كُوفِيٌّ حَدَّثَنَا هُرَيْمُ بْنُ سُفْيَانَ الْبَجَلِيُّ الْكُوفِيُّ عَنْ لَيْثٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ رُبَّمَا مَشَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَعْلٍ وَاحِدَةٍ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ بسااوقات نبی اکرم ﷺ ایک جوتا پہن کر چلتے۔";
tirmizi.hukam = "";
tirmizi.description = `[1777] ربما مشی النبيﷺ في نعل واحدۃ
إسنادہ ضعیف باب ما جاء فی الرخصۃ فی المشي فی النعل الواحدۃ
لیث بن أبي سلیم : ضعیف ( تقدم :218)`;
tirmizi.anwaar = [233,1];