var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا مَشَتْ بِنَعْلٍ وَاحِدَةٍ وَهَذَا أَصَحُّ قَالَ أَبُو عِيسَى هَكَذَا رَوَاهُ سُفْيَانُ الثَّوْرِيُّ وَغَيْرُ وَاحِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ مَوْقُوفًا وَهَذَا أَصَحُّ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا سے روایت ہے کہ وہ ایک جوتاپہن کر چلیں۔\nامام ترمذی کہتے ہیں:۱-یہ روایت زیادہ صحیح ہے ۱؎،۲-سفیان ثوری اورکئی لوگوں نے اسی طرح اس حدیث کو عبدالرحمٰن بن قاسم کے واسطہ سے موقوف طریقہ سے روایت کیا ہے اور یہ موقوف روایت زیادہ صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1778] أنھا مشت بنعل واحدۃ
إسنادہ ضعیف باب ما جاء فی الرخصۃ فی المشي فی النعل الواحدۃ
سفیان بن عیینۃ مدلس و عنعن و لم أجد تصریح سماعہ ( د 295)`;
tirmizi.anwaar = [233,1];