var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ الْمُعَلَّى بْنُ رَاشِدٍ قَالَ حَدَّثَتْنِي جَدَّتِي أُمُّ عَاصِمٍ وَكَانَتْ أُمَّ وَلَدٍ لِسِنَانِ بْنِ سَلَمَةَ قَالَتْ دَخَلَ عَلَيْنَا نُبَيْشَةُ الْخَيْرِ وَنَحْنُ نَأْكُلُ فِي قَصْعَةٍ فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَكَلَ فِي قَصْعَةٍ ثُمَّ لَحِسَهَا اسْتَغْفَرَتْ لَهُ الْقَصْعَةُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْمُعَلَّى بْنِ رَاشِدٍ وَقَدْ رَوَى يَزِيدُ بْنُ هَارُونَ وَغَيْرُ وَاحِدٍ مِنْ الْأَئِمَّةِ عَنْ الْمُعَلَّى بْنِ رَاشِدٍ هَذَا الْحَدِيثَ";
tirmizi.urdu = "ام عاصم کہتی ہیں: ہمارے پاس نبیشہ الخیرآئے،ہم لوگ ایک پیالے میں کھانا کھارہے تھے،تو انہوں نے ہم سے بیان کیا کہ رسول اللہ ﷺ نے فرمایا: 'جوشخص پیالے میں کھائے پھر اسے چاٹے توپیالہ اس کے لیے استغفار کرتا ہے '۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،ہم اسے صرف معلی بن راشد کی روایت سے جانتے ہیں،۲-یزید بن ہارون اورکئی ائمہ حدیث نے بھی یہ حدیث معلی بن راشد سے روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1804] من أکل في قصعۃ ثم لحسھا
إسنادہ ضعیف / جہ 3271   باب ما جاء فی اللقمۃ تسقط
أم عاصم لم أجدلھا توثیقًا وقال الحافظ : مقبولۃ ( تق: 8743) أي مجہولۃ الحال۔`;
tirmizi.anwaar = [234,1];