var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَدُّوَيْهِ حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْجَرَّاحُ بْنُ مَلِيحٍ وَالِدُ وَكِيعٍ عَنْ أَبِي إِسْحَقَ عَنْ شَرِيكِ بْنِ حَنْبَلٍ عَنْ عَلِيٍّ أَنَّهُ قَالَ نُهِيَ عَنْ أَكْلِ الثُّومِ إِلَّا مَطْبُوخًا";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں کہ لہسن کھانے سے منع کیا گیا ہے سوائے اس کے کہ وہ پکاہواہو ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[1808] نھی عن أکل الثوم إلا مطبوخًا
إسنادہ ضعیف / د 3828    باب ما جاء فی الرخصۃ في أکل الثوم مطبوخًا`;
tirmizi.anwaar = [234,1];