var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَقَ عَنْ شَرِيكِ بْنِ حَنْبَلٍ عَنْ عَلِيٍّ قَالَ لَا يَصْلُحُ أَكْلُ الثُّومِ إِلَّا مَطْبُوخًا قَالَ أَبُو عِيسَى هَذَا الْحَدِيثُ لَيْسَ إِسْنَادُهُ بِذَلِكَ الْقَوِيِّ وَقَدْ رُوِيَ هَذَا عَنْ عَلِيٍّ قَوْلُهُ وَرُوِي عَنْ شَرِيكِ بْنِ حَنْبَلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا قَالَ مُحَمَّدٌ الْجَرَّاحُ بْنُ مَلِيحٍ صَدُوقٌ وَالْجَرَّاحُ بْنُ الضَّحَّاكِ مُقَارِبُ الْحَدِيثِ";
tirmizi.urdu = "شریک بن حنبل سے روایت ہے کہ علی رضی اللہ عنہ لہسن کھانا مکروہ سمجھتے تھے،سوائے اس کے کہ وہ پکاہواہو۔\nامام ترمذی کہتے ہیں:۱-اس حدیث کی سند زیادہ قوی نہیں ہے،یہ علی رضی اللہ عنہ کا قول ہے،۲-شریک بن حنبل کے واسطہ سے یہ حدیث نبی اکرم ﷺ سے مرسل طریقہ سے بھی آئی ہے،۳-محمدبن اسماعیل بخاری کہتے ہیں: راوی جراح بن ملیح صدوق ہیں اورجراح بن ضحاک مقارب الحدیث ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1809] لا یصلح أکل الثوم إلا مطبوخًا
إسنادہ ضعیف موقوف   باب ما جاء فی اللقمۃ تسقط
أبو إسحاق عنعن (تقدم :107) واختلط ولا یعرف سماع الجراح منہ : أقبل اختلاطہ أم بعد؟ `;
tirmizi.anwaar = [234,1];