var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ وَأَبُو النَّضْرِ عَنْ مُحَمَّدِ بْنِ طَلْحَةَ بْنِ مُصَرِّفٍ عَنْ زُبَيْدٍ عَنْ مُرَّةَ الْهَمْدَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ الْوُسْطَى صَلَاةُ الْعَصْرِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' صلاۃ وسطیٰ عصر کی صلاۃ ہے' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = `مشکوۃ المصابیح: 634`;