var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الْجَلَّالَةِ وَأَلْبَانِهَا قَالَ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَرَوَى الثَّوْرِيُّ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں: رسول اللہ ﷺ گندگی کھانے والے جانورکے گوشت کھانے اور ان کے دودھ پینے سے منع فرمایا۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-ثوری نے اسے 'عن ابن أبی نجیح عن مجاہد عن النبی ﷺ ' کی سند سے مرسل طریقہ سے روایت کی ہے،۳-اس باب میں عبداللہ بن عباس سے بھی حدیث مروی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1824] نھی رسول اللّٰہﷺ عن أکل الجلالۃ
إسنادہ ضعیف/ د 3785،جہ 3189    باب ما جاء في أکل لحوم الجلالۃ وألبانھا`;
tirmizi.anwaar = [234,1];