var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ زَهْدَمٍ عَنْ أَبِي مُوسَى قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ لَحْمَ دَجَاجٍ قَالَ وَفِي الْحَدِيثِ كَلَامٌ أَكْثَرُ مِنْ هَذَا وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَى أَيُّوبُ السَّخْتِيَانِيُّ هَذَا الْحَدِيثَ أَيْضًا عَنْ الْقَاسِمِ التَّمِيمِيِّ وَعَنْ أَبِي قِلَابَةَ عَنْ زَهْدَمٍ";
tirmizi.urdu = "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو مرغ کا گوشت کھاتے دیکھا۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-اس حدیث میں کچھ اورباتیں بھی ہیں،۳-ایوب سختیانی نے بھی اس حدیث کو 'عن القاسم التمیمی عن أبی قلابۃ عن زہدم' کی سند سے روایت کی ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;