var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْفَضْلُ بْنُ سَهْلٍ الْأَعْرَجُ الْبَغْدَادِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ بْنِ سَفِينَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ أَكَلْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَحْمَ حُبَارَى قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَإِبْرَاهِيمُ بْنُ عُمَرَ بْنِ سَفِينَةَ رَوَى عَنْهُ ابْنُ أَبِي فُدَيْكٍ وَيُقَالُ بُرَيْدُ بْنُ عُمَرَ بْنِ سَفِينَةَ";
tirmizi.urdu = "سفینہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کے ساتھ حباری کا گوشت کھایا ۱؎۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-ہم اسے صرف اسی سند سے جانتے ہیں،۳-ابراہیم بن عمربن سفینہ سے ابن ابی فدیک نے بھی روایت کی ہے،انہیں برید بن عمربن سفینہ بھی کہاگیاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1828] أکلت مع رسول اللّٰہ ﷺ لحم حباری
إسنادہ ضعیف / د 3797    باب ما جاء في أکل الحباری`;
tirmizi.anwaar = [235,1];