var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ وَمَحْمُودُ بْنُ غَيْلَانَ وَأَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ الْحَلْوَاءَ وَالْعَسَلَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَقَدْ رَوَاهُ عَلِيُّ بْنُ مُسْهِرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ وَفِي الْحَدِيثِ كَلَامٌ أَكْثَرُ مِنْ هَذَا";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم ﷺ میٹھی چیز اورشہدکو پسندکرتے تھے۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح غریب ہے،۲-اسے علی بن مسہرنے بھی ہشام بن عروہ کے واسطہ سے روایت کی ہے،۳-حدیث میں اس سے زیادہ باتیں ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;