var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنْ أَبِيهِ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَزَّ مِنْ كَتِفِ شَاةٍ فَأَكَلَ مِنْهَا ثُمَّ مَضَى إِلَى الصَّلَاةِ وَلَمْ يَتَوَضَّأْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ";
tirmizi.urdu = "عمروبن امیہ ضمری رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی اکرم ﷺ کو دیکھا کہ آپ نے بکری کی دست کاگوشت چھری سے کاٹا،اوراس میں سے کھایا،پھر صلاۃ کے لیے تشریف لے گئے اوروضونہیں کیا ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں مغیرہ بن شعبہ سے بھی روایت ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;