var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ حَدَّثَنَا يَحْيَى بْنُ عَبَّادٍ أَبُو عَبَّادٍ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ عَبْدِ الْوَهَّابِ بْنِ يَحْيَى مِنْ وَلَدِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْ مَا كَانَ الذِّرَاعُ أَحَبَّ اللَّحْمِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنْ كَانَ لَا يَجِدُ اللَّحْمَ إِلَّا غِبًّا فَكَانَ يَعْجَلُ إِلَيْهِ لِأَنَّهُ أَعْجَلُهَا نُضْجًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں:رسول اللہ ﷺ کو دست کاگوشت زیادہ پسندنہیں تھا،لیکن آپ کو یہ کبھی کبھی ملتاتھا،اس لیے آپ اسے کھانے میں جلدی کرتے تھے کیوں کہ وہ دوسرے گوشت کے مقابلہ میں جلدی گلتاہے۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے ہم اسے صرف اسی سندسے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1838] ما کان الذراع أحبّ اللحم
إسنادہ ضعیف باب ما جاء في أي اللحم کان أحب إلی رسول اللّٰہ ﷺ
عبد الوہاب بن یحیی : في سماعہ من جدہ نظر،انظر تہذیب التہذیب(402/6 طبع دارالفکر) `;
tirmizi.anwaar = [235,1];