var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى الْفَزَارِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ الْقِثَّاءَ بِالرُّطَبِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ إِبْرَاهِيمَ بْنِ سَعِدٍ";
tirmizi.urdu = "عبداللہ بن جعفر رضی اللہ عنہ کہتے ہیں کہ نبی اکرم ﷺتازہ کھجورکے ساتھ ککڑی کھاتے تھے۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح غریب ہے،۲-ہم اسے صرف ابراہیم بن سعد کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;