var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يُوسُفُ بْنُ حَمَّادٍ الْمَعْنِيُّ الْبَصْرِيُّ حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الْجُمَحِيُّ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ وَاضْرِبُوا الْهَامَ تُورَثُوا الْجِنَانَ قَالَ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَابْنِ عُمَرَ وَأَنَسٍ وَعَبْدِ اللَّهِ بْنِ سَلَامٍ وَعَبْدِ الرَّحْمَنِ بْنِ عَائِشَ وَشُرَيْحِ بْنِ هَانِئٍ عَنْ أَبِيهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ ابْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺنے فرمایا:' سلام کو عام کرو اور اسے پھیلاؤ،کھانا کھلاؤ اور کافروں کا سرمارو(یعنی ان سے جہاد کرو)جنت کے وارث بن جاؤگے' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث ابوہریرہ کے واسطہ سے ابن زیاد کی روایت سے حسن صحیح غریب ہے،۲-اس باب میں عبداللہ بن عمرو،ابن عمر،انس،عبداللہ بن سلام،عبدالرحمٰن بن عائش اورشریح بن ہانی رضی اللہ عنہم سے بھی احادیث آئی ہیں،شریح بن ہانی نے اپنے والد سے روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1854] أفشوا السلام وأطعموا الطعام
إسنادہ ضعیف باب ما جاء في فضل إطعام الطعام
عثمان الجمحي لیس بالقوي ( تق: 4495) ولبعض الحدیث شواہد کثیرۃ جدًا۔`;
tirmizi.anwaar = [236,1];