var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا مُحَمَّدُ بْنُ يَعْلَى الْكُوفِيُّ حَدَّثَنَا عَنْبَسَةُ بْنُ عَبْدِ الرَّحْمَنِ الْقُرَشِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ عَلَّاقٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَشَّوْا وَلَوْ بِكَفٍّ مِنْ حَشَفٍ فَإِنَّ تَرْكَ الْعَشَاءِ مَهْرَمَةٌ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ مُنْكَرٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَعَنْبَسَةُ يُضَعَّفُ فِي الْحَدِيثِ وَعَبْدُ الْمَلِكِ بْنِ عَلَّاقٍ مَجْهُولٌ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺ نے فرمایا:' رات کا کھانا کھاؤگرچہ ایک مٹھی ردی کھجورہی کیوں نہ ہو،اس لیے کہ رات کا کھانا چھوڑنا بڑھاپے کا سبب ہے '۔امام ترمذی کہتے ہیں:۱-یہ حدیث منکر ہے،۲-ہم اسے صرف اسی سند سے جانتے ہیں،عنبسہ حدیث بیان کرنے میں ضعیف ہیں اور عبد الملک بن علاق مجہول ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1856] تعشوا ولو بکف من حشف
إسنادہ ضعیف جدًا    باب ما جاء في فضل العشاء
محمد بن یعلی : ضعیف،وشیخہ عنبسۃ بن عبد الرحمن : متروک،رماہ أبو حاتم بالوضع (تق:6412،5206) وانظر ضعیف سنن ابن ماجہ (3355) `;
tirmizi.anwaar = [236,1];