var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَعْقُوبُ بْنُ الْوَلِيدِ الْمَدَنِيُّ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّيْطَانَ حَسَّاسٌ لَحَّاسٌ فَاحْذَرُوهُ عَلَى أَنْفُسِكُمْ مَنْ بَاتَ وَفِي يَدِهِ رِيحُ غَمَرٍ فَأَصَابَهُ شَيْءٌ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ مِنْ حَدِيثِ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' شیطان بہت تاڑ نے اور چاٹنے والاہے،اس سے خود کو بچاؤ،جو شخص رات گزارے اور اس کے ہاتھ میں چکنا ئی کی بوہو،پھر اسے کو ئی بلا پہنچے تو وہ صرف اپنے آپ کو برابھلاکہے '۔امام ترمذی کہتے ہیں:۱-یہ حدیث اس سند سے غریب ہے،۲-یہ حدیث ' عن سہیل بن ابی صالح عن ابیہ عن ابی ہریرۃ عن النبیﷺ ' کی سند سے بھی مروی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1859] إن الشیطان حساس لحاس
إسنادہ ضعیف جدًا (موضوع)    باب ما جاء في کراہیۃ البیتوتۃ وفي یدہ ریح غمر
یعقوب بن الولید : کذاب ( تقدم : 172) ولبعض الحدیث شواہد صحیحۃ منھا الحدیث الآتي(الأصل : 1860)`;
tirmizi.anwaar = [236,1];