var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى،حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ،حَدَّثَنَا إِسْرَائِيلُ،حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُهَاجِرٍ،عَنْ عَامِرٍ الشَّعْبِيِّ،عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: قَالَ رَسُولُ اللهِ ﷺ: إِنَّ مِنَ الْحِنْطَةِ خَمْرًا وَمِنَ الشَّعِيرِ خَمْرًا وَمِنَ التَّمْرِ خَمْرًا وَمِنَ الزَّبِيبِ خَمْرًا وَمِنَ الْعَسَلِ خَمْرًا. قَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ. قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ.";
tirmizi.urdu = "نعمان بن بشیر رضی اللہ عنہما کہتے ہیں: رسول اللہﷺ نے فرمایا:' گیہوں،جو،کھجور،کشمش،اورشہدسے شراب بنائی جاتی ہے ' ۱ ؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-اس باب میں ابوہریرہ سے بھی حدیث مروی ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3647`;