var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ يَزِيدَ بْنِ سِنَانٍ الْجَزَرِيِّ عَنْ ابْنٍ لِعَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَشْرَبُوا وَاحِدًا كَشُرْبِ الْبَعِيرِ وَلَكِنْ اشْرَبُوا مَثْنَى وَثُلَاثَ وَسَمُّوا إِذَا أَنْتُمْ شَرِبْتُمْ وَاحْمَدُوا إِذَا أَنْتُمْ رَفَعْتُمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَيَزِيدُ بْنُ سِنَانٍ الْجَزَرِيُّ هُوَ أَبُو فَرْوَةَ الرُّهَاوِيُّ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' اونٹ کی طرح ایک سانس میں نہ پیو،بلکہ دویاتین سانس میں پیو،جب پیو تو بسم اللہ کہو اورجب منہ سے برتن ہٹاؤتوالحمدللہ کہو'۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1885] لا تشربوا واحدًا کشرب البعیر
إسنادہ ضعیف باب ما جاء فی التنفس فی الإناء
یزید بن سنان : ضعیف ( تقدم : 1077) وشیخہ کأنہ یعقوب ( ضعیف/تق: 7826) وإلا فمجہول (تق: 8482)
و قال الھیثمي في یعقوب بن عطاء بن أبي رباح : ضعفہ أحمد و الجمہور ( مجمع الزوائد 263/3)`;
tirmizi.anwaar = [236,1];