var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ إِلَى قِرْبَةٍ مُعَلَّقَةٍ فَخَنَثَهَا ثُمَّ شَرِبَ مِنْ فِيهَا قَالَ وَفِي الْبَاب عَنْ أُمِّ سُلَيْمٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِصَحِيحٍ وَعَبْدُ اللَّهِ بْنُ عُمَرَ الْعُمَرِيُّ يُضَعَّفُ فِي الْحَدِيثِ وَلَا أَدْرِي سَمِعَ مِنْ عِيسَى أَمْ لَا";
tirmizi.urdu = "عبداللہ بن انیس رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم ﷺ کو دیکھا،آپ ایک لٹکی ہوئی مشکیزہ کے پاس گئے،اسے جھکایا،پھر اس کے منہ سے پانی پیا۔امام ترمذی کہتے ہیں:۱-اس باب میں ام سلیم سے بھی روایت ہے۔(جو آگے آرہی ہے)،۲-اس حدیث کی سند صحیح نہیں ہے،عبداللہ بن عمرحدیث بیان کرنے میں ضعیف ہیں،میں نہیں جانتاہوں کہ انہوں نے عیسیٰ سے حدیث سنی ہے یانہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1891] رأیت النبيﷺ قام إلی قربۃ
إسنادہ ضعیف/ د 3721 باب ما جاء فی الرخصۃ في ذلک`;
tirmizi.anwaar = [236,2];