var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ أَحَبُّ الشَّرَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحُلْوَ الْبَارِدَ قَالَ أَبُو عِيسَى هَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ ابْنِ عُيَيْنَةَ مِثْلَ هَذَا عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ وَالصَّحِيحُ مَا رُوِيَ عَنْ الزُّهْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہﷺ کو میٹھا اور ٹھنڈا مشروب سب سے زیادہ پسند تھا۔\nامام ترمذی کہتے ہیں: ابن عیینہ سے کئی لوگوں نے اسی طرح 'عن معمر،عن الزہری،عن عروۃ،عن عائشۃ ' روایت کی ہے،لیکن صحیح وہی ہے جو زہری کے واسطہ سے نبی اکرم ﷺ سے مرسلاً مروی ہے (جو آگے آرہی ہے)۔";
tirmizi.hukam = "";
tirmizi.description = `[1895] کان أحب الشراب إلی رسول اللّٰہ ﷺ
إسنادہ ضعیف باب ما جاء أي الشراب کان أحب إلی رسول اللّٰہ ﷺ
الزہري عنعن ( تقدم : 440) وللحدیث شاہد ضعیف عند أحمد (338/1) `;
tirmizi.anwaar = [237,1];