var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا مَعْمَرٌ وَيُونُسُ عَنْ الزُّهْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الشَّرَابِ أَطْيَبُ قَالَ الْحُلْوُ الْبَارِدُ قَالَ أَبُو عِيسَى وَهَكَذَا رَوَى عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَهَذَا أَصَحُّ مِنْ حَدِيثِ ابْنِ عُيَيْنَةَ رَحِمَهُ اللَّهُ";
tirmizi.urdu = "زہری سے روایت ہے کہ رسول اللہﷺ سے پوچھاگیا: کون سا مشروب بہترہے؟ آپ نے فرمایا:'میٹھا اور ٹھنڈا مشروب'۔\nامام ترمذی کہتے ہیں:۱-اسی طرح عبدالرزاق نے بھی معمرسے،معمر نے زہری سے اور زہری نے نبی اکرم ﷺ مرسلاً روایت کی ہے،۲-یہ ابن عیینہ رحمہ اللہ کی حدیث سے زیادہ صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1896] الحلو البارد
إسنادہ ضعیف باب ما جاء أي الشراب کان أحب إلی رسول اللّٰہ ﷺ
السند مرسل وانظر الحدیث السابق :1895`;
tirmizi.anwaar = [237,1];