var tirmizi = {};
tirmizi.arabic = "حَدَّثَنِي أَحْمَدُ بْنُ مُحَمَّدٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا يَحْيَى بْنُ عُبَيْدِ اللَّهِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحَدَكُمْ مِرْآةُ أَخِيهِ فَإِنْ رَأَى بِهِ أَذًى فَلْيُمِطْهُ عَنْهُ قَالَ أَبُو عِيسَى وَيَحْيَى بْنُ عُبَيْدِ اللَّهِ ضَعَّفَهُ شُعْبَةُ قَالَ وَفِي الْبَاب عَنْ أَنَسٍ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' تم میں سے ہرآدمی اپنے بھائی کے لیے آئینہ ہے،اگروہ اپنے بھائی کے اندرکوئی عیب دیکھے تو اسے (اطلاع کے ذریعہ) دورکردے '۔\nامام ترمذی کہتے ہیں: ۱-شعبہ نے یحیی بن عبیداللہ کو ضعیف کہا ہے،۲-اس باب میں انس رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1929] إن أحدکم مرآۃ أخیہ
إسنادہ ضعیف جدًا    باب ما جاء في شفقۃ المسلم علی المسلم
یحیی بن عبید اللّٰہ : متروک وأفحش الحاکم فرماہ بالوضع ( تق: 7599)
و قال الھیثمي : وقد ضعفہ الجمھور ( مجمع الزوائد 319/10 ) وحدیث أبي داود (4918) یغني عنہ۔`;
tirmizi.anwaar = [237,2];