var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ هَمَّامِ بْنِ يَحْيَى عَنْ فَرْقَدٍ السَّبَخِيِّ عَنْ مُرَّةَ عَنْ أَبِي بَكْرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ تَكَلَّمَ أَيُّوبُ السَّخْتِيَانِيُّ وَغَيْرُ وَاحِدٍ فِي فَرْقَدٍ السَّبَخِيِّ مِنْ قِبَلِ حِفْظِهِ";
tirmizi.urdu = "ابوبکر رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' وہ شخص جنت میں داخل نہیں ہوگا جوخادموں کے ساتھ براسلوک کرتا ہے '۔امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-ایوب سختیانی اورکئی لوگوں نے راوی فرقد سبخی کے بارے میں ان کے حافظے کے تعلق سے کلام کیا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1946] لا یدخل الجنۃ سئ الملکۃ
إسنادہ ضعیف / جہ 3691   باب ما جاء فی الإحسان إلی الخدم
فرقد ضعیف ( تقدم : 962) `;
tirmizi.anwaar = [238,1];