var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ،حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ،حَدَّثَنَا عَبْدُ الْمُنْعِمِ،هُوَ صَاحِبُ السِّقَائِ،قَالَ: حَدَّثَنَا يَحْيَى بْنُ مُسْلِمٍ،عَنْ الْحَسَنِ وَعَطَائٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللهِ أَنَّ رَسُولَ اللهِ ﷺ قَالَ لِبِلاَلٍ:يَا بِلاَلُ! إِذَا أَذَّنْتَ فَتَرَسَّلْ فِي أَذَانِكَ،وَإِذَا أَقَمْتَ فَاحْدُرْ،وَاجْعَلْ بَيْنَ أَذَانِكَ وَإِقَامَتِكَ قَدْرَ مَا يَفْرُغُ الآكِلُ مِنْ أَكْلِهِ،وَالشَّارِبُ مِنْ شُرْبِهِ،وَالْمُعْتَصِرُ إِذَا دَخَلَ لِقَضَائِ حَاجَتِهِ،وَلاَتَقُومُوا حَتَّى تَرَوْنِي۔";
tirmizi.urdu = "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ رسول اللہﷺ نے بلال رضی اللہ عنہ سے فرمایا: ' بلال! جب تم اذان دو تو ٹھہر ٹھہرکر دو اور جب اقامت کہوتوجلدی جلدی کہو،اور اپنی اذان واقامت کے درمیان اس قدر وقفہ رکھو کہ کھانے پینے والا اپنے کھانے پینے سے اور پاخانہ پیشاب کی حاجت محسوس کرنے والا اپنی حاجت سے فارغ ہوجائے اور اس وقت تک (اقامت کہنے کے لیے) کھڑے نہ ہو جب تک کہ مجھے نہ دیکھ لو۔";
tirmizi.hukam = "";
tirmizi.description = `[195۔196] یا بلال! إذا أذنت فترسل
إسنادہ ضعیف جدًا    باب ما جاء فی الترسل فی الأذان
عبد المنعم : متروک ( تق: 4234) وشیخہ یحیی بن مسلم البکاء : ضعیف (تق: 7645) وللحدیث شواہد ضعیفۃ عند الحاکم (204/1) وغیرہ۔`;
tirmizi.anwaar = [195,1];