var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ سُفْيَانَ عَنْ أَبِي هَارُونَ الْعَبْدِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ضَرَبَ أَحَدُكُمْ خَادِمَهُ فَذَكَرَ اللَّهَ فَارْفَعُوا أَيْدِيَكُمْ قَالَ أَبُو عِيسَى وَأَبُو هَارُونَ الْعَبْدِيُّ اسْمُهُ عُمَارَةُ بْنُ جُوَيْنٍ قَالَ قَالَ أَبُو بَكْرٍ الْعَطَّارُ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ قَالَ يَحْيَى بْنُ سَعِيدٍ ضَعَّفَ شُعْبَةُ أَبَا هَارُونَ الْعَبْدِيَّ قَالَ يَحْيَى وَمَا زَالَ ابْنُ عَوْنٍ يَرْوِي عَنْ أَبِي هُرَيْرَةَ حَتَّى مَاتَ";
tirmizi.urdu = "ابوسعیدخدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' جب تم میں سے کوئی اپنے خادم کو مارے اوروہ (خادم) اللہ کانام لے لے توتم اپنے ہاتھوں کو روک لو'۔امام ترمذی کہتے ہیں:راوی ابوہارون عبدی کا نام عمارہ بن جوین ہے،ابوبکر عطارنے یحییٰ بن سعید کا یہ قول نقل کیا کہ شعبہ نے ابوہارون عبدی کی تضعیف کی ہے،یحییٰ کہتے ہیں: ابن عون ہمیشہ ابوہارون سے روایت کرتے رہے یہاں تک کہ ان کی وفات ہوگئی۔";
tirmizi.hukam = "";
tirmizi.description = `[1950] إذا ضرب أحدکم خادمہ فذکر اللّٰہ
إسنادہ ضعیف جدًا    باب ما جاء في أدب الخادم
أبو ہارون العبدي : متروک ومنھم من کذبہ،شیعي ( تق: 4840) `;
tirmizi.anwaar = [238,1];