var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى عَنْ نَاصِحٍ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ يُؤَدِّبَ الرَّجُلُ وَلَدَهُ خَيْرٌ مِنْ أَنْ يَتَصَدَّقَ بِصَاعٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَنَاصِحٌ هُوَ أَبُو الْعَلَاءِ كُوفِيٌّ لَيْسَ عِنْدَ أَهْلِ الْحَدِيثِ بِالْقَوِيِّ وَلَا يُعْرَفُ هَذَا الْحَدِيثُ إِلَّا مِنْ هَذَا الْوَجْهِ وَنَاصِحٌ شَيْخٌ آخَرُ بَصْرِيٌّ يَرْوِي عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ وَغَيْرِهِ هُوَ أَثْبَتُ مِنْ هَذَا";
tirmizi.urdu = "جابربن سمرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' اپنے لڑکے کو ادب سکھانا ایک صاع صدقہ دینے سے بہترہے'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-راوی ناصح کی کنیت ابوالعلاہے،اور یہ کوفہ کے رہنے والے ہیں،محدثین کے نزدیک قوی نہیں ہیں،یہ حدیث صرف اسی سند سے معروف ہے،۳-ناصح ایک دوسرے شیخ بھی ہیں جو بصرہ کے رہنے والے ہیں،عماربن ابوعماروغیرہ سے حدیث روایت کرتے ہیں،اور یہ ان سے زیادہ قوی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1951] لأن یؤدب الرجل ولدہ خیر
إسنادہ ضعیف باب ما جاء في أدب الولد
ناصح الحائک : ضعیف ( تق: 7067) `;
tirmizi.anwaar = [238,1];