var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا عَامِرُ بْنُ أَبِي عَامِرٍ الْخَزَّازُ حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا نَحَلَ وَالِدٌ وَلَدًا مِنْ نَحْلٍ أَفْضَلَ مِنْ أَدَبٍ حَسَنٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَامِرِ بْنِ أَبِي عَامِرٍ الْخَزَّازِ وَهُوَ عَامِرُ بْنُ صَالِحِ بْنِ رُسْتُمَ الْخَزَّازُ وَأَيُّوبُ بْنُ مُوسَى هُوَ ابْنُ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِي وَهَذَا عِنْدِي حَدِيثٌ مُرْسَلٌ";
tirmizi.urdu = "عمروبن سعید بن عاص کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' حسن ادب سے بہترکسی با پ نے اپنے بیٹے کو تحفہ نہیں دیا'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،ہم اسے صرف عامربن ابوعامر خزازکی روایت سے جانتے ہیں،اورعامر صالح بن رستم خزاز کے بیٹے ہیں،۲-راوی ایوب بن موسیٰ سے مراد ایوب بن موسیٰ بن عمروبن سعید بن عاص ہیں،۳-یہ حدیث میرے نزدیک مرسل ہے ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[1952] ما نحل والد ولدًا
إسنادہ ضعیف باب ما جاء في أدب الولد
موسی بن عمرو بن سعید أبو أیوب مستور ( تق: 6995) `;
tirmizi.anwaar = [238,1];