var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ،حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ،عَنْ عَبْدِ الْمُنْعِمِ نَحْوَهُ.\nقَالَ أَبُو عِيسَى: حَدِيثُ جَابِرٍ هَذَا حَدِيثٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ هَذَا الْوَجْهِ،مِنْ حَدِيثِ عَبْدِالْمُنْعِمِ،وَهُوَ إِسْنَادٌ مَجْهُولٌ. وَعَبْدُ الْمُنْعِمِ شَيْخٌ بَصْرِيٌّ.";
tirmizi.urdu = "اس سند سے بھی عبدالمنعم سے اسی طرح کی حدیث مروی ہے۔\nامام ترمذی کہتے ہیں: جابر رضی اللہ عنہ کی حدیث کو ہم صرف اسی سند سے یعنی عبدالمنعم ہی کی روایت سے جانتے ہیں،اور یہ مجہول سند ہے،عبدالمنعم بصرہ کے شیخ ہیں۔(یعنی ضعیف راوی ہیں)";
tirmizi.hukam = "";
tirmizi.description = `۔196] یا بلال! إذا أذنت فترسل
إسنادہ ضعیف جدًا    باب ما جاء فی الترسل فی الأذان
عبد المنعم : متروک ( تق: 4234) وشیخہ یحیی بن مسلم البکاء : ضعیف (تق: 7645) وللحدیث شواہد ضعیفۃ عند الحاکم (204/1) وغیرہ۔`;
tirmizi.anwaar = [195,1];