var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى قَالَ قُلْتُ لِعَبْدِ الرَّحِيمِ بْنِ هَارُونَ الْغَسَّانِيِّ حَدَّثَكُمْ عَبْدُ الْعَزِيزِ بْنُ أَبِي رَوَّادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَذَبَ الْعَبْدُ تَبَاعَدَ عَنْهُ الْمَلَكُ مِيلًا مِنْ نَتْنِ مَا جَاءَ بِهِ قَالَ يَحْيَى فَأَقَرَّ بِهِ عَبْدُ الرَّحِيمِ بْنُ هَارُونَ فَقَالَ نَعَمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ جَيِّدٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ تَفَرَّدَ بِهِ عَبْدُ الرَّحِيمِ بْنُ هَارُونَ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' جب بندہ جھوٹ بولتاہے تو اس جھوٹ کی بدبوکی وجہ سے فرشتہ اس سے ایک میل دوربھاگتاہے'۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن جیدغریب ہے ۲-یحیی بن موسی کہتے ہیں: میں نے عبدالرحیم بن ہارون سے پوچھا:کیا آپ سے عبدالعزیزبن ابی داود نے یہ حدیث بیان کی؟ کہا: ہاں،۳-ہم اسے صرف اسی طریق سے جانتے ہیں،اس کی روایت کرنے میں عبدالرحیم بن ہارون منفرد ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1972] إذا کذب العبد تباعد عنہ الملک
إسنادہ ضعیف جدًا    باب ما جاء فی الصدق والکذب
عبد الرحیم بن ہارون : ضعیف،کذبہ الدار قطني ( تق: 4060) `;
tirmizi.anwaar = [239,1];