var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ أَيُّوبَ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْ مَا كَانَ خُلُقٌ أَبْغَضَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْكَذِبِ وَلَقَدْ كَانَ الرَّجُلُ يُحَدِّثُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْكِذْبَةِ فَمَا يَزَالُ فِي نَفْسِهِ حَتَّى يَعْلَمَ أَنَّهُ قَدْ أَحْدَثَ مِنْهَا تَوْبَةً قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں: رسول اللہ ﷺ کے نزدیک جھوٹ سے بڑھ کر کوئی اور عادت نفرت کے قابل ناپسندیدہ نہیں تھی،اور جب کوئی آدمی نبی اکرم ﷺ کے پاس جھوٹ بولتا تو وہ ہمیشہ آپ کی نظرمیں قابل نفرت رہتا یہاں تک کہ آپ جان لیتے کہ اس نے جھوٹ سے توبہ کرلی ہے،امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1973] ولقد کان الرجل یحدث عند النبي ﷺ بالکذبۃ
إسنادہ ضعیف باب ما جاء فی الصدق والکذب
أیوب السختیاني رواہ عن ابن أبي ملیکۃ أو غیرہ عن عائشۃ فالسند معلول ولہ شاہد منقطع عند الحاکم (98/4 ح 7044 ) و شواھد أخری ضعیفۃ۔انظر الموسوعۃ الحدیثیۃ ( 42/ 101۔102) و أخطأ أصحابہا فصححوا الحدیث۔!!`;
tirmizi.anwaar = [239,1];