var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَلَاعَنُوا بِلَعْنَةِ اللَّهِ وَلَا بِغَضَبِهِ وَلَا بِالنَّارِ قَالَ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَابْنِ عُمَرَ وَعِمْرَانَ بْنِ حُصَيْنٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "سمرہ بن جندب رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' تم لوگ (کسی پر) اللہ کی لعنت نہ بھیجو،نہ اس کے غضب کی لعنت بھیجواورنہ جہنم کی لعنت بھیجو ' ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن عباس،ابوہریرہ،ابن عمراورعمران بن حصین رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1976] لا تلاعنوا بلعنۃ اللّٰہ
إسنادہ ضعیف / د 4906    باب ما جاء فی اللعنۃ`;
tirmizi.anwaar = [239,1];