var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ الطَّائِيُّ الْبَصْرِيُّ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ عَنْ قَتَادَةَ عَنْ أَبِي الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَجُلًا لَعَنَ الرِّيحَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا تَلْعَنْ الرِّيحَ فَإِنَّهَا مَأْمُورَةٌ وَإِنَّهُ مَنْ لَعَنَ شَيْئًا لَيْسَ لَهُ بِأَهْلٍ رَجَعَتْ اللَّعْنَةُ عَلَيْهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْلَمُ أَحَدًا أَسْنَدَهُ غَيْرَ بِشْرِ بْنِ عُمَرَ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم ﷺ کے سامنے ایک آدمی نے ہواپرلعنت بھیجی تو آپ نے فرمایا:' ہواپر لعنت نہ بھیجواس لیے کہ وہ تو (اللہ کے) حکم کی پابندہے،اورجس شخص نے کسی ایسی چیز پر لعنت بھیجی جو لعنت کی مستحق نہیں ہے تو لعنت اسی پر لوٹ آتی ہے'۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-بشر بن عمرکے علاوہ ہم کسی کو نہیں جانتے جس نے اسے مرفوعابیان کیاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1978] لا تلعن الریح فإنھا مأمورۃ
إسنادہ ضعیف/ د 4908 باب ما جاء فی اللعنۃ`;
tirmizi.anwaar = [239,1];