var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا قَبِيصَةُ عَنْ سُفْيَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادِ بْنِ أَنْعُمٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا دَعْوَةٌ أَسْرَعَ إِجَابَةً مِنْ دَعْوَةِ غَائِبٍ لِغَائِبٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَالْأَفْرِيقِيُّ يُضَعَّفُ فِي الْحَدِيثِ وَهُوَ عَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعُمٍ وَعَبْدُ اللَّهِ بْنُ يَزِيدَ هُوَ أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ";
tirmizi.urdu = "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' کوئی دعا اتنی جلدقبول نہیں ہوتی ہے جتنی جلدغائب آدمی کے حق میں غائب آدمی کی دعاقبول ہوتی ہے ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں،۲-راوی افریقی حدیث کے سلسلے میں ضعیف قراردیئے گئے ہیں،ان کا نام عبدالرحمٰن بن زیاد بن انعم ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[1980] ما دعوۃ أسرع إجابۃ من دعوۃ غائب
إسنادہ ضعیف / د 1535    باب ما جاء في دعوۃ الأخ لأخیہ بظہر الغیب`;
tirmizi.anwaar = [239,1];