var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ الْبَغْدَادِيُّ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالُوا يَا رَسُولَ اللَّهِ إِنَّكَ تُدَاعِبُنَا قَالَ إِنِّي لَا أَقُولُ إِلَّا حَقًّا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ لوگوں نے عرض کیا: اللہ کے رسول! آپ ہم سے ہنسی مذاق کرتے ہیں؟ آپ نے فرمایا:'میں(خوش طبعی اورمزاح میں بھی) حق کے سوا کچھ نہیں کہتا ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 4885`;