var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ شَرِيكٍ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ يَا ذَا الْأُذُنَيْنِ قَالَ مَحْمُودٌ قَالَ أَبُو أُسَامَةَ يَعْنِي مَازَحَهُ وَهَذَا الْحَدِيثُ حَدِيثٌ صَحِيحٌ غَرِيبٌ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے ان کو مخاطب کرتے ہوے فرمایا:' اے دوکان والے! 'محمود بن غیلان کہتے ہیں: ابواسامہ نے کہا،یعنی آپ ﷺ نے اس سے مزاح کیا۔\nامام ترمذی کہتے ہیں: یہ حدیث صحیح غریب ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;