var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ الْبَغْدَادِيُّ حَدَّثَنَا الْمُحَارِبِيُّ عَنْ اللَّيْثِ وَهُوَ ابْنُ أَبِي سُلَيْمٍ عَنْ عَبْدِ الْمَلِكِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُمَارِ أَخَاكَ وَلَا تُمَازِحْهُ وَلَا تَعِدْهُ مَوْعِدَةً فَتُخْلِفَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَعَبْدُ الْمَلِكِ عِنْدِي هُوَ ابْنُ بَشِيرٍ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' اپنے بھائی سے مت جھگڑو،نہ اس سے ہنسی مذاق کرو،اور نہ اس سے کوئی ایساوعدہ کروجس کی تم خلاف ورزی کرو'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[1995] لا تمار أخاک ولا تمازحہ
إسنادہ ضعیف باب ما جاء فی المراء
لیث بن أبي سلیم : ضعیف ( تقدم : 218 )`;
tirmizi.anwaar = [240,1];