var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ مُعَاوِيَةَ بْنِ يَحْيَى الصَّدَفِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُؤَذِّنُ إِلَّا مُتَوَضِّئٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:' اذان وہی دے جو باوضو ہو' ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[200] لا یؤذن إلامتوضئ
إسنادہ ضعیف باب ما جاء في کراھیۃ الأذان بغیر وضوء
قال البیہقي فی السنن الکبری (397/1) : ’’ ھکذا رواہ معاویۃ بن یحیی الصدفي وھو ضعیف‘‘ و قال الھیثمي : و أحادیثہ عن الزھري مستقیمۃ کما قال البخاري و ھذا منھا وضعفہ الجمھور ( مجمع الزوائد 2/ 84 ) 
قلت: انظر الکامل لابن عدي ( 2395/6،والنسخۃ الأخری 138/8،فیہ الجنیدي وھو محمد بن عبد اللّٰہ بن الجنید : ذکرہ ابن حبان فی الثقات 155/9۔156) یعني فیما روی عنہ ھقل بن زیاد،انظر التاریخ الکبیر للبخاري ( 336/7) و الضعفاء الکبیر للعقیلي ( 182/4۔183) و في قول البخاري نظر۔`;
tirmizi.anwaar = [195,1];