var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عُمَرَ بْنِ رَاشِدٍ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ الرَّجُلُ يَذْهَبُ بِنَفْسِهِ حَتَّى يُكْتَبَ فِي الْجَبَّارِينَ فَيُصِيبُهُ مَا أَصَابَهُمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "سلمہ بن الاکوع رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' انسان ہمیشہ اپنے آپ کو تکبر(گھمنڈ)کی طرف لے جاتاہے،یہاں تک کہ ظالموں کی فہرست میں اس کا نام لکھ دیاجاتاہے،اور اس لیے اسے وہی عذاب لاحق ہوتا ہے جوظالموں کو لا حق ہوا'۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2000] لا یزال الرجل یذھب بنفسہ
إسنادہ ضعیف باب ماجاء فی الکبر
عمر بن راشد الیمامي : ضعیف ( تق: 4894) وقال العراقی: ضعفہ الجمھور (تخریج الإحیاء 370/1) 
وقال الھیثمی: وضعفہ الجمھور ( مجمع الزوائد 46/10 )`;
tirmizi.anwaar = [240,1];