var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ الْمَدَنِيُّ حَدَّثَنَا عَبْدُ الْمُهَيْمِنِ بْنُ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَنَاةُ مِنْ اللَّهِ وَالْعَجَلَةُ مِنْ الشَّيْطَانِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْحَدِيثِ فِي عَبْدِ الْمُهَيْمِنِ بْنِ عَبَّاسِ بْنِ سَهْلٍ وَضَعَّفَهُ مِنْ قِبَلِ حِفْظِهِ وَالْأَشَجُّ بْنُ عَبْدِ الْقَيْسِ اسْمُهُ الْمُنْذِرُ بْنُ عَائِذٍ";
tirmizi.urdu = "سہل بن سعدساعدی رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' سوچ سمجھ کر کام کرنا اور جلدبازی نہ کرنا اللہ کی طرف سے ہے اورجلدبازی شیطان کی طرف سے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-بعض محدثین نے عبدالمہیمن بن عباس بن سہل کے بارے میں کلام کیاہے،اور حافظے کے تعلق سے انہیں ضعیف کہا ہے،۳-اشج بن عبدالقیس کا نام منذربن عائذہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2012] الأناۃ من اللّٰہ والعجلۃ من الشیطان
إسنادہ ضعیف باب ما جاء فی التأني والعجلۃ
عبد المہیمن : ضعیف ( تق: 4235) و قال البوصیري : ضعفہ الجمھور ( زوائد ابن ماجہ : 547 )`;
tirmizi.anwaar = [240,1];