var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ شَرِّ النَّاسِ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ ذَا الْوَجْهَيْنِ قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أَنَسٍ وَعَمَّارٍ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' قیامت کے دن اللہ کی نظرمیں دورخے شخص سے بدتر کوئی نہیں ہوگا ' ۱؎۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں انس اورعمار رضی اللہ عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ — صحیح بخاری و صحیح مسلم";
tirmizi.description = ``;