var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا بَكْرُ بْنُ يُونُسَ بْنِ بُكَيْرٍ عَنْ مُوسَى بْنِ عَلِيٍّ عَنْ أَبِيهِ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُكْرِهُوا مَرْضَاكُمْ عَلَى الطَّعَامِ فَإِنَّ اللَّهَ يُطْعِمُهُمْ وَيَسْقِيهِمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "عقبہ بن عامر جہنی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' تم اپنے بیماروں کو کھانے پر مجبور نہ کرو،اس لیے کہ اللہ تعالیٰ انہیں کھلاتا پلاتاہے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2040] لاتکرھوا مرضاکم علی الطعام
إسنادہ ضعیف / جہ 3444   باب ما جاء لا تکرھوا مرضاکم إلخ
بکر بن یونس بن بکیر ضعیف ( تق : 754 ) ضعفہ الجمہور ولحدیثہ شواھد ضعیفۃ عندالحاکم ( 4/ 410) وغیرہ۔`;
tirmizi.anwaar = [241,1];