var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَدُّوَيْهِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حَمَّادٍ الشُّعَيْثِيُّ حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ خَيْرَ مَا تَدَاوَيْتُمْ بِهِ السَّعُوطُ وَاللَّدُودُ وَالْحِجَامَةُ وَالْمَشِيُّ فَلَمَّا اشْتَكَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَدَّهُ أَصْحَابُهُ فَلَمَّا فَرَغُوا قَالَ لُدُّوهُمْ قَالَ فَلُدُّوا كُلُّهُمْ غَيْرَ الْعَبَّاسِ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' جس چیز سے علاج کرتے ہواس میں سب سے بہترسعوط (ناک میں ڈالنے والی دوا)،لدود،(منہ کے ایک کنارہ سے ڈالی جانے والی دوا)،حجامت (پچھنالگانا) اور دست آور دوا ہے،جب رسول اللہﷺ بیمارہوے توصحابہ نے آپ کے منہ کے ایک کنارہ میں دواڈالی،جب وہ دواڈال چکے توآپ نے فرمایا:'موجودلوگوں کے بھی منہ میں دوا ڈالو،ابن عباس کہتے ہیں: عباس کے علاوہ تمام لوگوں کے منہ میں دواڈالی گئی '۔";
tirmizi.hukam = "";
tirmizi.description = `[2047۔2048] إن خیر ما تداویتم بہ السعوط
إسنادہ ضعیف باب ما جاء فی السعوط وغیرہ
عباد بن منصور : ضعیف ( تقدم : 662 ) ولبعض الحدیث شواہد عند البخاري (5712) وغیرہ۔`;
tirmizi.anwaar = [241,1];