var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ خَيْرَ مَا تَدَاوَيْتُمْ بِهِ اللَّدُودُ وَالسَّعُوطُ وَالْحِجَامَةُ وَالْمَشِيُّ وَخَيْرُ مَا اكْتَحَلْتُمْ بِهِ الْإِثْمِدُ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعْرَ وَكَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُكْحُلَةٌ يَكْتَحِلُ بِهَا عِنْدَ النَّوْمِ ثَلَاثًا فِي كُلِّ عَيْنٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَهُوَ حَدِيثُ عَبَّادِ بْنِ مَنْصُورٍ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' جس چیز سے تم علاج کرتے ہوان میں سب سے بہترمنہ کے ایک کنارہ سے ڈالی جانے والی دوا،ناک میں ڈالنے کی دوا،پچھنا اوردست آوردواہے اورتمہارا اپنی آنکھوں میں لگانے کا سب سے بہترسرمہ اثمدہے،اس لیے کہ وہ بینائی (نظر) کو بڑھاتاہے اوربال اگاتا ہے'۔\nرسول اللہﷺ کے پاس ایک سرمہ دانی تھی جس سے سوتے وقت ہرآنکھ میں تین سلائی لگاتے تھے۔\nامام ترمذی کہتے ہیں: عباد بن منصورکی یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔2048] إن خیر ما تداویتم بہ السعوط
إسنادہ ضعیف باب ما جاء فی السعوط وغیرہ
عباد بن منصور : ضعیف ( تقدم : 662 ) ولبعض الحدیث شواہد عند البخاري (5712) وغیرہ۔`;
tirmizi.anwaar = [241,1];