var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَوَى أَسْعَدَ بْنَ زُرَارَةَ مِنْ الشَّوْكَةِ قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أُبَيٍّ وَجَابِرٍ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "انس رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے اسعدبن زرارہ کے بدن کو سرخ پھنسی کی بیماری میں داغا ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-اس باب میں ابی اورجابر رضی اللہ عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 4534`;