var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ حَدَّثَنَا هَمَّامٌ وَجَرِيرُ بْنُ حَازِمٍ قَالَا حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْتَجِمُ فِي الْأَخْدَعَيْنِ وَالْكَاهِلِ وَكَانَ يَحْتَجِمُ لِسَبْعَ عَشْرَةَ وَتِسْعَ عَشْرَةَ وَإِحْدَى وَعِشْرِينَ قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَمَعْقِلِ بْنِ يَسَارٍ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں: رسول اللہﷺ گردن کی دونوں جانب موجود دوپوشیدہ رگوں اورکندھے پر پچھنا لگواتے تھے،اور آپ مہینہ کی سترہویں،انیسویں اوراکیسویں تاریخ کو پچھنالگواتے تھے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-اس باب میں ابن عباس اورمعقل بن یسار رضی اللہ عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2051] کان یحتجم فی الأخدعین
إسنادہ ضعیف / د 3860،جہ 3483   باب ما جاء فی الحجامۃ`;
tirmizi.anwaar = [241,1];