var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ بُدَيْلِ بْنِ قُرَيْشٍ الْيَامِّيُّ الْكُوفِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ قَالَ حَدَّثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لَيْلَةِ أُسْرِيَ بِهِ أَنَّهُ لَمْ يَمُرَّ عَلَى مَلَإٍ مِنْ الْمَلَائِكَةِ إِلَّا أَمَرُوهُ أَنْ مُرْ أُمَّتَكَ بِالْحِجَامَةِ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ ابْنِ مَسْعُودٍ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں: رسول اللہﷺ نے معراج کی رات کا حال بیان کیا کہ آپ فرشتوں کی جس جماعت کے پاس سے گزرے انہوں نے آپ کو یہ حکم ضرور دیاکہ اپنی امت کو پچھنالگوانے کا حکم دیں۔\nامام ترمذی کہتے ہیں: یہ حدیث ابن مسعودکی روایت سے حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2052] حدث رسول اللّٰہ ﷺ عن لیلۃ
إسنادہ ضعیف باب ما جاء فی الحجامۃ
عبد الرحمن بن إسحاق الکوفي الواسطي : ضعیف ( تقدم : 741 ) وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [241,1];