var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ حُصَيْنٍ عَنْ الشَّعْبِيِّ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ قَالَ أَبُو عِيسَى وَرَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ حُصَيْنٍ عَنْ الشَّعْبِيِّ عَنْ بُرَيْدَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ";
tirmizi.urdu = "عمران بن حصین رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا:' جھاڑ پھونک صرف نظربداورپسلی میں نکلنے والے دانے کی وجہ سے ہی جائزہے' ۱؎۔امام ترمذی کہتے ہیں: شعبہ نے یہ حدیث 'عن حصین عن الشعبی عن بریدۃ عن النبی ﷺ' کی سند سے اسی کے مثل روایت کی ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 4557`;