var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هِشَامُ بْنُ يُونُسَ الْكُوفِيُّ حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ الْمُزَنِيُّ عَنْ الْجَرِيرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ الْجَانِّ وَعَيْنِ الْإِنْسَانِ حَتَّى نَزَلَتْ الْمُعَوِّذَتَانِ فَلَمَّا نَزَلَتَا أَخَذَ بِهِمَا وَتَرَكَ مَا سِوَاهُمَا قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أَنَسٍ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "ابوسعیدخدری رضی اللہ عنہ کہتے ہیں: رسول اللہﷺ جنوں اورانسان کی نظربدسے پناہ مانگاکرتے تھے،یہاں تک کہ معوذتین (سورۃ الفلق اورسورۃ الناس)نازل ہوئیں،جب یہ سورتیں اترگئیں تو آ پ نے ان دونوں کو لے لیا اور ان کے علاوہ کو چھوڑدیا ۱؎۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-اس باب میں انس سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2058] کان یتعوذ من الجان
إسنادہ ضعیف / ن 5496،جہ 3511   باب ما جاء فی الرقیۃ بالمعوذتین
الجریري اختلط ( د 1555) و لم أجد راویًا عنہ في ھذا الحدیث قبل اختلاطہ۔`;
tirmizi.anwaar = [242,1];