var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ،عَنْ عَبْدِ المَلِكِ بْنِ عُمَيْرٍ،ح وَحَدَّثَنَا مُحَمَّدُ بْنُ المُثَنَّى قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ عَبْدِ المَلِكِ بْنِ عُمَيْرٍ،عَنْ عَمْرِو بْنِ حُرَيْثٍ،عَنْ سَعِيدِ بْنِ زَيْدٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الكَمْأَةُ مِنَ المَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ»: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "سعیدبن زید رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺنے فرمایا:' صحرائے عرب کا فقعہ ایک طرح کا من (سلوی والا من) ہے اور اس کا عرق آنکھ کے لیے شفاء ہے'۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;