var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُعَاذٌ قَالَ: حَدَّثَنَا أَبِي،عَنْ قَتَادَةَ،قَالَ: حُدِّثْتُ أَنَّ أَبَا هُرَيْرَةَ قَالَ: «أَخَذْتُ ثَلَاثَةَ أَكْمُؤٍ أَوْ خَمْسًا أَوْ سَبْعًا [ص:402] فَعَصَرْتُهُنَّ فَجَعَلْتُ مَاءَهُنَّ فِي قَارُورَةٍ فَكَحَلْتُ بِهِ جَارِيَةً لِي فَبَرَأَتْ»";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں: میں نے تین،پانچ یا سات کھنبی لی،ان کو نچوڑ ا،پھر اس کا عرق ایک شیشی میں رکھا اور اسے ایک لڑکی کی آنکھ میں ڈالا تو وہ صحت یاب ہوگئی۔";
tirmizi.hukam = "";
tirmizi.description = `[2069] أخذت ثلاثۃ أکمؤ أوخمسًا
إسنادہ ضعیف /السند منقطع    باب ما جاء فی الکمأۃ والعجوۃ`;
tirmizi.anwaar = [242,1];