var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا اللَّيْثُ،عَنْ ابْنِ شِهَابٍ،عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ،عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ قَالَ: «نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الكَلْبِ،وَمَهْرِ البَغِيِّ،وَحُلْوَانِ الكَاهِنِ»: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابومسعودانصاری رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے کتے کی قیمت،زانیہ عورت کی کمائی اورکاہن کے نذرانے لینے سے منع فرمایا ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;