var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ قَالَ: حَدَّثَنَا أَبُو الأَحْوَصِ،عَنْ سَعِيدِ بْنِ مَسْرُوقٍ،عَنْ عَبَايَةَ بْنِ رِفَاعَةَ،عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الحُمَّى فَوْرٌ مِنَ النَّارِ فَأَبْرِدُوهَا بِالمَاءِ»: وَفِي البَابِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ،وَابْنِ عُمَرَ،وَامْرَأَةِ الزُّبَيْرِ،وَعَائِشَةَ،وَابْنِ عَبَّاسٍ";
tirmizi.urdu = "رافع بن خدیج رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' بخارجہنم کی گرمی سے ہوتاہے،لہذا اسے پانی سے ٹھنڈاکرو'۔امام ترمذی کہتے ہیں: اس باب میں اسماء بنت ابوبکر،ابن عمر،زبیرکی بیوی،ام المومنین عائشہ اورابن عباس رضی اللہ عنہم سے بھی احادیث آئی ہیں۔(عائشہ رضی اللہ عنہا کی روایت آگے آرہی ہے)";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;