var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ: حَدَّثَنِي أَبِي،عَنْ قَتَادَةَ،عَنْ أَبِي عَبْدِ اللَّهِ،عَنْ زَيْدِ بْنِ أَرْقَمَ،«أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْعَتُ الزَّيْتَ وَالوَرْسَ مِنْ ذَاتِ الجَنْبِ» قَالَ قَتَادَةُ: وَيُلَدُّ مِنَ الْجَانِبِ الَّذِي يَشْتَكِيهِ،: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو عَبْدِ اللَّهِ اسْمُهُ مَيْمُونٌ هُوَ شَيْخٌ بَصْرِيٌّ";
tirmizi.urdu = "زیدبن ارقم رضی اللہ عنہ کہتے ہیں: نبی اکرمﷺ ذات الجنب ۱؎ کی بیماری میں زیتون کا تیل اور ورس ۲؎ تشخیص کرتے تھے،قتادہ کہتے ہیں: اس کو منہ میں ڈالاجائے گا،اورمنہ کی اس جانب سے ڈالا جائے گا جس جانب مرض ہو۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-ابوعبداللہ کا نام میمون ہے،وہ ایک بصری شیخ ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2078] کان ینعت الزیت والورس
إسنادہ ضعیف / جہ 3467   باب ما جاء في دواء ذات الجنب
میمون أبو عبد اللّٰہ :ضعیف ( تق: 7051) `;
tirmizi.anwaar = [242,1];