var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا رَجَاءُ بْنُ مُحَمَّدٍ العُذْرِيُّ البَصْرِيُّ قَالَ: حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدِ بْنِ أَبِي رَزِينٍ قَالَ: حَدَّثَنَا شُعْبَةُ،عَنْ خَالِدٍ الحَذَّاءِ قَالَ: حَدَّثَنَا مَيْمُونٌ أَبُو عَبْدِ اللَّهِ،قَالَ: سَمِعْتُ زَيْدَ بْنَ أَرْقَمَ قَالَ: «أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَدَاوَى مِنْ ذَاتِ الجَنْبِ بِالقُسْطِ البَحْرِيِّ وَالزَّيْتِ»: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مَيْمُونٍ عَنْ زَيْدِ بْنِ أَرْقَمَ وَقَدْ رَوَى عَنْ مَيْمُونٍ غَيْرُ وَاحِدٍ هَذَا الحَدِيثَ وَذَاتُ الجَنْبِ: يَعْنِي السِّلَّ";
tirmizi.urdu = "زیدبن ارقم رضی اللہ عنہ کہتے ہیں:رسول اللہﷺ نے ہمیں حکم دیا کہ ذات الجنب کا علاج قسط بحری (عودہندی) اور زیتون کے تیل سے کریں۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب صحیح ہے،۲-ہم اسے صرف میمون کی روایت سے جانتے ہیں جسے وہ زیدبن ارقم سے روایت کرتے ہیں،۳-میمون سے کئی لوگوں نے یہ حدیث روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2079] أمرنا رسول اللّٰہ ﷺ أن نتداوی
إسنادہ ضعیف /انظر الحدیث السابق :2078   باب ما جاء في دواء ذات الجنب`;
tirmizi.anwaar = [242,1];