var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،قَالَ: أَخْبَرَنَا الوَلِيدُ بْنُ مُحَمَّدٍ المُوقَرِيُّ،عَنْ الزُّهْرِيِّ،عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا مَثَلُ المَرِيضِ إِذَا بَرَأَ وَصَحَّ كَالبَرْدَةِ تَقَعُ مِنَ السَّمَاءِ فِي صَفَائِهَا وَلَوْنِهَا»";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' جب مریض صحت یاب اورتندرست ہوجائے تو شفافیت اوررنگ میں اس کی مثال اس اولے کی طرح ہے جو آسمان سے گرتاہے'۔";
tirmizi.hukam = "";
tirmizi.description = `[2086] إنما مثل المریض إذا برأ
إسنادہ ضعیف جدًا    باب التداوي بالرماد
الولید بن محمد : متروک ( تق: 7453) `;
tirmizi.anwaar = [243,1];