var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الأَشَجُّ قَالَ: حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ السَّكُّونِيُّ،عَنْ مُوسَى بْنِ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ،عَنْ أَبِيهِ،عَنْ أَبِي سَعِيدٍ الخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دَخَلْتُمْ عَلَى المَرِيضِ فَنَفِّسُوا لَهُ فِي أَجَلِهِ فَإِنَّ ذَلِكَ لَا يَرُدُّ شَيْئًا وَيُطَيِّبُ نَفْسَهُ»: هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "-ابوسعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' جب تم مریض کے پاس جاؤ تو موت کے سلسلے میں اس کا غم دورکرو ۱؎ یہ تقدیر تونہیں بدلتاہے لیکن مریض کا دل خوش کردیتاہے'۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2087] إذا دخلتم علی المریض فنفسوا لہ
إسنادہ ضعیف / جہ 1438   باب [تطیب نفس المریض ]
موسی بن محمد : منکر الحدیث (تقدم : 1823) `;
tirmizi.anwaar = [243,1];