var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ،قَالَ: أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ سُفْيَانَ الثَّوْرِيِّ،عَنْ هِشَامِ بْنِ حَسَّانَ،عَنْ الحَسَنِ قَالَ: «كَانُوا يَرْتَجُونَ الحُمَّى لَيْلَةً كَفَّارَةً لِمَا نَقَصَ مِنَ الذُّنُوبِ»";
tirmizi.urdu = "حسن بصری کہتے ہیں: ایک رات صحابہ یہ امیدظاہر کررہے تھے کہ بخارچھوٹے گناہوں کے لیے کفارہ ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2089] کانوا یرتجون الحمی لیلۃ کفارۃ
إسنادہ ضعیف باب [تطیب نفس المریض ]
سفیان الثوري وشیخہ ھشام بن حسان مدلسان و عنعنا ( تقدما : 746،460 ) `;
tirmizi.anwaar = [243,1];