var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ وَاصِلٍ قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ القَاسِمِ الأَسَدِيُّ قَالَ: حَدَّثَنَا الفَضْلُ بْنُ دَلْهَمٍ قَالَ: حَدَّثَنَا عَوْفٌ،عَنْ شَهْرِ بْنِ حَوْشَبٍ،[ص:414] عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَعَلَّمُوا القُرْآنَ وَالفَرَائِضَ وَعَلِّمُوا النَّاسَ فَإِنِّي مَقْبُوضٌ»: هَذَا حَدِيثٌ فِيهِ اضْطِرَابٌ،وَرَوَى أَبُو أُسَامَةَ هَذَا الحَدِيثَ،عَنْ عَوْفٍ،عَنْ رَجُلٍ،عَنْ سُلَيْمَانَ بْنِ جَابِرٍ،عَنْ ابْنِ مَسْعُودٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،حَدَّثَنَا بِذَلِكَ الحُسَيْنُ بْنُ حُرَيْثٍ قَالَ: أَخْبَرَنَا أَبُو أُسَامَةَ،عَنْ عَوْفٍ بِهَذَا نَحْوِهِ بِمَعْنَاهُ،وَمُحَمَّدُ بْنُ القَاسِمِ الأَسَدِيُّ قَدْ ضَعَّفَهُ أَحْمَدُ بْنُ حَنْبَلٍ وَغَيْرُهُ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' قرآن اورعلم فرائض سیکھواور لوگوں کو سکھاؤ اس لیے کہ میں وفات پانے والاہوں'۔امام ترمذی کہتے ہیں: اس حدیث میں اضطراب ہے۔ابواسامہ نے یہ حدیث 'عن عوف،عن رجل عن سلیمان بن جابر،عن ابن مسعود،عن النبی ﷺ' کی سند سے روایت کی ہے۔اوراسی معنی کی حدیث روایت کی ہے۔\nمحمد بن قاسم اسدی کو احمد بن حنبل وغیرہ نے ضعیف کہاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2091] تعلموا الفرائض والقرآن
ضعیف
باب ما جاء في تعلیم الفرائض
محمد بن القاسم : کذبوہ والفضل : ضعیف ( تقدما : 358 ) ولبعض الحدیث شواہد ضعیفۃ عند ابن ماجہ (2719) وغیرہ،وفی السند الآخر سلیمان بن جابر : مجہول (تق: 2541) وکذا تلمیذہ: مجہول۔`;
tirmizi.anwaar = [243,1];