var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ أَعْيَانَ بَنِي الْأُمِّ يَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْعِلْمِ فِي الْحَارِثِ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ عَامَّةِ أَهْلِ الْعِلْمِ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فیصلہ کیا:' حقیقی بھائی وارث ہوں گے نہ کہ علاتی بھائی '۔\nامام ترمذی کہتے ہیں: ۱-ہم اس حدیث کو صرف ابواسحاق کی روایت سے جانتے ہیں،ابواسحاق سبیعی روایت کرتے ہیں حارث سے اور حارث علی رضی اللہ عنہ سے،۲-بعض اہل علم نے حارث کے بارے میں کلام کیا ہے،۳-عام اہل علم کا اسی حدیث پرعمل ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔2095] إن رسول اللّٰہ ﷺ قضی بالدین
إسنادہ ضعیف/ جہ 2715    باب ما جاء في میراث الإخوۃ من الأب والأم
الحارث الأعور ضعیف ( تقدم : 282 ) ولمفھوم الحدیث شاھد حسن عند ابن ماجہ (2433) وھو یغني عنہ۔`;
tirmizi.anwaar = [243,1];