var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ هَمَّامِ بْنِ يَحْيَى عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ ابْنِي مَاتَ فَمَا لِي فِي مِيرَاثِهِ قَالَ لَكَ السُّدُسُ فَلَمَّا وَلَّى دَعَاهُ فَقَالَ لَكَ سُدُسٌ آخَرُ فَلَمَّا وَلَّى دَعَاهُ قَالَ إِنَّ السُّدُسَ الْآخَرَ طُعْمَةٌ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ مَعْقِلِ بْنِ يَسَارٍ";
tirmizi.urdu = "عمران بن حصین رضی اللہ عنہ کہتے ہیں: رسول اللہﷺ کے پاس ایک آدمی نے آکر عرض کیا: میرا پوتا مرگیا ہے،مجھے اس کی میراث میں سے کتنا حصہ ملے گا؟ آپ نے فرمایا:' تمہیں چھٹا حصہ ملے گا،جب وہ مڑکرجانے لگاتو آپ نے اسے بلاکر کہا: 'تمہیں ایک اور چھٹاحصہ ملے گا'،پھر جب وہ مڑکر جانے لگا تو آپ نے اسے بلایا کر فرمایا:' دوسرا چھٹا حصہ بطور خوراک ہے'۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں معقل بن یسار رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2099] لک السدس
إسنادہ ضعیف / د 2896    باب ما جاء في میراث الجد`;
tirmizi.anwaar = [244,1];