var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ فِي الْجَدَّةِ مَعَ ابْنِهَا إِنَّهَا أَوَّلُ جَدَّةٍ أَطْعَمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُدُسًا مَعَ ابْنِهَا وَابْنُهَا حَيٌّ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ هَذَا الْوَجْهِ وَقَدْ وَرَّثَ بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَدَّةَ مَعَ ابْنِهَا وَلَمْ يُوَرِّثْهَا بَعْضُهُمْ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ وہ (پوتے کے ترکہ میں)دادی اور اس کے بیٹے کے حصہ کے بارے میں کہتے ہیں: وہ پہلی دادی تھی جسے رسول اللہ ﷺ نے اس کے بیٹے کی موجود گی میں چھٹا حصہ دیا،اس وقت اس کابیٹا زندہ تھا۔امام ترمذی کہتے ہیں:۱-ہم اسے صرف اسی سند سے مرفوع جانتے ہیں،۲-بعض صحابہ نے بیٹے کی موجود گی میں دادی کو وارث ٹھہرایاہے اور بعض نے وارث نہیں ٹھہرایاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2102] إنھا أول جدۃ أطعمھا رسول اللّٰہ ﷺ
إسنادہ ضعیف باب ما جاء في میراث الجدۃ مع ابنھا
محمد بن سالم : ضعیف (تق: 5898)`;
tirmizi.anwaar = [244,1];