var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بُنْدَارٌ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ عَنْ حَكِيمِ بْنِ حَكِيمِ بْنِ عَبَّادِ بْنِ حُنَيْفٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ قَالَ كَتَبَ عُمَرُ بْنُ الْخَطَّابِ إِلَى أَبِي عُبَيْدَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ وَرَسُولُهُ مَوْلَى مَنْ لَا مَوْلَى لَهُ وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ عَائِشَةَ وَالْمِقْدَامِ بْنِ مَعْدِي كَرِبَ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوامامہ بن سہل بن حنیف رضی اللہ عنہما کہتے ہیں: عمر بن خطاب رضی اللہ عنہ نے ابوعبیدہ رضی اللہ عنہ کو لکھاکہ رسول اللہ ﷺ نے فرمایاہے:'اللہ اور اس کے رسول ولی(سرپرست) ہیں جس کا کوئی ولی(سرپرست) نہیں ہے اور ماموں اس آدمی کا وارث ہے جس کا کوئی وارث نہیں ہے'۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ام المومنین عائشہ اور مقدام بن معدیکرب رضی اللہ عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2103] اللّٰہ و رسولہ مولی من لا مولی لہ
إسنادہ ضعیف/ جہ 2737    باب ما جاء في میراث الخال
سفیان الثوري عنعن ( تقدم : 746 ) و الحدیث الآتي ( الأصل : 2104 بتحقیقي ) یغني عنہ۔`;
tirmizi.anwaar = [244,1];