var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا رَجُلٍ عَاهَرَ بِحُرَّةٍ أَوْ أَمَةٍ فَالْوَلَدُ وَلَدُ زِنَا لَا يَرِثُ وَلَا يُورَثُ قَالَ أَبُو عِيسَى وَقَدْ رَوَى غَيْرُ ابْنِ لَهِيعَةَ هَذَا الْحَدِيثَ عَنْ عَمْرِو بْنِ شُعَيْبٍ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّ وَلَدَ الزِّنَا لَا يَرِثُ مِنْ أَبِيهِ";
tirmizi.urdu = "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' جو شخص کسی آزاد عورت یاکسی لونڈی کے ساتھ زناکرے تو (اس سے پیدا ہونے والا) لڑکا ولدزنا ہوگا،نہ وہ (اس زانی کا) وارث ہوگا۔نہ زانی (اس کا) وارث ہوگا'۔امام ترمذی کہتے ہیں:۱-ابن لہیعہ کے علاوہ دوسرے لوگوں نے بھی اس حدیث کوعمرو بن شعیب سے روایت کیا ہے،۲-اہل علم کا اسی پرعمل ہے کہ ولد زنا اپنے باپ کا وارث نہیں ہوگا۔";
tirmizi.hukam = "";
tirmizi.description = `[2113] أیما رجل عاھر بحرۃ
إسنادہ ضعیف/ جہ 2745    باب ما جاء في ابطال میراث ولد الزنا
عبد اللّٰہ بن لھیعۃ ضعیف مدلس ( تقدم : 10)
وللحدیث شاھد ضعیف عند ابن حبان في صحیحہ (5964)`;
tirmizi.anwaar = [244,1];