var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَرِثُ الْوَلَاءَ مَنْ يَرِثُ الْمَالَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِالْقَوِيِّ";
tirmizi.urdu = "عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' ولاء کاوارث وہی ہوگا جو مال کا وارث ہوگا۔امام ترمذی کہتے ہیں: اس حدیث کی سند زیادہ قوی نہیں ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2114] یرث الولاء من یرث المال
إسنادہ ضعیف باب ما جاء فیمن یرث الولاء
عبد اللّٰہ بن لھیعۃ ضعیف لاختلاطہ ( تقدم : 10) و لہ شاھد عند أحمد ( 22/1ح 147) وسندہ معلل بالإنقطاع۔`;
tirmizi.anwaar = [244,1];