var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي إِسْحَقَ الْهَمْدَانِيِّ عَنْ الْحَارِثِ عَنْ عَلِيٍّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالدَّيْنِ قَبْلَ الْوَصِيَّةِ وَأَنْتُمْ تُقِرُّونَ الْوَصِيَّةَ قَبْلَ الدَّيْنِ قَالَ أَبُو عِيسَى وَالْعَمَلُ عَلَى هَذَا عِنْدَ عَامَّةِ أَهْلِ الْعِلْمِ أَنَّهُ يُبْدَأُ بِالدَّيْنِ قَبْلَ الْوَصِيَّةِ";
tirmizi.urdu = "علی رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے وصیت(کے نفاذ) سے پہلے قرض کی ادائیگی کا فیصلہ فرمایا،جب کہ تم(قرآن میں) قرض سے پہلے وصیت پڑھتے ہو ۱ ؎۔\nامام ترمذی کہتے ہیں: عام اہل علم کا اسی پرعمل ہے کہ وصیت سے پہلے قرض ادا کیا جائے گا۔";
tirmizi.hukam = "";
tirmizi.description = `[2122] أن النبي ﷺ قضی بالدین
إسنادہ ضعیف/ جہ 2739    باب ما جاء یبدأ بالدین قبل الوصیۃ
الحارث الأعور ضعیف رافضي (د 908 ) و أبو إسحاق لم یسمع منہ ( تقدم : 107) و حدیث ابن ماجہ (الأصل : 2433) یغني عنہ۔`;
tirmizi.anwaar = [244,1];