var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ الْبَصْرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ حَدَّثَنَا أَبُو مَعْشَرٍ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَهَادَوْا فَإِنَّ الْهَدِيَّةَ تُذْهِبُ وَحَرَ الصَّدْرِ وَلَا تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا وَلَوْ شِقَّ فِرْسِنِ شَاةٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَأَبُو مَعْشَرٍ اسْمُهُ نَجِيحٌ مَوْلَى بَنِي هَاشِمٍ وَقَدْ تَكَلَّمَ فِيهِ بَعْضُ أَهْلِ الْعِلْمِ مِنْ قِبَلِ حِفْظِهِ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:'تم لوگ ایک دوسرے کو ہدیہ دیاکرو،اس لیے کہ ہدیہ دل کی کدورت کو دور کرتاہے،کوئی پڑوسن اپنی پڑوسن کے ہدیہ کوحقیر نہ سمجھے اگرچہ وہ بکری کے کھرکا ایک ٹکڑا ہی کیوں نہ ہو ' ۱؎۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث اس سند سے غریب ہے،۲-ابومعشرکانام نجیح ہے وہ بنی ہاشم کے (آزاد کردہ) غلام ہیں،ان کے حافظے کے تعلق سے بعض اہل علم نے ان کے بارے میں کلام کیاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2130] تھا دوا فإن الھدیۃ تذھب وحر الصدر
إسنادہ ضعیف باب في حث النبي ﷺ علی الھدیۃ
أبو معشر نجیح السندي : ضعیف ( د 3778) `;
tirmizi.anwaar = [245,1];