var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى الْكُوفِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ الْقَاسِمِ بْنِ حَبِيبٍ وَعَلِيُّ بْنُ نِزَارٍ عَنْ نِزَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِنْفَانِ مِنْ أُمَّتِي لَيْسَ لَهُمَا فِي الْإِسْلَامِ نَصِيبٌ الْمُرْجِئَةُ وَالْقَدَرِيَّةُ قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ عُمَرَ وَابْنِ عُمَرَ وَرَافِعِ بْنِ خَدِيجٍ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا سَلَّامُ بْنُ أَبِي عَمْرَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مُحَمَّدُ بْنُ رَافِعٍ وَحَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا عَلِيُّ بْنُ نِزَارٍ عَنْ نِزَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' میری امت کے دوقسم کے لوگوں کے لیے اسلام میں کوئی حصہ نہیں ہے:(۱) مرجئہ (۲) قدریہ ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح غریب ہے،۲-اس باب میں عمر،ابن عمر اور رافع بن خدیج رضی اللہ عنہم سے بھی احادیث آئی ہیں۔اس سند سے بھی عبد اللہ بن عباس رضی اللہ عنہما سے اسی جیسی حدیث مروی ہے۔اس سند بھی ابن عباس رضی اللہ عنہما سے اسی جیسی حدیث مروی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2149] 1/ صنفان من أمتي لیس لھما
ضعیف / جہ 62    باب ما جاء فی القدریۃ
نزار : ضعیف ( تق: 7104) وللحدیث شاہد ضعیف،انظر الحدیث الآتي (2149ب) 
2/  صنفان من أمتي لیس لھما
إسنادہ ضعیف باب ما جاء فی القدریۃ
سلام بن أبي عمر الخراساني : ضعیف ( تق: 2709) [و فی الباب حدیث یغني عنہ،انظر ص 535 ]`;
tirmizi.anwaar = [246,1];