var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ الْبَصْرِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَعَاطَى السَّيْفُ مَسْلُولًا قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أَبِي بَكْرَةَ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ حَمَّادِ بْنِ سَلَمَةَ وَرَوَى ابْنُ لَهِيعَةَ هَذَا الْحَدِيثَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ بَنَّةَ الْجُهَنِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَدِيثُ حَمَّادِ بْنِ سَلَمَةَ عِنْدِي أَصَحُّ";
tirmizi.urdu = "جابر رضی اللہ عنہ کہتے ہیں: رسول اللہﷺ نے ننگی تلوارلینے اور دینے سے منع فرمایا ۱؎۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حماد بن سلمہ کی روایت سے حسن غریب ہے،۲-ابن لہیعہ نے یہ حدیث 'عن أبی الزبیر،عن جابر وعن بنتہ الجہنی،عن النبی ﷺ' کی سند سے روایت کی ہے،۳-میرے نزدیک حماد بن سلمہ کی روایت زیادہ صحیح ہے،۴-اس باب میں ابوبکرہ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2163] نھی رسول اللّٰہ ﷺ أن یتعاطی السیف مسلولاً
إسنادہ ضعیف / د 2588    باب ما جاء فی النھي عن تعاطي السیف مسلولاً`;
tirmizi.anwaar = [246,1];