var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مَيْمُونٍ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدُ اللَّهِ مَعَ الْجَمَاعَةِ وَهَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ ابْنِ عَبَّاسٍ إِلَّا مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' اللہ کا ہاتھ (اس کی مدد و نصرت) جماعت کے ساتھ ہوتا ہے '۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے ابن عباس رضی اللہ عنہما کی روایت سے صرف اسی سندسے جانتے ہیں۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;