var tirmizi = {};
tirmizi.arabic = "قَالَ مُجَاهِدٌ وَسُئِلَ ابْنُ عَبَّاسٍ عَنْ رَجُلٍ يَصُومُ النَّهَارَ وَيَقُومُ اللَّيْلَ لَا يَشْهَدُ جُمْعَةً وَلَا جَمَاعَةً قَالَ هُوَ فِي النَّارِ قَالَ حَدَّثَنَا بِذَلِكَ هَنَّادٌ حَدَّثَنَا الْمُحَارِبِيُّ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ قَالَ وَمَعْنَى الْحَدِيثِ أَنْ لَا يَشْهَدَ الْجَمَاعَةَ وَالْجُمُعَةَ رَغْبَةً عَنْهَا وَاسْتِخْفَافًا بِحَقِّهَا وَتَهَاوُنًا بِهَا";
tirmizi.urdu = "مجاہد کہتے ہیں: ابن عباس رضی اللہ عنہما سے اس شخص کے بارے میں پوچھا گیا جو دن کو صوم رکھتاہو او ر رات کو قیام کرتاہو۔اور جمعہ میں حاضر نہ ہوتا ہو؛ تو انہوں نے کہا: وہ جہنم میں ہوگا۔\nمجاہد کہتے ہیں: حدیث کا مفہوم یہ ہے کہ وہ جماعت اور جمعہ میں ان سے بے رغبتی کرتے ہوئے،انہیں حقیر جانتے ہوئے اور ان میں سستی کرتے ہوئے حاضرنہ ہوتا ہو۔";
tirmizi.hukam = "";
tirmizi.description = `[218] سئل ابن عباس عن رجل یصوم النھار
إسنادہ ضعیف موقوف   باب ما جاء فیمن یسمع النداء فلا یجیب
عبد الرحمن بن محمد المحاربي عنعن وھو مدلس (د 2031) ولیث بن أبي سلیم ضعیف مدلس ( د 132)`;
tirmizi.anwaar = [196,1];