var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ شُعْبَةَ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَ انْفَلَقَ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْهَدُوا قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ وَأَنَسٍ وَجُبَيْرِ بْنِ مُطْعِمٍ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہﷺ کے زمانہ میں چاند(دوٹکڑوں میں) ہوگیاتو رسول اللہ ﷺ نے فرمایا:' تم لوگ گواہ رہو ' ۱؎۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن مسعود،انس اورجبیر بن مطعم رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;