var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ الْمُعَلَّى بْنِ زِيَادٍ رَدَّهُ إِلَى مُعَاوِيَةَ بْنِ قُرَّةَ رَدَّهُ إِلَى مَعْقِلِ بْنِ يَسَارٍ رَدَّهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعِبَادَةُ فِي الْهَرْجِ كَالْهِجْرَةِ إِلَيَّ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ عَنْ الْمُعَلَّى";
tirmizi.urdu = "معقل بن یسار رضی اللہ عنہ سے روایت ہے کہ نبیﷺ نے فرمایا:' قتل وخوں ریزی کے زمانہ میں عبادت کرنا میری طرف ہجرت کرنے کے مانندہے ' ۱؎۔امام ترمذی کہتے ہیں:۱-یہ حدیث صحیح غریب ہے،۲-ہم اسے صرف حمادبن زید کی روایت سے جانتے ہیں،جسے وہ معلی سے روایت کرتے ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;