var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبَّادُ بْنُ يَعْقُوبَ الْكُوفِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْقُدُّوسِ عَنْ الْأَعْمَشِ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي هَذِهِ الْأُمَّةِ خَسْفٌ وَمَسْخٌ وَقَذْفٌ فَقَالَ رَجُلٌ مِنْ الْمُسْلِمِينَ يَا رَسُولَ اللَّهِ وَمَتَى ذَاكَ قَالَ إِذَا ظَهَرَتْ الْقَيْنَاتُ وَالْمَعَازِفُ وَشُرِبَتْ الْخُمُورُ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ الْأَعْمَشِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَابِطٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلٌ وَهَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "عمران بن حصین رضی اللہ عنہ سے روایت ہے کہ رسول اللہﷺ نے فرمایا:' اس امت میں خسف،مسخ اور قذف واقع ہوگا' ۱؎،ایک مسلمان نے عرض کیا: اللہ کے رسول! ایساکب ہوگا؟ آپ نے فرمایا:' جب ناچنے والیاں اورباجے عام ہوجائیں گے اورشراب خوب پی جائے گی'۔امام ترمذی کہتے ہیں:۱-یہ حدیث'عن الأعمش،عن الرحمن بن سابط،عن النبی ﷺ 'کی سند سے مرسلاً مروی ہے،۲-یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2212] في ھذہ الأمۃ خسف ومسخ
إسنادہ ضعیف باب[ما جاء في علامۃ حلول المسخ والخسف ]
عبداﷲ بن عبد القدوس: ضعیف یعتبر بہ کما فی التحریر (3446) وقال الھیثمي : وقد ضعفہ الجمھور( مجمع الزوائد 110/7) و قال : و ضعفہ أحمد والجمھور ( مجمع الزوائد 339/9 )`;
tirmizi.anwaar = [247,2];