var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ،حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ أَبُو غَسَّانَ الْعَنْبَرِيُّ،عَنْ إِسْمَاعِيلَ الْكَحَّالِ،عَنْ عَبْدِاللهِ بْنِ أَوْسٍ الْخُزَاعِيِّ،عَنْ بُرَيْدَةَ الأَسْلَمِيِّ،عَنْ النَّبِيِّ ﷺ قَالَ:بَشِّرْ الْمَشَّائِينَ فِي الظُّلَمِ إِلَى الْمَسَاجِدِ بِالنُّورِ التَّامِّ يَوْمَ الْقِيَامَةِ.\nقَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ.";
tirmizi.urdu = "بریدہ اسلمی رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:' اندھیرے میں چل کر مسجد آنے والوں کو قیامت کے دن کامل نور(بھرپوراجالے) کی بشارت دے دو'۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 721`;