var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُقَاتِلُكُمْ الْيَهُودُ فَتُسَلَّطُونَ عَلَيْهِمْ حَتَّى يَقُولَ الْحَجَرُ يَا مُسْلِمُ هَذَا يَهُودِيٌّ وَرَائِي فَاقْتُلْهُ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہﷺ نے فرمایا:' یہود تم سے لڑیں گے اورتم ان پر غالب ہوجاؤگے یہاں تک کہ پتھرکہے گا:اے مسلمان! میرے پیچھے یہ یہودی ہے اسے قتل کردو' ۱ ؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;