var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ شُعْبَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ فَتْحُ الْقُسْطَنْطِينِيَّةِ مَعَ قِيَامِ السَّاعَةِ قَالَ مَحْمُودٌ هَذَا حَدِيثٌ غَرِيبٌ وَالْقُسْطَنْطِينِيَّةُ هِيَ مَدِينَةُ الرُّومِ تُفْتَحُ عِنْدَ خُرُوجِ الدَّجَّالِ وَالْقُسْطَنْطِينِيَّةُ قَدْ فُتِحَتْ فِي زَمَانِ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ قسطنطنیہ قیامت کے قریب فتح ہوگا۔\nمحمودبن غیلان کہتے ہیں: یہ حدیث غریب ہے۔\nقسطنطنیہ روم کا ایک شہرہے،جوخروج دجال کے وقت فتح ہوگا،قسطنطنیہ نبی اکرمﷺ کے بعض صحابہ کے زمانہ میں ایک بار فتح ہوچکاہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = `مشکوۃ المصابیح: 5436
وقال محمود (بن غیلان) فیہ: ’’ھذا حدیث غریب، والقسطنطنیۃ ھي مدینۃ الروم تفتح عند خروج الدجال، والقسطنطنیۃ قد فتحت في زمان بعض أصحاب النبي ﷺ‘‘`;