var tirmizi = {};
tirmizi.arabic = "و قَالَ النَّبِيُّ ﷺ:لَوْ أَنَّ النَّاسَ يَعْلَمُونَ مَا فِي النِّدَاءِ،وَالصَّفِّ الأَوَّلِ،ثُمَّ لَمْ يَجِدُوا إِلاَّ أَنْ يَسْتَهِمُوا عَلَيْهِ لاَسْتَهَمُوا عَلَيْهِ. قَالَ: حَدَّثَنَا بِذَلِكَ إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ،حَدَّثَنَا مَعْنٌ،حَدَّثَنَا مَالِكٌ،عَنْ سُمَيٍّ،عَنْ أَبِي صَالِحٍ،عَنْ أَبِي هُرَيْرَةَ،عَنْ النَّبِيِّ ﷺ مِثْلَهُ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا: 'اگر لوگوں کو معلوم ہوجائے کہ اذان اورپہلی صف میں کیاثواب ہے،اور وہ اسے قرعہ اندازی کے بغیر نہ پاسکتے تو اس کے لیے قرعہ اندازی کرتے'۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;