var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى الْفَزَارِيُّ ابْنُ بِنْتِ السُّدِّيِّ الْكُوفِيِّ حَدَّثَنَا عُمَرُ بْنُ شَاكِرٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْتِي عَلَى النَّاسِ زَمَانٌ الصَّابِرُ فِيهِمْ عَلَى دِينِهِ كَالْقَابِضِ عَلَى الْجَمْرِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَعُمَرُ بْنُ شَاكِرٍ شَيْخٌ بَصْرِيٌّ قَدْ رَوَى عَنْهُ غَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' لوگوں پر ایک ایسازمانہ آئے گاکہ ان میں اپنے دین پر صبرکر نے والا آدمی ایسا ہوگا جیسے ہاتھ میں چنگاری پکڑنے والا ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث اس سند سے غریب ہے،۲-عمربن شاکرایک بصری شیخ ہیں،ان سے کئی اہل علم نے حدیث روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2260] یأتي علی الناس زمان
إسنادہ ضعیف باب 73
عمر بن شاکر ضعیف ( تق : 4917 ) والحدیث الآتي ( الأصل : 3058 ) یغني عنہ۔`;
tirmizi.anwaar = [248,2];