var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ الْجَوْزَجَانِيُّ حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّكُمْ فِي زَمَانٍ مَنْ تَرَكَ مِنْكُمْ عُشْرَ مَا أُمِرَ بِهِ هَلَكَ ثُمَّ يَأْتِي زَمَانٌ مَنْ عَمِلَ مِنْكُمْ بِعُشْرِ مَا أُمِرَ بِهِ نَجَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ نُعَيْمِ بْنِ حَمَّادٍ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ قَالَ وَفِي الْبَاب عَنْ أَبِي ذَرٍّ وَأَبِي سَعِيدٍ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:' تم لوگ ایسے زمانہ میں ہوکہ جو اس کا دسواں حصہ چھوڑدے جس کا اسے کرنے کا حکم دیا گیا ہے تووہ ہلاک ہوجائے گا،پھر ایک ایسازمانہ آئے گا کہ تم میں سے جو اس کے دسویں حصہ پر عمل کرے جس کا اسے کرنے کاحکم دیا گیاہے تووہ نجات پاجاگا ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،ہم اسے صرف نعیم بن حماد کی روایت سے جانتے ہیں،جسے وہ سفیان بن عیینہ سے روایت کرتے ہیں،۲-اس باب میں ابوذراورابوسعیدخدری رضی اللہ عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2267] إنکم في زمان من ترک منکم عشر
إسنادہ ضعیف باب 79
سفیان بن عیینۃ عنعن ( تقدم : 1778) `;
tirmizi.anwaar = [249,1];