var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا أَبُو عَوَانَةَ،عَنْ عَبْدِ الأَعْلَى،عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ،عَنْ عَلِيٍّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ،وَفِي البَاب عَنْ ابْنِ عَبَّاسٍ،وَأَبِي هُرَيْرَةَ،وَأَبِي شُرَيْحٍ،وَوَاثِلَةَ. وَهَذَا أَصَحُّ مِنَ الحَدِيثِ الْأَوَّلِ";
tirmizi.urdu = "اس سندسے بھی علی رضی اللہ عنہ نبی اکرمﷺ کے واسطہ سے اسی جیسی حدیث روایت کرتے ہیں۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن ہے،۲-یہ حدیث پہلی حدیث سے زیادہ صحیح ہے،۳-اس باب میں ابن عباس،ابوہریرہ،ابوشریح اورواثلہ رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;