var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَحَلَّمَ كَاذِبًا كُلِّفَ يَوْمَ الْقِيَامَةِ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ وَلَنْ يَعْقِدَ بَيْنَهُمَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عباس سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:' جو شخص جھوٹاخواب بیان کرے تو قیامت کے دن دوجوکے درمیان گرہ لگانے پر مکلف کیاجائے گا اوروہ ان دونوں کے درمیان گرہ ہرگزنہیں لگاسکے گا'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;