var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ قَالَ: حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ،عَنْ أَبِيهِ،عَنْ صَالِحِ بْنِ كَيْسَانَ،عَنِ الزُّهْرِيِّ،عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ،[ص:540] عَنْ أَبِي سَعِيدٍ الخُدْرِيِّ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ. وَهَذَا أَصَحُّ";
tirmizi.urdu = "اس سند سے ابوسعید خدری رضی اللہ عنہ نبی اکرمﷺ سے اسی جیسی اوراسی معنی کی حدیث روایت کرتے ہیں۔\nامام ترمذی کہتے ہیں: یہ زیادہ صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;