var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ: حَدَّثَنَا الفَضْلُ بْنُ مُوسَى،عَنْ مُحَمَّدِ بْنِ عَمْرٍو،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَكْثِرُوا ذِكْرَ هَاذِمِ اللَّذَّاتِ» يَعْنِي الْمَوْتَ وَفِي البَاب عَنْ أَبِي سَعِيدٍ: «هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ»";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' لذتوں کو توڑنے والی (یعنی موت) کو کثرت سے یادکیا کرو ' ۱؎۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب،۲-اس باب میں ابوسعید خدری رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 1607`;