var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ عَنْ عِيسَى بْنِ طَلْحَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلِمَةِ لَا يَرَى بِهَا بَأْسًا يَهْوِي بِهَا سَبْعِينَ خَرِيفًا فِي النَّارِ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں: رسول اللہ ﷺ نے فرمایا:'آدمی کبھی ایسی بات کہہ دیتاہے جس میں وہ خود کوئی حرج نہیں سمجھتا حالانکہ اس کی وجہ سے وہ ستر برس تک جہنم کی آگ میں گرتاچلاجائے گا' ۱؎۔\nامام ترمذی کہتے ہیں: اس سند سے یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;