var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الْجَبَّارِ الْبَغْدَادِيُّ حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي عَنْ الْأَعْمَشِ عَنْ أَنَسٍ قَالَ تُوُفِّيَ رَجُلٌ مِنْ أَصْحَابِهِ فَقَالَ يَعْنِي رَجُلًا أَبْشِرْ بِالْجَنَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَلَا تَدْرِي فَلَعَلَّهُ تَكَلَّمَ فِيمَا لَا يَعْنِيهِ أَوْ بَخِلَ بِمَا لَا يَنْقُصُهُ قَالَ هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ایک صحابی کی وفات ہوگئی،ایک آدمی نے کہا: تجھے جنت کی بشارت ہو،رسول اللہ ﷺ نے فرمایا:' شاید تمہیں نہیں معلوم کہ اس نے کوئی ایسی بات کہی ہو جو بے فائدہ ہو،یا ایسی چیز کے ساتھ بخل سے کام لیا ہو جس کے خرچ کرنے سے اس کا کچھ نقصان نہ ہوتا '۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2316] أولا تدري فلعلہ تکلم فیما لا یعنیہ
إسنادہ ضعیف باب [حدیث : من حسن إسلام المرء۔۔]
الأعمش عنعن ( تقدم : 169) ولم یسمع من أنس رضي اللّٰہ عنہ۔`;
tirmizi.anwaar = [251,1];