var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ نَصْرٍ النَّيْسَابُورِيُّ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا أَبُو مُسْهِرٍ عَنْ إِسْمَعِيلَ بْنِ عَبْدِ اللَّهِ بْنِ سَمَاعَةَ عَنْ الْأَوْزَاعِيِّ عَنْ قُرَّةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ قَالَ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:'کسی شخص کے اسلام کی خوبی یہ ہے کہ وہ لایعنی اورفضول باتوں کوچھوڑ دے ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-ہم اس حدیث کوابوسلمہ کی روایت سے جسے وہ ابوہریرہ سے اورابوہریرہ نبی اکرمﷺ سے روایت کرتے ہیں صرف اسی سندسے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2317] من حسن إسلام المرء ترکہ ما لا یعنیہ
إسنادہ ضعیف/ جہ 3976    باب [حدیث : من حسن إسلام المرء إلخ]
قرۃ ضعیف ( د 4840 ) ضعفہ الجمھور و الزہري عنعن إن صح السند إلیہ۔`;
tirmizi.anwaar = [251,1];