var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا العَبَّاسُ الدُّورِيُّ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ المُقْرِئُ قَالَ: حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ،عَنْ شُرَحْبِيلَ بْنِ شَرِيكٍ،عَنْ أَبِي عَبْدِ الرَّحْمَنِ الحُبُلِيِّ،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «قَدْ أَفْلَحَ مَنْ أَسْلَمَ وَرُزِقَ كَفَافًا وَقَنَّعَهُ اللَّهُ». هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' کامیاب ہوا وہ شخص جس نے اسلام قبول کیا اور بقدر کفاف اسے روزی حاصل ہوئی اور اللہ نے اسے (اپنے دئے ہوئے پر) قانع بنادیا ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;