var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْبَصْرِيُّ حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ عَنْ الْأَعْمَشِ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فُقَرَاءُ الْمُهَاجِرِينَ يَدْخُلُونَ الْجَنَّةَ قَبْلَ أَغْنِيَائِهِمْ بِخَمْسِ مِائَةِ سَنَةٍ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَجَابِرٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "ابوسعیدخدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' مہاجر فقراء جنت میں مالدارمہاجر سے پانچ سو سال پہلے داخل ہوں گے ' ۱؎۔امام ترمذی کہتے ہیں:۱-یہ حدیث اس سند سے حسن غریب ہے،۲-اس باب میں ابوہریرہ،عبداللہ بن عمرو اور جابر رضی اللہ عنہم سے بھی احادیث آئی ہیں۔\nوضاحت ۱؎: یہ اس لیے کہ غریب مہاجرکے پاس چونکہ مال کم تھا،اس لیے انہیں حساب و کتاب میں زیادہ تاخیر نہیں ہوگی،جب کہ مالدار مہاجرین کو مال کے حساب میں بہت تاخیر ہوگی،اس سے غریب کی فضیلت معلوم ہوئی۔آخرت کاآدھادن دنیاکے پانچ سوسال کے برابرہوگا،اس لحاظ سے جس حدیث میں آدھے دن کا ذکرہے اس سے آخرت کا آدھا دن مرادہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2351] فقراء المھاجرین یدخلون الجنۃ
إسنادہ ضعیف/ جہ 4123    باب ما جاء أن فقراء المھاجرین یدخلون الجنۃ
عطیۃ العوفي ضعیف ( تقدم : 477) وسلیمان الأعمش عنعن (تقدم :169) و حدیث مسلم ( 2979) و الحدیث الآتي ( الأصل : 2354) یغنیان عنہ۔`;
tirmizi.anwaar = [253,1];