var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْعَبَّاسُ الدُّورِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ عَمْرِو بْنِ جَابِرٍ الْحَضْرَمِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَدْخُلُ فُقَرَاءُ الْمُسْلِمِينَ الْجَنَّةَ قَبْلَ أَغْنِيَائِهِمْ بِأَرْبَعِينَ خَرِيفًا هَذَا حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہﷺ نے ارشاد فرمایا:' فقیرومحتاج مسلمان جنت میں مالداروں سے چالیس سال پہلے داخل ہوں گے'۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2355] یدخل فقراء المسلمین الجنۃ
إسنادہ ضعیف باب ما جاء أن فقراء المہاجرین یدخلون الجنۃ
عمرو بن جابر : ضعیف شیعي (تق: 4996) و حدیث مسلم (2979) یغني عنہ۔`;
tirmizi.anwaar = [253,1];