var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ عَنْ مُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَدَعَتْ لِي بِطَعَامٍ وَقَالَتْ مَا أَشْبَعُ مِنْ طَعَامٍ فَأَشَاءُ أَنْ أَبْكِيَ إِلَّا بَكَيْتُ قَالَ قُلْتُ لِمَ قَالَتْ أَذْكُرُ الْحَالَ الَّتِي فَارَقَ عَلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدُّنْيَا وَاللَّهِ مَا شَبِعَ مِنْ خُبْزٍ وَلَحْمٍ مَرَّتَيْنِ فِي يَوْمٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "مسروق کہتے ہیں: میں ام المومنین عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا تو انہوں نے ہمارے لیے کھانا طلب کیااورکہاکہ میں کسی کھانے سے سیرنہیں ہوتی ہوں کہ رونا چاہتی ہوں پھر رونے لگتی ہوں۔میں نے سوال کیا: ایسا کیوں؟ عائشہ رضی اللہ عنہا نے کہا: میں اس حالت کو یاد کرتی ہوں جس پر رسول اللہ ﷺ کا انتقال ہوا،اللہ کی قسم! آپ روٹی اور گوشت سے ایک دن میں دوبار کبھی سیر نہیں ہوئے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2356] دخلت علی عائشۃ فدعت لي بطعام
إسنادہ ضعیف باب ما جاء في معیشۃ النبي ﷺ وأھلہ
مجالد : ضعیف ( تقدم : 653)`;
tirmizi.anwaar = [253,1];