var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ أَنْبَأَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَال سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ يُحَدِّثُ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ عَنْ عَائِشَةَ قَالَتْ مَا شَبِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خُبْزِ شَعِيرٍ يَوْمَيْنِ مُتَتَابِعَيْنِ حَتَّى قُبِضَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں: رسول اللہ ﷺنے دوروز متواتر جو کی روٹی کبھی سیر ہوکرنہیں کھائی یہاں تک کہ آپ وفات پاگئے۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابوہریرہ رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;