var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ قَالَ: حَدَّثَنَا وَكِيعٌ،عَنْ الأَعْمَشِ،عَنْ عُمَارَةَ بْنِ القَعْقَاعِ،عَنْ أَبِي زُرْعَةَ،عَنْ أَبِي هُرَيْرَةَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ اجْعَلْ رِزْقَ آلِ مُحَمَّدٍ قُوتًا»: «هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ»";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں: رسول اللہ ﷺ نے یہ دعاکی'اللَّہُمَّ اجْعَلْ رِزْقَ آلِ مُحَمَّدٍ قُوتًا' اے اللہ! محمدﷺ کے گھروالوں کوصرف اتنی روزی دے جس سے ان کے جسم کا رشتہ برقراررہ سکے ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;