var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،قَالَ: «كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدَّخِرُ شَيْئًا لِغَدٍ»: «هَذَا حَدِيثٌ غَرِيبٌ» وَقَدْ رُوِيَ هَذَا الحَدِيثُ عَنْ جَعْفَرِ بْنِ سُلَيْمَانَ،عَنْ ثَابِتٍ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «مُرْسَلًا»";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں:نبی اکرمﷺ آنے والے کل کے لیے کچھ نہیں رکھ چھوڑتے تھے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-یہ حدیث 'عن جعفر بن سلیمان عن ثابت عن النبی ﷺ' کی سند سے مرسلا بھی مروی ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 5825`;