var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا يَحْيَى بْنُ عُبَيْدِ اللَّهِ قَال سَمِعْتُ أَبِي يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ أَحَدٍ يَمُوتُ إِلَّا نَدِمَ قَالُوا وَمَا نَدَامَتُهُ يَا رَسُولَ اللَّهِ قَالَ إِنْ كَانَ مُحْسِنًا نَدِمَ أَنْ لَا يَكُونَ ازْدَادَ وَإِنْ كَانَ مُسِيئًا نَدِمَ أَنْ لَا يَكُونَ نَزَعَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ وَيَحْيَى بْنُ عُبَيْدِ اللَّهِ قَدْ تَكَلَّمَ فِيهِ شُعْبَةُ وَهُوَ يَحْيَى بْنُ عُبَيْدِ اللَّهِ بْنِ مَوْهَبٍ مَدَنِيٌّ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' جو بھی مرتاہے وہ نادم وشرمندہ ہوتاہے'،صحابہ نے عرض کیا: اللہ کے رسول!شرم وندامت کی کیاوجہ ہے؟' آپ نے فرمایا:' اگر وہ شخص نیک ہے تواسے اس بات پرندامت ہوتی ہے کہ وہ زیادہ سے زیادہ نیکی نہ کرسکا،اور اگر وہ بد ہے تو نادم ہوتاہے کہ میں نے بدی سے اپنے آپ کو نکالاکیوں نہیں'۔امام ترمذی کہتے ہیں:۱-اس حدیث کو ہم صرف اسی سند سے جانتے ہیں،۲-یحییٰ بن عبیدا للہ کے بارے میں شعبہ نے کلام کیا ہے،اور یہ یحییٰ بن عبید اللہ بن موہب مدنی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2403] مامن أحد یموت إلا ندم
إسنادہ ضعیف جدًا    باب [یوم القیامۃ وندامۃ المحسن والمسئ یومئذ]
یحیی بن عبید اللّٰہ : متروک ( تقدم : 1929) `;
tirmizi.anwaar = [254,2];