var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ النُّعْمَانِ بْنِ سَعْدٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شِعَارُ الْمُؤْمِنِ عَلَى الصِّرَاطِ رَبِّ سَلِّمْ سَلِّمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ الْمُغِيرَةِ بْنِ شُعْبَةَ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ";
tirmizi.urdu = "مغیرہ بن شعبہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' پل صراط پر مومن کا شعار یہ ہوگا: میرے رب! مجھے سلامت رکھ،مجھے سلامت رکھ۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث مغیرہ بن شعبہ کی روایت سے غریب ہے،اسے ہم صرف عبدالرحمٰن بن اسحاق (واسطی ہی) کی روایت سے جانتے ہیں،۲-اس باب میں ابوہریرہ رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2432] شعار المؤمنین علی الصراط
إسنادہ ضعیف باب ما جاء في شأن الصراط
عبد الرحمن بن إسحاق : ضعیف ( تقدم : 741) وحدیث البخاري (7437) ومسلم (195) یغني عنہ۔`;
tirmizi.anwaar = [256,1];