var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ أُمَّتِي مَنْ يَشْفَعُ لِلْفِئَامِ مِنْ النَّاسِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلْقَبِيلَةِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلْعَصَبَةِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلرَّجُلِ حَتَّى يَدْخُلُوا الْجَنَّةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "ابوسعیدخدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' میری امت کاکوئی شخص کئی جماعت کے لیے شفاعت کرے گا،کوئی ایک قبیلہ کے لیے شفاعت کرے گا،کوئی ایک گروہ کے لیے شفاعت کرے گا،اور کوئی ایک آدمی کے لیے شفاعت کرے گا،یہاں تک کہ سب جنت میں داخل ہوں جائیں گے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2440] إن من أمتي من یشفع للفئام من الناس
إسنادہ ضعیف
باب منہ
عطیۃ العوفي : ضعیف ( تقدم : 477) `;
tirmizi.anwaar = [257,1];