var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو صَفْوَانَ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ ابْتُلِينَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالضَّرَّاءِ فَصَبَرْنَا ثُمَّ ابْتُلِينَا بِالسَّرَّاءِ بَعْدَهُ فَلَمْ نَصْبِرْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "عبدالرحمٰن بن عوف رضی اللہ عنہ کہتے ہیں: ہم رسول اللہ ﷺ کے ساتھ تکلیف اورتنگی میں آزمائے گئے تو اس پرہم نے صبر کیا،پھر آپ کے بعد کی حالت میں کشادگی اور خوشی میں آزمائے گئے تو ہم صبر نہ کرسکے ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2464] ابتلینا مع رسول اللّٰہ ﷺ
إسنادہ ضعیف باب أحادیث : ابتلینا بالضراء إلخ
الزھري مدلس وعنعن ( تقدم : 440 ) وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [258,1];