var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ إِنْ كُنَّا يَئُولُ مُحَمَّدٍ نَمْكُثُ شَهْرًا مَا نَسْتَوْقِدُ بِنَارٍ إِنْ هُوَ إِلَّا الْمَاءُ وَالتَّمْرُ قَالَ هَذَا حَدِيثٌ صَحِيحٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں: ہم آل محمد (ﷺ) ایسے تھے کہ ایک ایک مہینہ چولہانہیں جلاتے تھے،ہمارا گذر بسر صرف کھجور اور پانی پرہوتاتھا۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;