var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْقُرَشِيُّ حَدَّثَنَا يَحْيَى الْبَكَّاءُ عَنْ ابْنِ عُمَرَ قَالَ تَجَشَّأَ رَجُلٌ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كُفَّ عَنَّا جُشَاءَكَ فَإِنَّ أَكْثَرَهُمْ شِبَعًا فِي الدُّنْيَا أَطْوَلُهُمْ جُوعًا يَوْمَ الْقِيَامَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَفِي الْبَاب عَنْ أَبِي جُحَيْفَةَ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں: نبی اکرم ﷺ کے پاس ایک شخص نے ڈکار لیا،تو آپ نے فرمایا:' تم اپنی ڈکار ہم سے دور رکھو اس لیے کہ دنیا میں سب سے زیادہ پیٹ بھر کر کھانے والا قیامت کے دن سب سے زیادہ بھوکا رہے گا ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث اس سند سے حسن غریب ہے،۲-اس باب میں ابوجحیفہ رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2478] کف عنا جشاءک
إسنادہ ضعیف/ جہ 3350    باب حدیث : أکثرھم شبعًا إلخ
یحیی بن مسلم البکاء ضعیف ( تقدم : 195،196 ) وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [259,1];