var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى عَنْ أَبِيهِ قَالَ يَا بُنَيَّ لَوْ رَأَيْتَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصَابَتْنَا السَّمَاءُ لَحَسِبْتَ أَنَّ رِيحَنَا رِيحُ الضَّأْنِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَمَعْنَى هَذَا الْحَدِيثِ أَنَّهُ كَانَ ثِيَابَهُمْ الصُّوفُ فَإِذَا أَصَابَهُمْ الْمَطَرُ يَجِيءُ مِنْ ثِيَابِهِمْ رِيحُ الضَّأْنِ";
tirmizi.urdu = "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ انہوں نے کہا: اے میرے بیٹے! اگرتم ہمیں اس وقت دیکھتے جب ہم رسول اللہ ﷺ کے ساتھ تھے اور ہمیں بارش نصیب ہوتی تھی تو تم خیال کرتے کہ ہماری بوبھیڑ کی بوجیسی ہے۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث صحیح ہے،۲-اس حدیث کا مطلب یہ ہے کہ صحابہ کے کپڑے اون کے ہوتے تھے،جب اس پر بارش کاپانی پڑتا تو اس سے بھیڑ کی جیسی بو آنے لگتی تھی ۱ ؎۔";
tirmizi.hukam = "";
tirmizi.description = `[2479] یا بني! لو رأیتنا ونحن مع النبي ﷺ
إسنادہ ضعیف / د 4033،جہ 3562   باب في لبس الصوف`;
tirmizi.anwaar = [259,1];