var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْجَارُودُ بْنُ مُعَاذٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ أَبِي حَمْزَةَ عَنْ إِبْرَاهِيمَ النَّخَعِيِّ قَالَ الْبِنَاءُ كُلُّهُ وَبَالٌ قُلْتُ أَرَأَيْتَ مَا لَا بُدَّ مِنْهُ قَالَ لَا أَجْرَ وَلَا وِزْرَ";
tirmizi.urdu = "ابوحمزہ سے روایت ہے کہ ابراہیم نخعی کہتے ہیں:گھرمکان سب کا سب ہر عمارت باعث وبال ہے،میں نے کہا: اس مکان کے بارے میں آپ کا کیاخیال ہے،جسے بنائے بغیرچارہ نہیں انہوں نے کہا: نہ اس میں کوئی اجر ہے اور نہ کوئی گناہ۔";
tirmizi.hukam = "";
tirmizi.description = `[2480] کل بناء وبال علیک
إسنادہ ضعیف باب البناء کلہ وبال
أبو حمزۃ میمون الأعور القصاب : ضعیف ( تقدم : 659) `;
tirmizi.anwaar = [259,1];