var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ حَدَّثَنَا زَافِرُ بْنُ سُلَيْمَانَ عَنْ إِسْرَائِيلَ عَنْ شَبِيبِ بْنِ بَشِيرٍ هَكَذَا قَالَ شَبِيبُ بْنُ بَشِيرٍ وَإِنَّمَا هُوَ شَبِيبُ بْنُ بِشْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّفَقَةُ كُلُّهَا فِي سَبِيلِ اللَّهِ إِلَّا الْبِنَاءَ فَلَا خَيْرَ فِيهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "-انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' نفقہ سب کاسب اللہ کی راہ میں ہے سوائے اس نفقہ کے جو گھربنانے میں صرف ہوتاہے کیوں کہ اس میں کوئی خیر نہیں ہے'۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2482] النفقۃ کلھا في سبیل اللّٰہ
إسنادہ ضعیف باب النفقۃ کلھا في سبیل اللّٰہ
زافر : ضعیف یعتبر بہ،کما فی التحریر (1979) `;
tirmizi.anwaar = [259,1];