var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ قَالَ قُلْتُ لِعَائِشَةَ أَيُّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ إِذَا دَخَلَ بَيْتَهُ قَالَتْ كَانَ يَكُونَ فِي مَهْنَةِ أَهْلِهِ فَإِذَا حَضَرَتْ الصَّلَاةُ قَامَ فَصَلَّى قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "اسود بن یزیدکہتے ہیں کہ میں نے عائشہ رضی اللہ عنہا سے پوچھا کیا: رسول اللہ ﷺ جب اپنے گھر میں داخل ہوتے تھے توکیاکرتے تھے؟ کہا: آپ ﷺ اپنے گھروالوں کے کام کاج میں مشغول ہوجاتے تھے،پھر جب صلاۃ کا وقت ہوجاتا توکھڑے ہوتے اور صلاۃ پڑھنے لگتے تھے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;