var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ عِمْرَانَ بْنِ زَيْدٍ التَّغْلَبِيِّ عَنْ زَيْدٍ الْعَمِّيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَقْبَلَهُ الرَّجُلُ فَصَافَحَهُ لَا يَنْزِعُ يَدَهُ مِنْ يَدِهِ حَتَّى يَكُونَ الرَّجُلُ يَنْزِعُ وَلَا يَصْرِفُ وَجْهَهُ عَنْ وَجْهِهِ حَتَّى يَكُونَ الرَّجُلُ هُوَ الَّذِي يَصْرِفُهُ وَلَمْ يُرَ مُقَدِّمًا رُكْبَتَيْهِ بَيْنَ يَدَيْ جَلِيسٍ لَهُ قَالَ هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں: نبی اکرم ﷺ کے سامنے جب کوئی شخص آتا اور آپ سے مصافحہ کرتا تو آپ اپنا ہاتھ اس کے ہاتھ سے نہیں نکالتے جب تک وہ شخص خود اپنا ہاتھ نہ نکال لیتا،اور آپ اپنا رخ اس کی طرف سے نہیں پھیرتے،جب تک کہ وہ خوداپنا رخ نہ پھیر لیتا،اور آپ نے اپنے کسی ساتھی کے سامنے کبھی پاؤں نہیں پھیلائے۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2490] کان إذا استقبلہ الرجل فصافحہ
إسنادہ ضعیف / جہ 3716   باب تواضعہ ﷺ مع جلیسہ
زید العمي : ضعیف (تقدم : 1442) وتلمیذہ عمران بن زید : لین (تق: 5156) وللحدیث شاہد ضعیف عندأبي داود : 4794`;
tirmizi.anwaar = [259,1];