var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ الْغِفَارِيُّ الْمَدَنِيُّ حَدَّثَنِي أَبِي عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثٌ مَنْ كُنَّ فِيهِ سَتَرَ اللَّهُ عَلَيْهِ كَنَفَهُ وَأَدْخَلَهُ جَنَّتَهُ رِفْقٌ بِالضَّعِيفِ وَشَفَقَةٌ عَلَى الْوَالِدَيْنِ وَإِحْسَانٌ إِلَى الْمَمْلُوكِ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَأَبُو بَكْرِ بْنُ الْمُنْكَدِرِ هُوَ أَخُو مُحَمَّدُ بْنُ الْمُنْكَدِرِ";
tirmizi.urdu = "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' تین خصلتیں ایسی ہیں کہ یہ جس کے اندر پائی جائیں تو قیامت کے روز اللہ اپنی رحمت کے سایہ تلے رکھے گا،اور اسے اپنی جنت میں داخل کرے گا۔(أ) ضعیفوں کے ساتھ نرم برتاؤکرے (ب) ماں باپ کے ساتھ شفقت ومحبت کابرتاؤ کرے،(ج) لونڈیوں اور غلاموں پر احسان کرے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2494] ثلاث من کن فیہ نشر اللّٰہ علیہ کنفہ
إسنادہ ضعیف جدًا    باب في أربعۃ أحادیث
عبد اللّٰہ بن إبراہیم :متروک ونسبہ ابن حبان إلی الوضع وأبوہ مجہول (تق:3199،225) `;
tirmizi.anwaar = [259,1];