var tirmizi = {};
tirmizi.arabic = "";
tirmizi.urdu = "حارث بن سوید کہتے ہیں کہ ہم سے عبداللہ بن مسعود رضی اللہ عنہ نے دوحدیثیں بیان کیں،ایک اپنی طرف سے اور دوسری نبی اکرم ﷺ کی طرف سے (یعنی ایک موقوف اور دوسری مرفوع) عبداللہ بن مسعود رضی اللہ عنہ نے کہا: مومن اپنے گناہ کو ایسادیکھتا ہے گویاوہ پہاڑ کی جڑ میں ہے۔ڈرتاہے کہ اس پر وہ گر نہ پڑے ۱؎،اور فاجر اپنے گناہ کو ایک مکھی کے مانند دیکھتاہے جو اس کی ناک پر بیٹھی ہوئی ہے،اس نے ہاتھ سے اشارہ کیا اور وہ اڑگئی ۲؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;