var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ حَدَّثَنَا عَلِيُّ بْنُ مَسْعَدَةَ الْبَاهِلِيُّ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ ابْنِ آدَمَ خَطَّاءٌ وَخَيْرُ الْخَطَّائِينَ التَّوَّابُونَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَلِيِّ بْنِ مَسْعَدَةَ عَنْ قَتَادَةَ";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں کہ نبی اکرم ﷺ نے فرمایا:' سارے انسان خطا کارہیں اور خطاکاروں میں سب سے بہتروہ ہیں جو توبہ کرنے والے ہیں'۔امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-اسے ہم صرف علی بن مسعدہ ہی کی روایت سے جانتے ہیں جسے وہ قتادہ سے روایت کرتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2499] کل ابن آدم خطاء
إسنادہ ضعیف/ جہ 4251    باب في استعظام المؤمن ذنوبہ
قتادۃ عنعن ( تقدم : 30) وفی السند علۃ أخری ذکرھا الذھبي في تلخیص المستدرک (244/4)`;
tirmizi.anwaar = [260,1];