var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ سَنَةٍ وَفِي الْبَاب عَنْ أَنَسٍ وَأَبِي سَعِيدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' جنت میں ایسے درخت ہیں کہ سوار ان کے سایہ میں سوبرس تک چلتا رہے (پھربھی اس کاسایہ ختم نہ ہوگا')۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث صحیح ہے،۲-اس باب میں انس اور ابوسعیدخدری رضی اللہ عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "متفق علیہ — صحیح بخاری و صحیح مسلم";
tirmizi.description = ``;