var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ لَوْ أَنَّ الْعَالَمِينَ اجْتَمَعُوا فِي إِحْدَاهُنَّ لَوَسِعَتْهُمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:'جنت میں سودرجے ہیں،اگرسارے جہاں کے لوگ ایک ہی درجہ میں اکٹھے ہوجائیں تویہ ان سب کے لیے کافی ہوگا'۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2532] لو أن العالمین اجتمعوا
تعدیلات:
إسنادہ ضعیف
باب ماجاء في صفۃ درجات الجنۃ 
ابن لھیعۃ مدلس و عنعن و حدث بہ قبل اختلاطہ ولم تثبت متابعۃ عمرو بن الحارث لہ و باقي السند حسن لذاتہ۔`;
tirmizi.anwaar = [261,1];