var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ قَالَ: حَدَّثَنَا أَبُو الأَحْوَصِ،عَنْ عَطَاءِ بْنِ السَّائِبِ،عَنْ عَمْرِو بْنِ مَيْمُونٍ،عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ،«نَحْوَهُ بِمَعْنَاهُ وَلَمْ يَرْفَعْهُ،وَهَذَا أَصَحُّ مِنْ حَدِيثِ عَبِيدَةَ بْنِ حُمَيْدٍ» وَهَكَذَا رَوَى جَرِيرٌ وَغَيْرُ وَاحِدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ وَلَمْ يَرْفَعُوهُ [ص:677] حَدَّثَنَا قُتَيْبَةُ قَالَ: حَدَّثَنَا جَرِيرٌ،عَنْ عَطَاءِ بْنِ السَّائِبِ،نَحْوَ حَدِيثِ أَبِي الأَحْوَصِ «وَلَمْ يَرْفَعْهُ أَصْحَابُ عَطَاءٍ،وَهَذَا أَصَحُّ»";
tirmizi.urdu = "اس سند سے بھی عبد اللہ بن مسعود رضی اللہ عنہ سے اسی جیسی حدیث مروی ہے،اور اسے (ابوالاحوص نے) مرفوع نہیں کیا،یہ عبیدہ بن حمیدکی روایت سے زیادہ صحیح ہے۔اسی طرح جریر اورکئی لوگوں نے عطاء بن سائب سے اسے غیر مرفوع روایت کی ہے۔ہم سے قتیبہ نے بیان کیا،وہ کہتے ہیں: ہم سے جریر نے عطا بن سائب سے ابوالا ٔحوص کی حدیث کی طرح بیان کیا،اور عطا کے (دیگر) شاگردوں نے اسے مرفوع نہیں کیا۔یہی زیادہ صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔2534] إن المرأۃ من نساء أھل الجنۃ
إسنادہ ضعیف باب ما جاء في صفۃ نساء أھل الجنۃ
عطاء بن السائب اختلط (تقدم : 184) ولم یحدث بہ قبل اختلاطہ۔`;
tirmizi.anwaar = [261,1];