var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْفَضْلُ بْنُ الصَّبَّاحِ الْبَغْدَادِيُّ حَدَّثَنَا مَعْنُ بْنُ عِيسَى الْقَزَّازُ عَنْ خَالِدِ بْنِ أَبِي بَكْرٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَابُ أُمَّتِي الَّذِي يَدْخُلُونَ مِنْهُ الْجَنَّةَ عَرْضُهُ مَسِيرَةُ الرَّاكِبِ الْمُجَوِّدِ ثَلَاثًا ثُمَّ إِنَّهُمْ لَيُضْغَطُونَ عَلَيْهِ حَتَّى تَكَادُ مَنَاكِبُهُمْ تَزُولُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ قَالَ سَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ و قَالَ لِخَالِدِ بْنِ أَبِي بَكْرٍ مَنَاكِيرُ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' وہ دروازہ جس سے میری امت جنت میں داخل ہوگی اس کی چوڑائی تیزرفتار گھوڑسوار کے تین دن کی مسافت کے برابر ہوگی،پھربھی دروازے پرایسی بھیڑبھاڑ ہوگی کہ ان کے کندھے اترنے کے قریب ہوں گے'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-میں نے محمد بن اسماعیل بخاری سے اس حدیث کے بارے میں پوچھا تووہ اسے نہیں جان سکے اور کہا: سالم بن عبداللہ کے واسطہ سے خالدبن ابی بکر کی کئی منکر احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2548] باب أمتي الذي یدخلون منہ الجنۃ
إسنادہ ضعیف باب ما جاء في صفۃ أبواب الجنۃ
خالد بن أبي بکر : فیہ لین ( تق : 1618) وعدّ الذھبي ھذا الحدیث من مناکیرہ (میزان الإعتدال 628/1) `;
tirmizi.anwaar = [261,2];