var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ يَرْفَعُهُ قَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ أُتِيَ بِالْمَوْتِ كَالْكَبْشِ الْأَمْلَحِ فَيُوقَفُ بَيْنَ الْجَنَّةِ وَالنَّارِ فَيُذْبَحُ وَهُمْ يَنْظُرُونَ فَلَوْ أَنَّ أَحَدًا مَاتَ فَرَحًا لَمَاتَ أَهْلُ الْجَنَّةِ وَلَوْ أَنَّ أَحَدًا مَاتَ حُزْنًا لَمَاتَ أَهْلُ النَّارِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوسعیدخدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرم(ﷺ) نے فرمایا:' قیامت کے دن موت کو چتکبرے مینڈھے کی طرح لایا جائے گا اور جنت وجہنم کے درمیان کھڑی کی جائے گی پھر وہ ذبح کی جائے گی،اورجنتی وجہنمی دیکھ رہے ہوں گے،سو اگر کوئی خوشی سے مرنے والا ہوتا توجنتی مرجاتے اور اگرکوئی غم سے مرنے والا ہوتا تو جہنمی مرجاتے'۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2558] إذا کان یوم القیامۃ أتي بالموت
إسنادہ ضعیف باب ما جاء في خلود أھل الجنۃ وأھل النار
عطیۃ : ضعیف (تقدم : 477) ولأصل الحدیث شواہد دون قولہ : ولو أن أحدًا مات۔۔۔إلخ`;
tirmizi.anwaar = [262,1];