var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ فِي قَوْلِهِ عَزَّ وَجَلَّ فَهُمْ فِي رَوْضَةٍ يُحْبَرُونَ قَالَ السَّمَّاعُ وَمَعْنَى السَّمَّاعِ مِثْلَ مَا وَرَدَ فِي الْحَدِيثِ أَنَّ الْحُورَ الْعِينَ يُرَفِّعْنَ بِأَصْوَاتِهِنَّ";
tirmizi.urdu = "یحیی بن ابی کثیر آیت کریمہ:فَہُمْ فِی رَوْضَۃٍ یُحْبَرُونَ (وہ جنت میں خوش کردیئے جائیں گے) کے بارے میں کہتے ہیں: اس سے مراد سماع ہے اور سماع کامفہوم وہی ہے جو حدیث میں آیا ہے کہ حورعین اپنے نغمے کی آواز بلند کریں گی۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;