var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ قَالَ: حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ قَالَ: حَدَّثَنَا عُبَيْدُ اللَّهِ،عَنْ أَبِي الزِّنَادِ،عَنِ الأَعْرَجِ،عَنْ أَبِي هُرَيْرَةَ،عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ،إِلَّا أَنَّهُ قَالَ: «يَحْسِرُ عَنْ جَبَلٍ مِنْ ذَهَبٍ»: «هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ»";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے اس سند سے بھی نبی اکرم ﷺ سے اسی جیسی حدیث روایت کی ہے،مگر اس میں یہ فرق ہے کہ آپ نے فرمایا:' سونے کا پہاڑ اُگلے'۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;