var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا شَيْبَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ غِلَظَ جِلْدِ الْكَافِرِ اثْنَانِ وَأَرْبَعُونَ ذِرَاعًا وَإِنَّ ضِرْسَهُ مِثْلُ أُحُدٍ وَإِنَّ مَجْلِسَهُ مِنْ جَهَنَّمَ كَمَا بَيْنَ مَكَّةَ وَالْمَدِينَةِ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ الْأَعْمَشِ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' کافر کے چمڑے کی موٹائی بیالیس گز ہوگی،اس کی ڈاڑھ احد پہاڑ جیسی ہوگی اور جہنم میں اس کے بیٹھنے کی جگہ اتنی ہوگی جتنا مکہ اور مدینہ کے درمیان کا فاصلہ '۔\nامام ترمذی کہتے ہیں: یہ حدیث اعمش کی روایت سے حسن صحیح غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2577] إن غلظ جلد الکافر
إسنادہ ضعیف باب ما جاء في عظم أھل النار
الأعمش مدلس وعنعن ( تقدم : 169 ) وللحدیث شواھد عند أحمد ( 328/3،334) وغیرہ دون قول ’’ مکۃ والمدینۃ ‘‘ وھٰذہ اللفظۃ منکرۃ والحدیث الآتي ( الأصل : 2578 ) یغني عنہ۔`;
tirmizi.anwaar = [262,1];