var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ قَالَ: حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ،عَنِ الأَعْمَشِ،بِهَذَا الإِسْنَادِ نَحْوَهُ،وَقَالَ: «بَيْنَ العَبْدِ وَبَيْنَ الشِّرْكِ أَوِ الكُفْرِ تَرْكُ الصَّلَاةِ»: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،وَأَبُو سُفْيَانَ اسْمُهُ: طَلْحَةُ بْنُ نَافِعٍ";
tirmizi.urdu = "جابر رضی اللہ عنہ سے اس سند سے مروی ہے کہ نبی اکرم ﷺنے فرمایا:' بندے اور شرک یا بندے اور کفر کے درمیان فرق کرنے والی چیز صلاۃ کا چھوڑ دینا ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;