var tirmizi = {};
tirmizi.arabic = "قَالَ: و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا عَبْدُالرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ شُعْبَةَ: نَحْوَهُ.\nوَقَدْ رُوِيَ عَنْ حُذَيْفَةَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ أَنَّهُ صَلَّى بِاللَّيْلِ مَعَ النَّبِيِّ ﷺ،فَذَكَرَ الْحَدِيثَ";
tirmizi.urdu = "اس سند سے بھی شعبہ سے اسی طرح مروی ہے۔حذیفہ رضی اللہ عنہ سے یہ حدیث دوسری سندوں سے بھی مروی ہے کہ انہوں نے نبی اکرمﷺ کے ساتھ صلاۃِ تہجد پڑھی،پھر روای نے پوری حدیث ذکر کی۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;