var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا إِسْمَعِيلُ بْنُ أَبِي أُوَيْسٍ حَدَّثَنِي كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفِ بْنِ زَيْدِ بْنِ مِلْحَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الدِّينَ لَيَأْرِزُ إِلَى الْحِجَازِ كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا وَلَيَعْقِلَنَّ الدِّينُ مِنْ الْحِجَازِ مَعْقِلَ الْأُرْوِيَّةِ مِنْ رَأْسِ الْجَبَلِ إِنَّ الدِّينَ بَدَأَ غَرِيبًا وَيَرْجِعُ غَرِيبًا فَطُوبَى لِلْغُرَبَاءِ الَّذِينَ يُصْلِحُونَ مَا أَفْسَدَ النَّاسُ مِنْ بَعْدِي مِنْ سُنَّتِي قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عمرو بن عوف رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:'(ایک وقت آئے گا کہ) دین اسلام حجاز میں سمٹ کررہ جائے گا جس طرح کہ سانپ اپنے سوراخ میں سمٹ کر بیٹھ جاتاہے۔اور یقینا دین حجاز میں آکر ایسے ہی محفوظ ہوجائے گا جس طرح پہاڑی بکری پہاڑی کی چوٹی پر چڑھ کر محفوظ ہوجاتی ہے ۱؎،دین اجنبی حالت میں آیا اور وہ پھر اجنبی حالت میں جائے گا،خوش خبری اور مبارک بادی ہے ایسے گمنام مصلحین کے لیے جو میرے بعد میری سنت میں لوگوں کی پیداکردہ خرابیوں اور برائیوں کی اصلاح کرتے ہیں'۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2630] إن الدین لیأرز إلی الحجاز
إسنادہ ضعیف جدًا
باب ما جاء أن الإسلام بدأ غریبًا وسیعود غریبًا
کثیر بن عبداﷲ : ضعیف متروک ( تقدم : 490 ) `;
tirmizi.anwaar = [264,1];