var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ عَلِيِّ بْنِ عَبْدِ الْأَعْلَى عَنْ أَبِي النُّعْمَانِ عَنْ أَبِي وَقَّاصٍ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَعَدَ الرَّجُلُ وَيَنْوِي أَنْ يَفِيَ بِهِ فَلَمْ يَفِ بِهِ فَلَا جُنَاحَ عَلَيْهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ عَلِيُّ بْنُ عَبْدِ الْأَعْلَى ثِقَةٌ وَلَا يُعْرَفُ أَبُو النُّعْمَانِ وَلَا أَبُو وَقَّاصٍ وَهُمَا مَجْهُولَانِ";
tirmizi.urdu = "زید بن ارقم رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' جب آدمی کسی سے وعدہ کرے اور اس کی نیت یہ ہوکہ وہ اپناوعدہ پوراکرے گا لیکن وہ (کسی عذر ومجبوری سے) پورانہ کرسکا تو اس پرکوئی گناہ نہیں ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-اس کی اسناد قوی نہیں ہے،۳-علی بن عبدالاعلی ثقہ ہیں،ابونعمان اور ابووقاص غیر معروف ہیں اور دونوں ہی مجہول راوی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2633] إذا وعد الرجل وینوي أن یفي
إسنادہ ضعیف/د 4995  باب ما جاء في علامۃ المنافق`;
tirmizi.anwaar = [264,1];