var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا رَجُلٍ قَالَ لِأَخِيهِ كَافِرٌ فَقَدْ بَاءَ بِهِ أَحَدُهُمَا هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَمَعْنَى قَوْلِهِ بَاءَ يَعْنِي أَقَرَّ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' اگرکسی نے اپنے مسلمان بھائی کو کافر کہا تو ان دونوں میں سے ایک نے (گویاکہ) اپنے کافر ہونے کا اقرار کرلیا ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح غریب ہے،۲-' باء ' 'أقر' کے معنی میں ہے،یعنی اقرار کیا۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;