var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يُرِدْ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ وَفِي الْبَاب عَنْ عُمَرَ وَأَبِي هُرَيْرَةَ وَمُعَاوِيَةَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' جس کے ساتھ اللہ بھلائی کا ارادہ فرماتاہے،تو اسے دین کی سمجھ عطاکردیتاہے ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں عمر،ابوہریرہ،اور معاویہ رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;