var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ الْعَتَكِيُّ عَنْ أَبِي جَعْفَرٍ الرَّازِيِّ عَنْ الرَّبِيعِ بْنِ أَنَسٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ خَرَجَ فِي طَلَبِ الْعِلْمِ كَانَ فِي سَبِيلِ اللَّهِ حَتَّى يَرْجِعَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَرَوَاهُ بَعْضُهُمْ فَلَمْ يَرْفَعْهُ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' جو شخص علم حاصل کرنے کے لیے نکلے تو وہ لوٹنے تک اللہ کی راہ میں(شمار) ہو گا' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-بعض اہل علم نے اسے غیر مرفوع روایت کیاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2647] من خرج في طلب العلم
إسنادہ ضعیف باب فضل طلب العلم
أبو جعفر الرازي ضعیف عن الربیع بن أنس و حسن الحدیث عن غیرہ ( وانظر د 1182 ) [وانظر ص 317 ]
تعدیلات:
وروی الحاکم ( 91/1 ح 309) من حدیث أبي ھریرۃ عن النبي ﷺ قال : (( من جاء مسجدنا ھذا یتعلم خیرًا أو یعلمہ فھو کالمجاھد في سبیل اللّٰہ ومن جاء بغیر ھذا کان کالرجل یری الشئ یعجبہ و لیس لہ۔۔۔)) وسندہ حسن۔`;
tirmizi.anwaar = [264,1];