var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا نُوحُ بْنُ قَيْسٍ عَنْ أَبِي هَارُونَ الْعَبْدِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَأْتِيكُمْ رِجَالٌ مِنْ قِبَلِ الْمَشْرِقِ يَتَعَلَّمُونَ فَإِذَا جَاءُوكُمْ فَاسْتَوْصُوا بِهِمْ خَيْرًا قَالَ فَكَانَ أَبُو سَعِيدٍ إِذَا رَآنَا قَالَ مَرْحَبًا بِوَصِيَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ أَبِي هَارُونَ عَنْ أَبِي سَعِيدٍ";
tirmizi.urdu = "ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺنے فرمایا:' تمہارے پاس پورب سے لوگ علم حاصل کرنے کے لیے آئیں گے پس جب وہ تمہارے پاس آئیں تو ان کے ساتھ بھلائی کرنا۔راوی حدیث کہتے ہیں: ابوسعیدخدری رضی اللہ عنہ کا حال یہ تھا کہ جب وہ ہمیں (طالبان علم دین کو) دیکھتے تو رسول اللہ ﷺ کی وصیت کے مطابق ہمیں خوش آمدید کہتے۔امام ترمذی کہتے ہیں: ہم اس حدیث کو صرف ابو ہارون کی روایت سے جانتے ہیں اور وہ ابوسعیدخدری رضی اللہ عنہ سے روایت کرتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2651] یأتیکم رجال من قبل المشرق یتعلمون
إسنادہ ضعیف جدًا / انظر الحدیث السابق :2650 باب ما جاء فی الإستیصاء بمن یطلب العلم`;
tirmizi.anwaar = [265,1];