var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو الْأَشْعَثِ أَحْمَدُ بْنُ الْمِقْدَامِ الْعِجْلِيُّ الْبَصْرِيُّ حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ حَدَّثَنَا إِسْحَقُ بْنُ يَحْيَى بْنِ طَلْحَةَ حَدَّثَنِي ابْنُ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ طَلَبَ الْعِلْمَ لِيُجَارِيَ بِهِ الْعُلَمَاءَ أَوْ لِيُمَارِيَ بِهِ السُّفَهَاءَ أَوْ يَصْرِفَ بِهِ وُجُوهَ النَّاسِ إِلَيْهِ أَدْخَلَهُ اللَّهُ النَّارَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَإِسْحَقُ بْنُ يَحْيَى بْنِ طَلْحَةَ لَيْسَ بِذَاكَ الْقَوِيِّ عِنْدَهُمْ تُكُلِّمَ فِيهِ مِنْ قِبَلِ حِفْظِهِ";
tirmizi.urdu = "کعب بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کوفرماتے ہوئے سنا: 'جو شخص علم اس واسطے سیکھے کہ اس کے ذریعہ علماء کی برابری کرے ۱؎،کم علم اور بے وقوفوں سے بحث وتکرار کرے یا اس علم کے ذریعہ لوگوں کو اپنا گرویدہ بنالے تو ایسے شخص کو اللہ تعالیٰ جہنم میں داخل فرمائے گا ۲؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-اس حدیث کو ہم صرف اسی سند سے جانتے ہیں،۳-اسحاق بن یحیی بن طلحہ محدثین کے نزدیک کچھ بہت زیادہ قوی نہیں ہیں،ان کے حافظہ کے سلسلے میں کلام کیاگیا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2654] من طلب العلم لیجاري بہ العلماء
إسنادہ ضعیف باب فیمن یطلب بعلمہ الدنیا
إسحاق بن یحیی ضعیف ( تق :390) وللحدیث شواھد ضعیفۃ عند ابن ماجہ ( 253) وغیرہ۔`;
tirmizi.anwaar = [265,1];