var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ ابْنِ أَشْوَعَ عَنْ يَزِيدَ بْنِ سَلَمَةَ الْجُعْفِيِّ قَالَ قَالَ يَزِيدُ بْنُ سَلَمَةَ يَا رَسُولَ اللَّهِ إِنِّي قَدْ سَمِعْتُ مِنْكَ حَدِيثًا كَثِيرًا أَخَافُ أَنْ يُنْسِيَنِي أَوَّلَهُ آخِرُهُ فَحَدِّثْنِي بِكَلِمَةٍ تَكُونُ جِمَاعًا قَالَ اتَّقِ اللَّهَ فِيمَا تَعْلَمُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ وَهُوَ عِنْدِي مُرْسَلٌ وَلَمْ يُدْرِكْ عِنْدِي ابْنُ أَشْوَعَ يَزِيدَ بْنَ سَلَمَةَ وَابْنُ أَشْوَعَ اسْمُهُ سَعِيدُ بْنُ أَشْوَعَ";
tirmizi.urdu = "یزید بن سلمہ جعفی کہتے ہیں کہ میں نے کہا: اللہ کے رسول! میں نے بہت سی حدیثیں آپ سے سنی ہیں،میں ڈرتاہوں کہ کہیں بعد کی حدیثیں شروع کی حدیثوں کو بھلا نہ دیں،آپ مجھے کوئی ایسا کلمہ (کوئی ایسی بات) بتادیجئے جودونوں (اول وآخر) کو ایک ساتھ باقی رکھنے کا ذریعہ بنے۔آپ نے فرمایا:' جو کچھ بھی تم جانتے ہوان کے متعلق اللہ کا خوف وتقویٰ ملحوظ رکھو ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث ایسی ہے جس کی سندمتصل نہیں ہے،یہ حدیث میرے نزدیک مرسل ہے۔۲-میرے نزدیک ابن اُشوع نے یزید بن سلمی (کے دور) کو نہیں پایا ہے،۳-ابن اُشوع کانام سعید بن اشوع ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2683] اتق اللّٰہ فیما تعلم
إسنادہ ضعیف باب ما جاء في فضل الفقہ علی العبادۃ
السند منقطع کما بینہ المصنف رحمہ اللّٰہ۔`;
tirmizi.anwaar = [266,1];