var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكَلِمَةُ الْحِكْمَةُ ضَالَّةُ الْمُؤْمِنِ فَحَيْثُ وَجَدَهَا فَهُوَ أَحَقُّ بِهَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَإِبْرَاهِيمُ بْنُ الْفَضْلِ الْمَدَنِيُّ الْمَخْزُومِيُّ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' حکمت کی بات مومن کی گم شدہ چیز ہے جہاں کہیں بھی اسے پائے وہ اسے حاصل کرلینے کا زیادہ حق رکھتاہے'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-ہم اسے صرف اسی سند سے جانتے ہیں،۳-ابراہیم بن فضل مدنی مخزومی حدیث بیان کرنے میں حفط کے تعلق سے کمزور مانے جاتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2687] الکلمۃ الحکمۃ ضالۃ المؤمن
إسنادہ ضعیف جدًا /جہ 4169   باب ما جاء في فضل الفقہ علی العبادۃ
إبراہیم بن الفضل : متروک ( تق: 228) `;
tirmizi.anwaar = [266,1];