var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو حَاتِمٍ الْبَصْرِيُّ الْأَنْصَارِيُّ مُسْلِمُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بُنَيَّ إِذَا دَخَلْتَ عَلَى أَهْلِكَ فَسَلِّمْ يَكُنْ بَرَكَةً عَلَيْكَ وَعَلَى أَهْلِ بَيْتِكَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے مجھ سے فرمایا:' بیٹے! جب تم اپنے گھر والوں کے پاس جاؤ تو انہیں سلام کیا کرو،یہ سلام تمہار ے لیے اور تمہارے گھروالوں کے لیے خیر وبرکت کا باعث ہوگا ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2698] یا بني ! إذا دخلت علی أھلک فسلم
إسنادہ ضعیف /تقدم طرفہ: 2678    باب ما جاء فی التسلیم إذا دخل بیتہ`;
tirmizi.anwaar = [266,1];