var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْفَضْلُ بْنُ الصَّبَّاحِ بَغْدَادِيٌّ حَدَّثَنَا سَعِيدُ بْنُ زَكَرِيَّا عَنْ عَنْبَسَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُحَمَّدِ بْنِ زَاذَانَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّلَامُ قَبْلَ الْكَلَامِ وَبِهَذَا الْإِسْنَادِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَدْعُوا أَحَدًا إِلَى الطَّعَامِ حَتَّى يُسَلِّمَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ مُنْكَرٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ و سَمِعْت مُحَمَّدًا يَقُولُ عَنْبَسَةُ بْنُ عَبْدِ الرَّحْمَنِ ضَعِيفٌ فِي الْحَدِيثِ ذَاهِبٌ وَمُحَمَّدُ بْنُ زَاذَانَ مُنْكَرُ الْحَدِيثِ";
tirmizi.urdu = "جابر بن عبداللہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' بات چیت شروع کرنے سے پہلے سلام کیاکرو'۔اور اسی سند سے نبی اکرم ﷺ سے یہ بھی روایت ہے کہ آپ نے فرمایا:' کسی کو کھانے پر نہ بلاؤ جب تک کہ وہ سلام نہ کرلے'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث منکر ہے ہم اس حدیث کو اس سند کے سوا کسی اور سند سے نہیں جانتے،۲-میں نے محمدبن اسماعیل بخاری کو کہتے ہوئے سناہے کہ عنبسہ بن عبدالرحمٰن حدیث بیان کرنے میں ضعیف اور بہکنے والے،اور محمد بن زاذان منکرالحدیث ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2699] السلام قبل الکلام
إسنادہ ضعیف جدًا    باب ما جاء فی السلام قبل الکلام
عنبسۃ متروک ( تقدم : 1856) ومحمد بن زاذان : متروک ( تق: 5882) `;
tirmizi.anwaar = [266,1];