var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ أَنْبَأَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ اسْتَأْذَنْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دَيْنٍ كَانَ عَلَى أَبِي فَقَالَ مَنْ هَذَا فَقُلْتُ أَنَا فَقَالَ أَنَا أَنَا كَأَنَّهُ كَرِهَ ذَلِكَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "جابر رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم ﷺ سے ایک قرض کے سلسلے میں جو میرے والد کے ذمہ تھا کچھ بات کرنے کے لیے آپ کے پاس حاضر ہونے کی اجازت مانگی تو آپ نے کہا: ' کون ہے؟'۔میں نے کہا: میں ہوں،آپ نے فرمایا:' میں میں (کیاہے؟) ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;