var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ عَنْ عَنْبَسَةَ عَنْ مُحَمَّدِ بْنِ زَاذَانَ عَنْ أُمِّ سَعْدٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ يَدَيْهِ كَاتِبٌ فَسَمِعْتُهُ يَقُولُ ضَعْ الْقَلَمَ عَلَى أُذُنِكَ فَإِنَّهُ أَذْكَرُ لِلْمُمْلِي قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَهُوَ إِسْنَادٌ ضَعِيفٌ وَعَنْبَسَةُ بْنُ عَبْدِ الرَّحْمَنِ وَمُحَمَّدُ بْنُ زَاذَانَ يُضَعَّفَانِ فِي الْحَدِيثِ";
tirmizi.urdu = "زید بن ثابت رضی اللہ عنہ کہتے ہیں: میں رسول اللہ ﷺ کے پاس پہنچا۔آپ کے سامنے ایک کاتب بیٹھا ہواتھا۔میں نے سنا آپ اس سے فرمارہے تھے: تم اپنا قلم اپنے کان پر رکھے رہاکرو کیوں کہ اس سے لکھوانے والوں کو آگاہی ویاددہانی ہوجایاکرے گی'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-ہم اسے صرف اسی سند سے جانتے ہیں اور یہ سند ضعیف ہے،۳-عنبسہ بن عبدالرحمٰن اور محمد بن زاذان،دونوں حدیث بیان کرنے میں ضعیف قراردیئے گئے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2714] ضع القلم علی أذنک
إسنادہ ضعیف جدًا    باب [حدیث : ضع القلم علی أذنک ]
عنبسۃ وشیخہ محمد بن زاذان : متروکان ( تقدما : 2699)`;
tirmizi.anwaar = [267,1];