var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ الْأَجْلَحِ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمَيْنِ يَلْتَقِيَانِ فَيَتَصَافَحَانِ إِلَّا غُفِرَ لَهُمَا قَبْلَ أَنْ يَفْتَرِقَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ الْبَرَاءِ مِنْ غَيْرِ وَجْهٍ وَالْأَجْلَحُ هُوَ ابْنُ عَبْدِ اللَّهِ بْنِ حُجَيَّةَ بْنِ عَدِيٍّ الْكِنْدِيُّ";
tirmizi.urdu = "-براء بن عازب رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:'جب دومسلمان آپس میں ایک دوسرے سے ملتے اور (سلام) ومصافحہ کرتے ہیں تو ان دونوں کے ایک دوسرے سے علیحدہ اور جداہونے سے پہلے انہیں بخش دیاجاتا ہے ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-یہ حدیث براء سے متعدد سندوں سے بھی مروی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2727] ما من مسلمین یلتقیان
إسنادہ ضعیف/ د 5212،جہ 3703    باب ما جاء فی المصافحۃ`;
tirmizi.anwaar = [267,1];