var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا حَنْظَلَةُ بْنُ عُبَيْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ الرَّجُلُ مِنَّا يَلْقَى أَخَاهُ أَوْ صَدِيقَهُ أَيَنْحَنِي لَهُ قَالَ لَا قَالَ أَفَيَلْتَزِمُهُ وَيُقَبِّلُهُ قَالَ لَا قَالَ أَفَيَأْخُذُ بِيَدِهِ وَيُصَافِحُهُ قَالَ نَعَمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں: ایک آدمی نے پوچھا: اللہ کے رسول!ہمارا آدمی اپنے بھائی سے یا اپنے دوست سے ملتاہے تو کیا وہ اس کے سامنے جھکے؟ آپ نے فرمایا:' نہیں'،اس نے پوچھا:کیا وہ اس سے چمٹ جائے اور اس کا بوسہ لے؟ آپ نے فرمایا:' نہیں'،اس نے کہا: پھر توو ہ اس کاہاتھ پکڑے اور مصافحہ کرے،آپ نے فرمایا:'ہاں' (بس اتنا ہی کافی ہے) ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2728] قال رجل یا رسول اللّٰہ ! الرجل منا یلقی
إسنادہ ضعیف/جہ 3702 باب ما جاء فی المصافحۃ
حنظلۃ السدوسي : ضعیف (تق: 1583) ولبعض الحدیث شواہد ضعیفۃ۔`;
tirmizi.anwaar = [267,1];