var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ أَبِي الْيَقْظَانِ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِيهِ عَنْ جَدِّهِ رَفَعَهُ قَالَ الْعُطَاسُ وَالنُّعَاسُ وَالتَّثَاؤُبُ فِي الصَّلَاةِ وَالْحَيْضُ وَالْقَيْءُ وَالرُّعَافُ مِنْ الشَّيْطَانِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ شَرِيكٍ عَنْ أَبِي الْيَقْظَانِ قَالَ وَسَأَلْتُ مُحَمَّدَ بْنَ إِسْمَعِيلَ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قُلْتُ لَهُ مَا اسْمُ جَدِّ عَدِيٍّ قَالَ لَا أَدْرِي وَذُكِرَ عَنْ يَحْيَى بْنِ مَعِينٍ قَالَ اسْمُهُ دِينَارٌ";
tirmizi.urdu = "ثابت کے باپ روایت کرتے ہیں کہ نبی اکرمﷺنے فرمایا:' صلاۃ میں چھینک،اونگھ،جمائی،حیض،قے اور نکسیر شیطان کی طرف سے ہوتاہے'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-ہم اسے صرف شریک کی روایت جانتے ہیں جسے وہ ابوالیقظان سے روایت کرتے ہیں،۳-میں نے محمد بن اسماعیل بخاری سے اس روایت ' عن عدی بن ثابت عن ابیہ عن جدہ' کے تعلق سے پوچھا کہ عدی کے دادا کاکیانام ہے؟ تو انہوں نے کہا کہ میں نہیں جانتا،لیکن یحییٰ بن معین سے پوچھاگیا تو انہوں نے کہاکہ ان کانام دینارہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2748] العطاس والنعاس والتثاؤب
إسنادہ ضعیف / جہ 969    باب ما جاء أن العطاس فی الصلوۃ من الشیطان
أبو الیقظان : ضعیف مدلس ( تقدم :126) `;
tirmizi.anwaar = [268,1];