var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى أَبُو مُحَمَّدٍ صَاحِبُ الدَّقِيقِ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ وَقَّتَ لَهُمْ فِي كُلِّ أَرْبَعِينَ لَيْلَةً تَقْلِيمَ الْأَظْفَارِ وَأَخْذَ الشَّارِبِ وَحَلْقَ الْعَانَةِ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں: نبی اکرمﷺ نے لوگوں کے لیے مدت متعین فرمادی ہے کہ ہرچالیس دن کے اندر ناخن کاٹ لیں۔مونچھیں کتروا لیں۔اور ناف سے نیچے کے بال مونڈ لیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2758] أنہ وقت لھم في کل أربعین
إسنادہ ضعیف/ د 4200 باب فی التوقیت في تقلیم الأظفار`;
tirmizi.anwaar = [268,1];