var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْفُوا الشَّوَارِبَ وَأَعْفُوا اللِّحَى قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺنے فرمایا:'مونچھیں کاٹو اور ڈاڑھیاں بڑھاؤ'۔\nامام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "متفق علیہ — صحیح بخاری و صحیح مسلم";
tirmizi.description = ``;