var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُاللهِ بْنُ عَبْدِالرَّحْمَنِ،أَخْبَرَنَا مُعَلَّى بْنُ أَسَدٍ،حَدَّثَنَا وُهَيْبٌ،عَنْ مُحَمَّدِ ابْنِ عَجْلاَنَ،عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ،عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ،عَنْ أَبِيهِ أَنَّ النَّبِيَّ ﷺ أَمَرَ بِوَضْعِ الْيَدَيْنِ وَنَصْبِ الْقَدَمَيْنِ";
tirmizi.urdu = "سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے دونوں ہاتھوں کو (زمین پر)رکھنے اور دونوں پاؤں کوکھڑے رکھنے کا حکم دیاہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;