var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظْرَةِ الْفُجَاءَةِ فَأَمَرَنِي أَنْ أَصْرِفَ بَصَرِي قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو زُرْعَةَ بْنُ عَمْرٍو اسْمُهُ هَرِمٌ";
tirmizi.urdu = "جریر بن عبداللہ رضی اللہ عنہ کہتے ہیں: میں نے رسول اللہ ﷺ سے (کسی اجنبیہ عورت پر) اچانک پڑجانے والی نظر سے متعلق پوچھا۔تو آپ نے فرمایا:' تم اپنی نگاہ پھیر لیاکرو' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;