var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى الْمَرْوَزِيُّ،أَخْبَرَنَا عَبْدُاللهِ بْنُ الْمُبَارَكِ،أَخْبَرَنَا شُعْبَةُ،عَنْ الْحَكَمِ،عَنْ عَبْدِالرَّحْمَنِ بْنِ أَبِي لَيْلَى،عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: كَانَتْ صَلاَةُ رَسُولِ اللهِ ﷺ إِذَا رَكَعَ،وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ،وَإِذَا سَجَدَ،وَإِذَا رَفَعَ رَأْسَهُ مِنْ السُّجُودِ قَرِيبًا مِنْ السَّوَاءِ. قَالَ: وَفِي الْبَاب عَنْ أَنَسٍ";
tirmizi.urdu = "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ رسو ل اللہ ﷺ جب رکوع کرتے،جب رکوع سے سراٹھاتے،جب سجدہ کرتے اور جب سجدہ سے سراٹھاتے تو آپ کی صلاۃ تقریباً برابربرابرہوتی تھی ۱؎۔\nامام ترمذی کہتے ہیں: اس باب میں انس رضی اللہ عنہ سے بھی حدیث ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;