var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ الْحَسَنِ بْنِ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ عَبْدِ اللَّهِ بْنِ جَرْهَدٍ الْأَسْلَمِيِّ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْفَخِذُ عَوْرَةٌ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "جرہد اسلمی رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:' ران ستر(چھپانے کی چیز) ہے'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث اس سند سے حسن غریب ہے،۲-اس باب میں علی اور محمد بن عبداللہ بن جحش سے بھی احادیث آئی ہیں۔اور عبداللہ بن جحش اوران کے بیٹے محمد رضی اللہ عنہما دونوں صحابی رسول ہیں۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;