var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى الْكُوفِيُّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ إِسْرَائِيلَ عَنْ أَبِي يَحْيَى عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْفَخِذُ عَوْرَةٌ وَفِي الْبَاب عَنْ عَلِيٍّ وَمُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ جَحْشٍ وَلِعَبْدِ اللَّهِ بْنِ جَحْشٍ صُحْبَةٌ وَلِابْنِهِ مُحَمَّدٍ صُحْبَةٌ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' ران بھی ستر (چھپانے کی چیز)ہے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = `مشکوۃ المصابیح: 3114`;