var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ نِيْزَكَ الْبَغْدَادِيُّ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا أَبُو مُحَيَّاةَ عَنْ لَيْثٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِيَّاكُمْ وَالتَّعَرِّيَ فَإِنَّ مَعَكُمْ مَنْ لَا يُفَارِقُكُمْ إِلَّا عِنْدَ الْغَائِطِ وَحِينَ يُفْضِي الرَّجُلُ إِلَى أَهْلِهِ فَاسْتَحْيُوهُمْ وَأَكْرِمُوهُمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَأَبُو مُحَيَّاةَ اسْمُهُ يَحْيَى بْنُ يَعْلَى";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' تم لوگ ننگے ہونے سے بچو،کیوں کہ تمہارے ساتھ وہ (فرشتے) ہوتے ہیں جو تم سے جدانہیں ہوتے۔وہ تو صرف اس وقت جداہوتے ہیں جب آدمی پاخانہ جاتاہے یا اپنی بیوی کے پاس جاکر اس سے ہم بستر ہوتاہے۔اس لیے تم ان (فرشتوں) سے شرم کھاؤ اور ان کی عزت کرو'۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2800] إیاکم والتعري فإن معکم من لا یفارقکم
إسنادہ ضعیف باب ما جاء فی الإستتار عند الجماع
لیث بن أبي سلیم : ضعیف (تقدم : 218) `;
tirmizi.anwaar = [269,1];