var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ هُبَيْرَةَ بْنِ يَرِيمَ قَالَ قَالَ عَلِيٌّ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَاتَمِ الذَّهَبِ وَعَنْ الْقَسِّيِّ وَعَنْ الْمِيثَرَةِ وَعَنْ الْجِعَةِ قَالَ أَبُو الْأَحْوَصِ وَهُوَ شَرَابٌ يُتَّخَذُ بِمِصْرَ مِنْ الشَّعِيرِ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے منع فرمایا ہے (مردوں کو) سونے کی انگوٹھی پہننے سے،قسی کے (ریشم ملے ہوئے) کپڑے پہننے سے،زین پر رکھنے والی ریشمی گدیلے سے اور جَو کی نبیذ سے۔\nابوالا ٔحوص کہتے ہیں 'جعہ ' ایک شراب ہے جو مصر میں جَو سے بنائی جاتی ہے۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;