var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَسُوا الْبَيَاضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَابْنِ عُمَرَ";
tirmizi.urdu = "سمرہ بن جندب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' سفید کپڑے پہنو،کیوں کہ یہ پاکیزہ اور عمدہ لباس ہیں،اور انہیں سفید کپڑوں کا اپنے مردوں کو کفن دو ' ۱؎۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن عباس اور ابن عمر رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[2810] فإنھا أطھر و أطیب
سندہ ضعیف / جہ 3567 باب ماجاء في لبس البیاض
حبیب بن أبي ثابت مدلس ( تقدم : 241) و عنعن و في سماع میمون بن أبي شبیب من سمرۃ رضي اللّٰہ عنہ نظر وللحدیث شاہد ضعیف عند النسائي ( 5324 ) فیہ سعید بن أبي عروبۃ مدلس ( تقدم : 30 ) و عنعن والحدیث صحیح دون قولہ ’’ فإنھا أطھر و أطیب ‘‘ رواہ أحمد ( 21/5 ح 20235) 
وانظر شمائل الترمذي (بتحقیقي: 69)`;
tirmizi.anwaar = [270,1];