var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ دَلْهَمِ بْنِ صَالِحٍ عَنْ حُجَيْرِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ النَّجَاشِيَّ أَهْدَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُفَّيْنِ أَسْوَدَيْنِ سَاذَجَيْنِ فَلَبِسَهُمَا ثُمَّ تَوَضَّأَ وَمَسَحَ عَلَيْهِمَا قَالَ هَذَا حَدِيثٌ حَسَنٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ دَلْهَمٍ وَقَدْ رَوَاهُ مُحَمَّدُ بْنُ رَبِيعَةَ عَنْ دَلْهَمٍ";
tirmizi.urdu = "بریدہ رضی اللہ عنہ کہتے ہیں: نجاشی (شاہ حبشہ) نے نبی اکرمﷺ کو دوکالے رنگ کے موزے بھیجے،آپ نے انہیں پہنا،پھر آپ نے وضو کیا اور ان دونوں موزوں پر مسح فرمایا۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن ہے،۲-ہم اسے صرف دلہم کی روایت سے جانتے ہیں،۳-محمد بن ربیعہ نے دلہم (راوی) سے روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2820] أن النجاشي أھدی النبي ﷺ خفین
إسنادہ ضعیف/ د 155،جہ 549  باب ما جاء فی الخف الأسود`;
tirmizi.anwaar = [270,1];