var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ شُعْبَةَ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ الرَّبِيعِ بْنِ عُمَيْلَةَ الْفَزَارِيِّ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُسَمِّ غُلَامَكَ رَبَاحٌ وَلَا أَفْلَحُ وَلَا يَسَارٌ وَلَا نَجِيحٌ يُقَالُ أَثَمَّ هُوَ فَيُقَالُ لَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "سمرہ بن جندب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' تم اپنے غلام کانام رباح،افلح،یسار اور نجیح نہ رکھو (کیوں کہ) پوچھا جائے کہ کیاوہ یہاں ہے؟ توکہا جائے گا: نہیں' ۱؎۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;