var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مَيْمُونٍ الْمَكِّيُّ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَخْنَعُ اسْمٍ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ رَجُلٌ تَسَمَّى بِمَلِكِ الْأَمْلَاكِ قَالَ سُفْيَانُ شَاهَانْ شَاهْ وَأَخْنَعُ يَعْنِي وَأَقْبَحُ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' قیامت کے دن اللہ کے نزدیک سب سے بدترنام اس شخص کا ہوگا جس کانام ملک الاملاک ہوگا'،سفیان کہتے ہیں:' ملک الاملاک ' کا مطلب ہے: شہنشاہ۔اور اخنع کے معنی اقبح ہیں یعنی سب سے بدترا ور حقیرترین۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;