var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَ قِيلَ لَهَا هَلْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَمَثَّلُ بِشَيْءٍ مِنْ الشِّعْرِ قَالَتْ كَانَ يَتَمَثَّلُ بِشِعْرِ ابْنِ رَوَاحَةَ وَيَتَمَثَّلُ وَيَقُولُ وَيَأْتِيكَ بِالْأَخْبَارِ مَنْ لَمْ تُزَوِّدِ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ ان سے پوچھا گیا:کیارسول اللہ ﷺ کبھی کوئی شعر بطور مثال اور نمونہ پیش کرتے تھے؟ توانہوں نے کہا: ہاں،رسول اللہ ﷺابن رواحہ کا شعر بطور مثال پیش کرتے تھے،آپ کہتے تھے:\nوَیَأْتِیکَ بِالأَخْبَارِ مَنْ لَمْ تُزَوِّدِ ۱؎\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابن عباس سے بھی روایت ہے۔(زمانہ تمہارے سامنے وہ چیزیں ظاہر اور پیش کرے گاجن سے تم ناواقف اور بے خبر ہوگے،اور تمہارے پاس وہ آدمی خبریں اور اطلاعات لے کر آئے گا جس کو تم نے خرچہ دے کر اس کام کے لیے بھیجا بھی نہ ہوگا)";
tirmizi.hukam = "";
tirmizi.description = `[2848] ویأتیک بالأخبار من لم تزود
إسنادہ ضعیف باب ما جاء في إنشاد الشعر
شریک بن عبد اللّٰہ القاضي مدلس ( تقدم : 112 ) وعنعن وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [270,1];