var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ الْحُلْوَانِيُّ،حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ،عَنْ زَيْدِ بْنِ حُبَابٍ،عَنْ كَامِلٍ أَبِي الْعَلاَءِ،نَحْوَهُ. قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ غَرِيبٌ. وَهَكَذَا رُوِيَ عَنْ عَلِيٍّ. وَبِهِ يَقُولُ الشَّافِعِيُّ،وَأَحْمَدُ،وَإِسْحَاقُ: يَرَوْنَ هَذَا جَائِزًا فِي الْمَكْتُوبَةِ وَالتَّطَوُّعِ. وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ كَامِلٍ أَبِي الْعَلاَءِ مُرْسَلاً";
tirmizi.urdu = "اس سند سے بھی کامل ابوالعلاء سے اسی طرح مروی ہے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-اسی طرح علی رضی اللہ عنہ سے بھی مروی ہے۔اوربعض لوگوں نے کامل ابوالعلاء سے یہ حدیث مرسلاً روایت کی ہے،۳-شافعی،احمد،اسحاق بن راہویہ بھی یہی کہتے ہیں،ان کی رائے ہے کہ یہ فرض اور نفل دونوں میں جائز ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔285] اللّٰہم اغفر لي وارحمني
إسنادہ ضعیف/ د 850،جہ 898  باب ما یقول بین السجدتین`;
tirmizi.anwaar = [197,1];