var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الحَسَنُ بْنُ عَلِيٍّ الخَلَّالُ وَغَيْرُ وَاحِدٍ،قَالُوا: حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ: أَخْبَرَنَا مَعْمَرٌ،عَنْ الزُّهْرِيِّ،عَنْ سَالِمٍ،عَنْ ابْنِ عُمَرَ،قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا النَّاسُ كَإِبِلٍ مِائَةٍ لَا يَجِدُ الرَّجُلُ فِيهَا رَاحِلَةً»: «هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ»";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' لوگ سواونٹ کی طرح ہیں۔آدمی ان میں سے ایک بھی سواری کے قابل نہیں پاتا' ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ — صحیح بخاری و صحیح مسلم";
tirmizi.description = ``;