var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ المَخْزُومِيُّ قَالَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنِ الزُّهْرِيِّ،بِهَذَا الإِسْنَادِ نَحْوَهُ،وَقَالَ: «لَا تَجِدُ فِيهَا رَاحِلَةً»،أَوْ قَالَ: «لَا تَجِدُ فِيهَا إِلَّا رَاحِلَةً»";
tirmizi.urdu = "سفیان بن عیینہ زہری سے اسی سند سے اسی طرح روایت کرتے ہیں اور انہوں نے کہا: تم ان میں ایک بھی سواری کے قابل نہ پاؤگے،یا یہ کہا:تم ان میں سے صرف ایک سواری کے قابل پاسکوگے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;