var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ حَكِيمِ بْنِ جُبَيْرٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِكُلِّ شَيْءٍ سَنَامٌ وَإِنَّ سَنَامَ الْقُرْآنِ سُورَةُ الْبَقَرَةِ وَفِيهَا آيَةٌ هِيَ سَيِّدَةُ آيِ الْقُرْآنِ هِيَ آيَةُ الْكُرْسِيِّ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَكِيمِ بْنِ جُبَيْرٍ وَقَدْ تَكَلَّمَ شُعْبَةُ فِي حَكِيمِ بْنِ جُبَيْرٍ وَضَعَّفَهُ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺنے فرمایا:ہرچیز کی ایک چوٹی ہوتی ہے ۱؎ اور قرآن کی چوٹی سورہ بقرہ ہے،اس سورہ میں ایک آیت ہے یہ قرآن کی ساری آیتوں کی سردار ہے اور یہ آیت آیۃ الکرسی ہے۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-ہم اسے صرف حکیم بن جبیر کی روایت سے جانتے ہیں،۳-حکیم بن جبیر کے بارے میں شعبہ نے کلام کیا ہے اور انہیں ضعیف قراردیا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2878] لکل شئ سنام وإن سنام القرآن
إسنادہ ضعیف باب ما جاء في فضل سورۃ البقرۃ وآیۃ الکرسي
حکیم بن جبیر : ضعیف ( تقدم : 155 )`;
tirmizi.anwaar = [271,1];