var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا خَالِدُ بْنُ إِلْيَاسَ عَنْ صَالِحٍ مَوْلَى التَّوْأَمَةِ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَضُ فِي الصَّلَاةِ عَلَى صُدُورِ قَدَمَيْهِ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ عَلَيْهِ الْعَمَلُ عِنْدَ أَهْلِ الْعِلْمِ يَخْتَارُونَ أَنْ يَنْهَضَ الرَّجُلُ فِي الصَّلَاةِ عَلَى صُدُورِ قَدَمَيْهِ وَخَالِدُ بْنُ إِلْيَاسَ هُوَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ قَالَ وَيُقَالُ خَالِدُ بْنُ إِيَاسٍ أَيْضًا وَصَالِحٌ مَوْلَى التَّوْأَمَةِ هُوَ صَالِحُ بْنُ أَبِي صَالِحٍ وَأَبُو صَالِحٍ اسْمُهُ نَبْهَانُ وَهُوَ مَدَنِيٌّ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہـ نبی اکرمﷺ صلاۃ میں اپنے دونوں قدموں کے سروں یعنی دونوں پیروں کی انگلیوں پر زور دے کر اٹھتے تھے۔امام ترمذی کہتے ہیں: اہل علم کے نزدیک ابوہریرہ رضی اللہ عنہ ہی کی حدیث پر عمل ہے۔خالد بن الیاس محدثین کے نزدیک ضعیف ہیں۔انہیں خالد بن ایاس بھی کہاجاتاہے،لوگ اسی کو پسندکرتے ہیں کہ آدمی صلاۃ میں اپنے دونوں قدموں کے سروں پرزور دے کر(بغیربیٹھے) کھڑا ہو۔";
tirmizi.hukam = "";
tirmizi.description = `[288] کان ینھض فی الصلاۃ علی صدور قدمیہ
إسنادہ ضعیف باب منہ أیضًا
خالد بن إلیاس : متروک الحدیث ( تق: 1617) `;
tirmizi.anwaar = [197,1];