var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ فِي تَفْسِيرِ حَدِيثِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ مَا خَلَقَ اللَّهُ مِنْ سَمَاءٍ وَلَا أَرْضٍ أَعْظَمَ مِنْ آيَةِ الْكُرْسِيِّ قَالَ سُفْيَانُ لِأَنَّ آيَةَ الْكُرْسِيِّ هُوَ كَلَامُ اللَّهِ وَكَلَامُ اللَّهِ أَعْظَمُ مِنْ خَلْقِ اللَّهِ مِنْ السَّمَاءِ وَالْأَرْضِ";
tirmizi.urdu = "سفیان بن عیینہ سے روایت ہے،وہ عبداللہ بن مسعود رضی اللہ عنہ کی اس حدیث ' مَا خَلَقَ اللَّہُ مِنْ سَمَائٍ وَلاَ أَرْضٍ أَعْظَمَ مِنْ آیَۃِ الْکُرْسِیِّ ' کی تفسیرمیں کہتے ہیں: آیت الکرسی کی فضیلت اس وجہ سے ہے کہ یہ اللہ کا کلام ہے اور اللہ کا کلام اللہ کی مخلوق یعنی آسمان وزمین سے بڑھ کر ہ";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;