var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ أَبِي الدَّرْدَاءِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَرَأَ ثَلَاثَ آيَاتٍ مِنْ أَوَّلِ الْكَهْفِ عُصِمَ مِنْ فِتْنَةِ الدَّجَّالِ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوالدرداء رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:'جس نے سورہ کہف کی ابتدائی تین آیات پڑھیں وہ دجال کے فتنہ سے بچالیاگیا ' ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔اس سندسے بھی اسے ابوالدرداء رضی اللہ عنہ نے اسی سند کے ساتھ اسی طرح روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2886] من قرأ ثلاث آیات من أول الکھف
شاذ
باب ما جاء في فضل سورۃ الکھف
والصواب ما رواہ مسلم (809) بلفظ :’’ عشر آیات‘‘۔`;
tirmizi.anwaar = [272,1];