var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ عَنْ هِشَامٍ أَبِي الْمِقْدَامِ عَنْ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ حم الدُّخَانَ فِي لَيْلَةِ الْجُمُعَةِ غُفِرَ لَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَهِشَامٌ أَبُو الْمِقْدَامِ يُضَعَّفُ وَلَمْ يَسْمَعْ الْحَسَنُ مِنْ أَبِي هُرَيْرَةَ هَكَذَا قَالَ أَيُّوبُ وَيُونُسُ بْنُ عُبَيْدٍ وَعَلِيُّ بْنُ زَيْدٍ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' جو شخص جمعہ کی رات میں حٓم سورہ دخان پڑھے گا اسے بخش دیاجائے گا'۔امام ترمذی کہتے ہیں:۱-اس حدیث کوہم صرف اسی سند سے جانتے ہیں،۲-ہشام ابوالمقدام ضعیف قراردیئے گئے ہیں،۳-حسن بصری نے ابوہریرہ رضی اللہ عنہ سے نہیں سناہے،ایوب،یونس بن عبید اورعلی بن زید نے ایسا ہی کہاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2889] من قرأ حم الدخان في لیلۃ الجمعۃ
إسنادہ ضعیف جدًا    باب ما جاء في فضل حٓم الدخان
ہشام أبو المقدام :متروک (تق: 7292) `;
tirmizi.anwaar = [272,1];