var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْحَرَشِيُّ الْبَصْرِيُّ حَدَّثَنَا الْحَسَنُ بْنُ سَلْمِ بْنِ صَالِحٍ الْعِجْلِيُّ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ إِذَا زُلْزِلَتْ عُدِلَتْ لَهُ بِنِصْفِ الْقُرْآنِ وَمَنْ قَرَأَ قُلْ يَا أَيُّهَا الْكَافِرُونَ عُدِلَتْ لَهُ بِرُبُعِ الْقُرْآنِ وَمَنْ قَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ عُدِلَتْ لَهُ بِثُلُثِ الْقُرْآنِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ هَذَا الشَّيْخِ الْحَسَنِ بْنِ سَلْمٍ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' جس نے سورہ 'إذا زلزلت الأرض' سورہ پڑھی تو اسے آدھاقرآن پڑھنے کے برابر ثواب ملے گا،اور جس نے سورہ'قل یا أیہا الکافرون' پڑھی تواسے چوتھائی قرآن پڑھنے کے برابر ثواب ملے گا،اور جس نے سورہ 'قل ہو اللہ أحد' پڑھی تو اسے ایک تہائی قرآن پڑھنے کا ثواب ملے گا'۔امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-ہم اسے کسی اور سے نہیں صرف انہیں حسن بن مسلم کی روایت سے جانتے ہیں،۳-اس باب میں ابن عباس سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2893] من قرأ ﴿ إذا زلزلت ﴾ عدلت لہ
إسنادہ ضعیف باب ما جاء في إذا زلزلت
الحسن بن سلم : مجہول ( تق: 1244) `;
tirmizi.anwaar = [273,1];