var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ أَبِي أُمَيَّةَ،عَنْ حَسَّانَ بْنِ بِلاَلٍ قَالَ: رَأَيْتُ عَمَّارَ بْنَ يَاسِرٍ تَوَضَّأَ فَخَلَّلَ لِحْيَتَهُ،فَقِيلَ لَهُ،أَوْ قَالَ: فَقُلْتُ لَهُ: أَتُخَلِّلُ لِحْيَتَكَ؟ قَالَ: وَمَا يَمْنَعُنِي؟ وَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ ﷺ يُخَلِّلُ لِحْيَتَهُ.";
tirmizi.urdu = "حسان بن بلال کہتے ہیں: میں نے عمار بن یاسر رضی اللہ عنہما کودیکھا کہ انہوں نے وضو کیا تواپنی داڑھی میں خلال کیا ۱؎ ان سے کہاگیا یا راوی حدیث حسان نے کہا کہ میں نے ان سے کہا:کیاآپ اپنی داڑھی کا خلال کررہے ہیں؟ تو انہوں نے جواب دیا کہ میں داڑھی کا خلال کیوں نہ کروں جب کہ میں نے رسول اللہ ﷺ کوداڑھی کا خلال کرتے دیکھاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[29] ولقد رأیت رسول اللّٰہﷺ یخلل لحیتہ
إسنادہ ضعیف باب ما جاء في تخلیل اللحیۃ
عبد الکریم بن أبی المخارق ضعیف ( تقدم : 12) والحدیث الآتي ( الأصل : 31) یغني عنہ۔`;
tirmizi.anwaar = [189,2];