var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بِذَلِكَ إِسْحَاقُ بْنُ مَنْصُورٍ قَالَ: حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ،عَنْ مُعَاوِيَةَ،عَنِ العَلَاءِ بْنِ الحَارِثِ،عَنْ زَيْدِ بْنِ أَرْطَاةَ،عَنْ جُبَيْرِ بْنِ نُفَيْرٍ،قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكُمْ لَنْ تَرْجِعُوا إِلَى اللَّهِ بِأَفْضَلَ مِمَّا خَرَجَ مِنْهُ» يَعْنِي القُرْآنَ";
tirmizi.urdu = "جبیر بن نفیر کہتے ہیں کہ نبی اکرمﷺ نے فرمایا:' تم اللہ کی طرف رجوع کرنے کے لیے قرآن سے بڑھ کر کوئی اور ذریعہ نہیں پاسکتے'۔";
tirmizi.hukam = "";
tirmizi.description = `[2912] إنکم لن ترجعوا إلی اللّٰہ
إسنادہ ضعیف باب ما تقرب العباد إلی اللّٰہ۔۔۔۔۔
السند مرسل،وذکرہ أبو داود فی المراسیل (538) `;
tirmizi.anwaar = [273,1];