var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا جَرِيرٌ عَنْ قَابُوسَ بْنِ أَبِي ظَبْيَانَ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الَّذِي لَيْسَ فِي جَوْفِهِ شَيْءٌ مِنْ الْقُرْآنِ كَالْبَيْتِ الْخَرِبِ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' وہ شخص جس کے دل میں قرآن کا کچھ حصہ یاد نہ ہو وہ ویران گھر کی طرح ہے '۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2913] إن الذي لیس في جوفہ شئ من القرآن
إسنادہ ضعیف باب (18)
قابوس ضعیف ( تقدم : 1053 ) `;
tirmizi.anwaar = [274,1];