var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ الْعَبْدِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ بْنِ أَبِي يَزِيدَ الْهَمْدَانِيُّ عَنْ عَمْرِو بْنِ قَيْسٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الرَّبُّ عَزَّ وَجَلَّ مَنْ شَغَلَهُ الْقُرْآنُ وَذِكْرِي عَنْ مَسْأَلَتِي أَعْطَيْتُهُ أَفْضَلَ مَا أُعْطِي السَّائِلِينَ وَفَضْلُ كَلَامِ اللَّهِ عَلَى سَائِرِ الْكَلَامِ كَفَضْلِ اللَّهِ عَلَى خَلْقِهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "ابوسعیدخدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' اللہ عزوجل فرماتاہے: جس کو قرآن نے میری یادنے مجھ سے سوال کرنے سے مشغول رکھا۔میں اسے اس سے زیادہ دوں گا جتنا میں مانگنے والوں کو دیتاہوں۔اللہ کے کلام کی فضیلت دوسرے سارے کلام پرایسی ہے جیسے اللہ کی فضیلت اس کی اپنی ساری مخلوقات پرہے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2926] یقول الرب تبارک وتعالی من شغلہ القرآن
إسنادہ ضعیف باب (25)
محمد بن الحسن بن أبي یزید : ضعیف ( تقدم : 2505) وعطیۃ العوفي : ضعیف مدلس ( تقدم : 477 )`;
tirmizi.anwaar = [274,1];