var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا وَكِيعٌ وَحَبَّانُ بْنُ هِلَالٍ قَالَا حَدَّثَنَا هَارُونُ النَّحْوِيُّ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ هَذِهِ الْآيَةَ إِنَّهُ عَمِلَ غَيْرَ صَالِحٍ";
tirmizi.urdu = "ام سلمہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ ﷺ نے یہ آیت اس طرح پڑھی: إِنَّہُ عَمِلَ غَیْرَ صَالِحٍ.";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 1210`;