var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ حَدَّثَنَا نُعَيْمُ بْنُ مَيْسَرَةَ النَّحْوِيُّ عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ ابْنِ عُمَرَ أَنَّهُ قَرَأَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلَقَكُمْ مِنْ ضَعْفٍ فَقَالَ مِنْ ضُعْفٍ حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ عَنْ عَطِيَّةَ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ فُضَيْلِ بْنِ مَرْزُوقٍ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں: انہوں نے نبی ﷺ کے سامنے' خَلَقَکُمْ مِنْ ضَعْفٍ' (ضاد کے فتحہ کے ساتھ) پڑھا تو آپ نے فرمایا:' مِنْ ضَعْفٍ نہیں مِنْ ضُعْفٍ ۱؎ (ضاد کے ضمہ کے ساتھ) پڑھو'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-ہم اسے صرف فضیل بن مرزوق کی روایت سے جانتے ہیں۔ہم سے عبد بن حمید نے بیان کیا،وہ کہتے ہیں: ہم سے بیان کیا یزید بن ہارون نے اوریزیدبن ہارون نے فضیل بن مرذوق سے کی حدیث روایت کی فضل بن مرذوق نے عطیہ سے اورعطیہ نے ابن عمرکے واسطہ سے نبی ﷺ سے اسی طرح کی حدیث روایت کی۔";
tirmizi.hukam = "";
tirmizi.description = `[2936] من ضعف
إسنادہ ضعیف/ د 3978 باب ومن سورۃ الروم
عطیۃ العوفي ضعیف ( تقدم : 477 )`;
tirmizi.anwaar = [275,1];