var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أَشْعَثُ السَّمَّانُ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ عَنْ أَبِيهِ قَالَ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فِي لَيْلَةٍ مُظْلِمَةٍ فَلَمْ نَدْرِ أَيْنَ الْقِبْلَةُ فَصَلَّى كُلُّ رَجُلٍ مِنَّا عَلَى حِيَالِهِ فَلَمَّا أَصْبَحْنَا ذَكَرْنَا ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَزَلَتْ فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ أَشْعَثَ السَّمَّانِ أَبِي الرَّبِيعِ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ وَأَشْعَثُ يُضَعَّفُ فِي الْحَدِيثِ";
tirmizi.urdu = "عامر بن ربیعہ رضی اللہ عنہ کہتے ہیں: ہم ایک انتہائی اندھیری رات میں نبی اکرم ﷺ کے ساتھ سفر میں تھے،کوئی نہ جان سکا کہ قبلہ کدھر ہے۔چنانچہ جو جس رخ پر تھا اس نے اُسی رخ پر صلاۃ پڑھ لی،جب صبح ہوئی توہم نے نبی اکرم ﷺ سے اس بات کا ذکر کیا تو (اس وقت) یہ آیت فَأَیْنَمَا تُوَلُّوا فَثَمَّ وَجْہُ اللَّہِ ۱؎ نازل ہوئی۔";
tirmizi.hukam = "";
tirmizi.description = `[2957] کنا مع النبيﷺ في سفر في لیلۃ
ضعیف / جہ 1020،تقدم : 345  باب ومن سورۃ البقرۃ
عاصم بن عبید اللّٰہ : ضعیف ( تقدم : 345) وللحدیث شاہد ضعیف عند البیہقي(11/2) `;
tirmizi.anwaar = [276,1];