var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حُمَيْدٍ عَنْ أَنَسٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَ يَا رَسُولَ اللَّهِ لَوْ صَلَّيْنَا خَلْفَ الْمَقَامِ فَنَزَلَتْ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "انس رضی اللہ عنہ سے روایت ہے کہ عمر بن خطاب رضی اللہ عنہ نے کہا: اللہ کے رسول! کاش ہم مقام (مقام ابراہیم) کے پیچھے صلاۃ پڑھتے،تو آیت: وَاتَّخِذُواْ مِن مَّقَامِ إِبْرَاہِیمَ مُصَلًّی ۱؎ نازل ہوئی ۲؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;