var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ وَهِقْلُ بْنُ زِيَادٍ عَنْ الْأَوْزَاعِيِّ عَنْ قُرَّةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ حَذْفُ السَّلَامِ سُنَّةٌ قَالَ عَلِيُّ بْنُ حُجْرٍ قَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ يَعْنِي أَنْ لَا يَمُدَّهُ مَدًّا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهُوَ الَّذِي يَسْتَحِبُّهُ أَهْلُ الْعِلْمِ وَرُوِيَ عَنْ إِبْرَاهِيمَ النَّخَعِيِّ أَنَّهُ قَالَ التَّكْبِيرُ جَزْمٌ وَالسَّلَامُ جَزْمٌ وَهِقْلٌ يُقَالُ كَانَ كَاتِبَ الْأَوْزَاعِيِّ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں: حذف سلام سنت ہے۔علی بن حجر بیان کرتے ہیں کہ عبداللہ بن مبارک کہتے ہیں: حذف سلام کامطلب یہ ہے کہ وہ اسے یعنی سلام کو زیادہ نہ کھینچے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-یہی ہے جسے اہل علم مستحب جانتے ہیں،۳-ابراہیم نخعی سے مروی ہے وہ کہتے ہیں تکبیرجزم ہے اورسلام جزم ہے(یعنی ان دونوں میں مدنہ کھینچے بلکہ وقف کرے)۔";
tirmizi.hukam = "";
tirmizi.description = `[297] حذف السلام سنۃ
إسنادہ ضعیف / د 1004    باب ما جاء أن حذف السلام سنۃ`;
tirmizi.anwaar = [197,2];