var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ عَاصِمٍ الأحْوَلِ،عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ،عَنْ عَائِشَةَ قَالَتْ: كَانَ رَسُولُ اللهِ ﷺ إِذَا سَلَّمَ لاَ يَقْعُدُ،إِلاَّ مِقْدَارَ مَا يَقُولُ: اللّهُمَّ أَنْتَ السَّلاَمُ،وَمِنْكَ السَّلاَمُ،تَبَارَكْتَ ذَا الْجَلاَلِ وَالإِكْرَامِ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہﷺ جب سلام پھیرتے تو ' اللّہُمَّ أَنْتَ السَّلاَمُ وَمِنْکَ السَّلاَمُ تَبَارَکْتَ ذَا الْجَلاَلِ وَالإِکْرَامِ ' (اے اللہ تو سلام ہے،تجھ سے سلامتی ہے،بزرگی اور عزت والے! تو بڑی برکت والاہے) کہنے کے بقدرہی بیٹھتے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;