var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو النَّضْرِ وَأَبُو دَاوُدَ عَنْ مُحَمَّدِ بْنِ طَلْحَةَ بْنِ مُصَرِّفٍ عَنْ زُبَيْدٍ عَنْ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ الْوُسْطَى صَلَاةُ الْعَصْرِ وَفِي الْبَاب عَنْ زَيْدِ بْنِ ثَابِتٍ وَأَبِي هَاشِمِ بْنِ عُتْبَةَ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ’’صلاۃ وسطیٰ سے مراد عصر کی صلاۃ ہے‘‘۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں زید بن ثابت،ابو ہاشم بن عتبہ اور ابوہریرہ رضی اللہ عنہ سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;