var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ السُّدِّيِّ قَالَ حَدَّثَنِي مَنْ سَمِعَ عَلِيًّا يَقُولُ لَمَّا نَزَلَتْ هَذِهِ الْآيَةَ إِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ الْآيَةَ أَحْزَنَتْنَا قَالَ قُلْنَا يُحَدِّثُ أَحَدُنَا نَفْسَهُ فَيُحَاسَبُ بِهِ لَا نَدْرِي مَا يُغْفَرُ مِنْهُ وَلَا مَا لَا يُغْفَرُ فَنَزَلَتْ هَذِهِ الْآيَةُ بَعْدَهَا فَنَسَخَتْهَا لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں: جب آیت إِنْ تُبْدُوا مَا فِی أَنْفُسِکُمْ أَوْ تُخْفُوہُ یُحَاسِبْکُمْ بِہِ اللَّہُ فَیَغْفِرُ لِمَنْ یَشَائُ وَیُعَذِّبُ مَنْ یَشَائُ ۱؎ نازل ہوئی۔تو اس نے ہم سب کو فکر وغم میں مبتلا کر دیا۔ہم نے کہا: ہم میں سے کوئی اپنے دل میں باتیں کرے پھر اس کا حساب لیا جائے۔ہمیں معلوم نہیں اس میں سے کیا بخشا جائے گا اور کیا نہیں بخشا جائے؟۔اس پر یہ آیت نازل ہوئی لاَ یُکَلِّفُ اللَّہُ نَفْسًا إِلاَّ وُسْعَہَا لَہَا مَا کَسَبَتْ وَعَلَیْہَا مَا اکْتَسَبَتْ ۲؎ اور اس آیت نے اس سے پہلی والی آیت کو منسوخ کر دیا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[2990] لما نزلت ھٰذہ الآیۃ ((واِن تبدوا ما فی اَنفسکم))
إسنادہ ضعیف باب ومن سورۃ البقرۃ
من سمع : مجھول وحدیث مسلم ( 125/ 199) یغني عنہ۔`;
tirmizi.anwaar = [276,2];