var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ،عَنْ قَتَادَةَ،عَنْ حَسَّانَ بْنِ بِلاَلٍ،عَنْ عَمَّارٍ،عَنْ النَّبِيِّ ﷺ مِثْلَهُ. قَالَ أَبُو عِيسَى: وَفِي الْبَاب عَنْ عُثْمَانَ،وَعَائِشَةَ،وَأُمِّ سَلَمَةَ،وَأَنَسٍ،وَابْنِ أَبِي أَوْفَى،وَأَبِي أَيُّوبَ.\nقَالَ أَبُو عِيسَى: و سَمِعْت إِسْحَاقَ بْنَ مَنْصُورٍ يَقُولُ: سَمِعْتُ أَحْمَدَ بْنَ حَنْبَلٍ: قَالَ: قَالَ ابْنُ عُيَيْنَةَ: لَمْ يَسْمَعْ عَبْدُ الْكَرِيمِ مِنْ حَسَّانَ بْنِ بِلاَلٍ حَدِيثَ التَّخْلِيلِ";
tirmizi.urdu = "اس سندسے بھی عماربن یاسرسے اوپرہی کی حدیث کے مثل مرفوعاً مروی ہے۔\nامام ترمذی کہتے ہیں: اس باب میں عثمان،عائشہ،ام سلمہ،انس،ابن ابی اوفی اور ابوایوب رضی اللہ عنہم سے بھی احادیث آئی ہیں";
tirmizi.hukam = "";
tirmizi.description = `[30] ولقد رأیت رسول اللّٰہﷺ یخلل لحیتہ
إسنادہ ضعیف باب ما جاء في تخلیل اللحیۃ
قتادۃ مدلس (د 29 ) وعنعن وسعید بن أبي عروبۃ مدلس(د 33) وعنعن۔`;
tirmizi.anwaar = [190,1];