var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ رَجُلٍ مِنْ وَلَدِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ يَا رَسُولَ اللَّهِ لَا أَسْمَعُ اللَّهَ ذَكَرَ النِّسَاءَ فِي الْهِجْرَةِ فَأَنْزَلَ اللَّهُ تَعَالَى أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِنْكُمْ مِنْ ذَكَرٍ أَوْ أُنْثَى بَعْضُكُمْ مِنْ بَعْضٍ";
tirmizi.urdu = "ام المومنین ام سلمہ رضی اللہ عنہا کہتی ہیں: اللہ کے رسول! میں عورتوں کی ہجرت کا ذکر کلام پاک میں نہیں سنتی،تو اللہ تعالیٰ نے آیت أَنِّی لا أُضِیعُ عَمَلَ عَامِلٍ مِنْکُمْ مِنْ ذَکَرٍ أَوْ أُنْثَی بَعْضُکُمْ مِنْ بَعْضٍ ۱؎ نازل فرمائی۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;