var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا خَلَّادُ بْنُ أَسْلَمَ الْبَغْدَادِيُّ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ عَنْ إِسْرَائِيلَ عَنْ ثُوَيْرِ بْنِ أَبِي فَاخِتَةَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ مَا فِي الْقُرْآنِ آيَةٌ أَحَبُّ إِلَيَّ مِنْ هَذِهِ الْآيَةِ إِنَّ اللَّهَ لَا يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَلِكَ لِمَنْ يَشَاءُ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَأَبُو فَاخِتَةَ اسْمُهُ سَعِيدُ بْنُ عِلَاقَةَ وَثُوَيْرٌ يُكْنَى أَبَا جَهْمٍ وَهُوَ رَجُلٌ كُوفِيٌّ مِنْ التَّابِعِينَ وَقَدْ سَمِعَ مِنْ ابْنِ عُمَرَ وَابْنِ الزُّبَيْرِ وَابْنُ مَهْدِيٍّ كَانَ يَغْمِزُهُ قَلِيلًا";
tirmizi.urdu = "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں: قرآن میں کوئی آیت مجھے اس آیت: إِنَّ اللَّہَ لا یَغْفِرُ أَنْ یُشْرَکَ بِہِ وَیَغْفِرُ مَا دُونَ ذَلِکَ لِمَنْ یَشَائُ ۱؎ سے زیادہ محبوب وپسندیدہ نہیں ہے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-ابو فاختہ کا نام سعید بن علاقہ ہے،۳-ثویر کی کنیت ابو جہم ہے اور وہ کوفہ کے رہنے والے ہیں تابعی ہیں اور ابن عمر اور ابن زبیر سے ان کا سماع ہے،ابن مہدی ان پر کچھ طعن کرتے تھے۔";
tirmizi.hukam = "";
tirmizi.description = `[3037] ما فی القرآن آیۃ أحب إلي من ھذہ
إسنادہ ضعیف باب ومن سورۃ النساء
ثویر ضعیف رافضي ( تقدم : 501)`;
tirmizi.anwaar = [278,1];