var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا سُلَيْمَانُ بْنُ مُعَاذٍ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ خَشِيَتْ سَوْدَةُ أَنْ يُطَلِّقَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ لَا تُطَلِّقْنِي وَأَمْسِكْنِي وَاجْعَلْ يَوْمِي لِعَائِشَةَ فَفَعَلَ فَنَزَلَتْ فَلَا جُنَاحَ عَلَيْهِمَا أَنْ يُصْلِحَا بَيْنَهُمَا صُلْحًا وَالصُّلْحُ خَيْرٌ فَمَا اصْطَلَحَا عَلَيْهِ مِنْ شَيْءٍ فَهُوَ جَائِزٌ كَأَنَّهُ مِنْ قَوْلِ ابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں: ام المومنین سودہ رضی اللہ عنہا کو ڈر ہوا کہ نبی اکرم ﷺ انہیں طلاق دے دیں گے،تو انہوں نے عرض کیا: آپ ہمیں طلاق نہ دیں،اور مجھے اپنی بیویوں میں شامل رہنے دیں اور میری باری کا دن عائشہ رضی اللہ عنہا کو دے دیں،تو آپ نے ایسا ہی کیا،اس پر آیت فَلاَ جُنَاحَ عَلَیْہِمَا أَنْ یُصْلِحَا بَیْنَہُمَا صُلْحًا وَالصُّلْحُ خَیْرٌ ۱؎ تو جس بات پربھی انہوں نے صلح کر لی،وہ جائز ہے۔لگتا ہے کہ یہ ابن عباس کا قول ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3040] خشیت سودۃ أن یطلقھا النبي ﷺ
إسنادہ ضعیف باب و من سورۃ النساء
سلیمان بن معاذ ضعیف ( د 1671) وحدیث البخاري ( 5212) و مسلم (1463) یغني عنہ۔`;
tirmizi.anwaar = [278,1];