var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ يَسْتَفْتُونَكَ قُلْ اللَّهُ يُفْتِيكُمْ فِي الْكَلَالَةِ فَقَال لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُجْزِئُكَ آيَةُ الصَّيْفِ";
tirmizi.urdu = "براء بن عازب رضی اللہ عنہما سے روایت ہے کہ ایک شخص نے رسول اللہ ﷺ کے پاس آ کر کہا: اللہ کے رسول! یَسْتَفْتُونَکَ قُلْ اللَّہُ یُفْتِیکُمْ فِی الْکَلاَلَۃِ کی تفسیر کیا ہے،نبی اکرم ﷺ نے فرمایا: ’’اس کے سلسلہ میں تو تمہارے لیے آیت صیف ۱؎ کافی ہوگی‘‘۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;