var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُوسٍ عَنْ أَبِي هُرَيْرَةَ قَالَ يُلَقَّى عِيسَى حُجَّتَهُ فَلَقَّاهُ اللَّهُ فِي قَوْلِهِ وَإِذْ قَالَ اللَّهُ يَا عِيسَى ابْنَ مَرْيَمَ أَأَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّيَ إِلَهَيْنِ مِنْ دُونِ اللَّهِ قَالَ أَبُو هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَقَّاهُ اللَّهُ سُبْحَانَكَ مَا يَكُونُ لِي أَنْ أَقُولَ مَا لَيْسَ لِي بِحَقٍّ الْآيَةَ كُلَّهَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں: عیسیٰ علیہ السلام اپنا جواب القاء کیے جائیں گے اللہ تعالیٰ ان کو اپنا جواب اپنے اس قول کے جواب میں القاء کرے گا وَإِذْ قَالَ اللَّہُ یَا عِیسَی ابْنَ مَرْیَمَ ا انْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِی وَأُمِّیَ إِلَہَیْنِ مِنْ دُونِ اللَّہِ ۱؎ ابوہریرہ کہتے ہیں: نبی اکرم ﷺ نے فرمایا: ’’پھر اللہ تعالیٰ نے عیسیٰ علیہ السلام کو اس کا جواب یہ القاء کرے گا سُبْحَانَکَ مَا یَکُونُ لِی أَنْ أَقُولَ مَا لَیْسَ لِی بِحَقٍّ‘‘ ۲؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3062] یلقی عیسی حجتہ
إسنادہ ضعیف باب و من سورۃ المائدۃ
سفیان بن عیینۃ عنعن ( تقدم :1778) وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [279,1];