var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ الْغَسَّانِيِّ عَنْ رَاشِدِ بْنِ سَعْدٍ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذِهِ الْآيَةِ قُلْ هُوَ الْقَادِرُ عَلَى أَنْ يَبْعَثَ عَلَيْكُمْ عَذَابًا مِنْ فَوْقِكُمْ أَوْ مِنْ تَحْتِ أَرْجُلِكُمْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا إِنَّهَا كَائِنَةٌ وَلَمْ يَأْتِ تَأْوِيلُهَا بَعْدُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے: نبی اکرم ﷺ نے آیت قُلْ ہُوَ الْقَادِرُ عَلَی أَنْ یَبْعَثَ عَلَیْکُمْ عَذَابًا مِنْ فَوْقِکُمْ أَوْ مِنْ تَحْتِ أَرْجُلِکُمْ ۱؎ کے متعلق فرمایا: ’’آگاہ رہو یہ تو ہو کر رہنے والی بات ہے اور ابھی تک اس کا وقوع وظہور نہیں ہوا ہے (یعنی یہ عذاب نہیں آیا ہے)۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3066] أما إنھا کائنۃ ولم یأت تأویلھا
إسنادہ ضعیف باب ومن سورۃ الأنعام
أبو بکر بن أبي مریم : ضعیف ( تقدم : 1012) `;
tirmizi.anwaar = [279,1];