var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْفَضْلُ بْنُ الصَّبَّاحِ الْبَغْدَادِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ دَاوُدَ الْأَوْدِيِّ عَنْ الشَّعْبِيِّ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى الصَّحِيفَةِ الَّتِي عَلَيْهَا خَاتَمُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْيَقْرَأْ هَذِهِ الْآيَاتِ قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ الْآيَةَ إِلَى قَوْلِهِ لَعَلَّكُمْ تَتَّقُونَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ جسے اس بات سے خوشی ہو کہ وہ صحیفہ دیکھے جس پر محمد ﷺ کی مہر ہے تو اسے یہ آیات قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّکُمْ عَلَیْکُمْ سے لَعَلَّکُمْ تَتَّقُونَ ۱؎ تک پڑھنی چاہیے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3070] من سرہ أن ینظر إلی الصحیفۃ
إسنادہ ضعیف باب ومن سورۃ الأنعام
داود : اثنان أحدھما ضعیف فالسند معلل لعدم تعین الراوي۔`;
tirmizi.anwaar = [279,1];