var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ إِسْرَائِيلَ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ لَمَّا فَرَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ بَدْرٍ قِيلَ لَهُ عَلَيْكَ الْعِيرَ لَيْسَ دُونَهَا شَيْءٌ قَالَ فَنَادَاهُ الْعَبَّاسُ وَهُوَ فِي وَثَاقِهِ لَا يَصْلُحُ وَقَالَ لِأَنَّ اللَّهَ وَعَدَكَ إِحْدَى الطَّائِفَتَيْنِ وَقَدْ أَعْطَاكَ مَا وَعَدَكَ قَالَ صَدَقْتَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ جب رسول اللہ ﷺ جنگ بدر سے نمٹ چکے تو آپ سے کہا گیا (شام سے آتا ہوا) قافلہ آپ کی زد اور نشانے پر ہے،اس پر غالب آنے میں کوئی چیز مانع اور رکاوٹ نہیں ہے۔تو عباس نے آپ کو پکارا،اس وقت وہ (قیدی تھے) زنجیروں میں بندھے ہوئے تھے،اور کہا: آپ کا یہ اقدام (اگر آپ نے ایسا کیا) تو درست نہ ہوگا،اور درست اس لیے نہ ہوگا کہ اللہ نے آپ سے دونوں گروہوں (قافلہ یا لشکر) میں سے کسی ایک پر فتح وغلبہ کا وعدہ کیا تھا ۱؎ اور اللہ نے آپ سے اپنا کیا ہوا وعدہ پورا کر دیا ہے،آپ نے فرمایا: ’’تم سچ کہتے ہو‘‘۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3080] لما فرغ رسول اللّٰہ ﷺ من بدر۔۔۔۔صدقت
إسنادہ ضعیف باب ومن سورۃ الأنفال
سلسلۃ سماک عن عکرمۃ : ضعیفۃ ( تقدم : 65) `;
tirmizi.anwaar = [280,1];