var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ عَبَّادِ بْنِ يُوسُفَ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْزَلَ اللَّهُ عَلَيَّ أَمَانَيْنِ لِأُمَّتِي وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ فَإِذَا مَضَيْتُ تَرَكْتُ فِيهِمْ الِاسْتِغْفَارَ إِلَى يَوْمِ الْقِيَامَةِ هَذَا حَدِيثٌ غَرِيبٌ وَإِسْمَعِيلُ بْنُ مُهَاجِرٍ يُضَعَّفُ فِي الْحَدِيثِ";
tirmizi.urdu = "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ’’میری امت کے لیے اللہ نے مجھ پر دو امان نازل فرمائے ہیں (ایک) وَمَا کَانَ اللَّہُ لِیُعَذِّبَہُمْ وَأَنْتَ فِیہِمْ ۱؎ (دوسرا) وَمَا کَانَ اللَّہُ مُعَذِّبَہُمْ وَہُمْ یَسْتَغْفِرُونَ ۲؎،اور جب میں (اس دنیا سے) چلا جاؤں گا تو ان کے لیے دوسرا امان استغفار قیامت تک چھوڑ جاؤں گا‘‘۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے۔۲-اسماعیل بن مہاجر حدیث میں ضعیف مانے جاتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3082] أنزل اللّٰہ علي أمانین لأمتي
إسنادہ ضعیف باب ومن سورۃ الأنفال
عباد بن یوسف : مجھول وإسماعیل بن إبراہیم بن مھاجر: ضعیف ( تق : 3155،417) وسفیان بن وکیع: ضعیف أیضًا ( د 4837 ) وللحدیث شاھد ضعیف عند أحمد ( 4/ 393)`;
tirmizi.anwaar = [280,1];