var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ حَدَّثَنَا أَبِي عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ يَوْمِ الْحَجِّ الْأَكْبَرِ فَقَالَ يَوْمُ النَّحْرِ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے پوچھا: حج اکبر کا دن کون سا ہے؟ آپ نے فرمایا: ’’نحر (قربانی) کا دن ہے‘‘ ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;