var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ خِدَاشٍ الْبَغْدَادِيُّ حَدَّثَنَا سَيْفُ بْنُ مُحَمَّدٍ الثَّوْرِيُّ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ وَنُفَضِّلُ بَعْضَهَا عَلَى بَعْضٍ فِي الْأُكُلِ قَالَ الدَّقَلُ وَالْفَارِسِيُّ وَالْحُلْوُ وَالْحَامِضُ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَقَدْ رَوَاهُ زَيْدُ بْنُ أَبِي أُنَيْسَةَ عَنْ الْأَعْمَشِ نَحْوَ هَذَا وَسَيْفُ بْنُ مُحَمَّدٍ هُوَ أَخُو عَمَّارِ بْنِ مُحَمَّدٍ وَعَمَّارٌ أَثْبَتُ مِنْهُ وَهُوَ ابْنُ أُخْتِ سُفْيَانَ الثَّوْرِيِّ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے اللہ تعالیٰ کے اس قولوَنُفَضِّلُ بَعْضَہَا عَلَی بَعْضٍ فِی الأُکُلِ ۱؎ بارے میں فرمایا:' اس سے مراد ردّی اورسوکھی کھجوریں ہیں،فارسی کھجوریں ہیں،میٹھی اور کڑوی کسیلی کھجوریں ہیں ۲؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-زید بن ابی انیسہ نے اعمش سے اسی جیسی حدیث روایت کی ہے،۳-اور سیف بن محمد (جو اس روایت کے راویوں میں سے ہیں) وہ عماربن محمد کے بھائی ہیں اور عمار ان سے زیادہ ثقہ ہیں اور یہ سفیان ثوری کے بھانجے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3118] الدقل والفارسي والحلو و الحامض
ضعیف
باب ومن سورۃ الرعد
الأعمش عنعن ( تقدم : 169) `;
tirmizi.anwaar = [281,1];