var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ دَاوُدَ بْنِ أبِي هِنْدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ قَالَ تَلَتْ عَائِشَةُ هَذِهِ الْآيَةَ يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ قَالَتْ يَا رَسُولَ اللَّهِ فَأَيْنَ يَكُونُ النَّاسُ قَالَ عَلَى الصِّرَاطِ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَرُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ عَائِشَةَ";
tirmizi.urdu = "مسروق کہتے ہیں کہ ام المومنین عائشہ رضی اللہ عنہا نے آیت یَوْمَ تُبَدَّلُ الأَرْضُ غَیْرَ الأَرْضِ ۱؎ پڑھ کر سوال کیا: اللہ کے رسول! اس وقت لوگ کہاں ہوں گے؟ آپ نے فرمایا:' پل صراط پر'۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،ام المومنین عائشہ رضی اللہ عنہا سے یہ حدیث دوسری سندوں سے بھی مروی ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;