var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ عَنْ بِشْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ لَنَسْأَلَنَّهُمْ أَجْمَعِينَ عَمَّا كَانُوا يَعْمَلُونَ قَالَ عَنْ قَوْلِ لَا إِلَهَ إِلَّا اللَّهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ لَيْثِ بْنِ أَبِي سُلَيْمٍ وَقَدْ رَوَى عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ عَنْ بِشْرٍ عَنْ أَنَسٍ نَحْوَهُ وَلَمْ يَرْفَعْهُ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے اللہ تعالیٰ کے قول لَنَسْأَلَنَّہُمْ أَجْمَعِینَ عَمَّا کَانُوا یَعْمَلُونَ ۱؎ کے متعلق فرمایا:' یہ پوچھنا ' لا إلٰہ إلا اللہ' کے متعلق ہوگا'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-ہم اسے لیث بن ابی سلیم کی روایت ہی سے جانتے ہیں،۳-عبداللہ بن ادریس نے لیث بن ابی سلیم سے،اورلیث نے بشرکے واسطہ سے انس سے ایسے ہی روایت کی ہے،لیکن انہوں نے اسے مرفوع نہیں کیا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3126] عن قول لا إلہ إلا اللّٰہ
إسنادہ ضعیف باب ومن سورۃ الحجر
لیث : ضعیف ( تقدم : 218) وبشر : مجہول ( تق: 710) `;
tirmizi.anwaar = [282,1];