var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي الطَّيِّبِ حَدَّثَنَا مُصْعَبُ بْنُ سَلَّامٍ عَنْ عَمْرِو بْنِ قَيْسٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّقُوا فِرَاسَةَ الْمُؤْمِنِ فَإِنَّهُ يَنْظُرُ بِنُورِ اللَّهِ ثُمَّ قَرَأَ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِلْمُتَوَسِّمِينَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ عَنْ بَعْضِ أَهْلِ الْعِلْمِ فِي تَفْسِيرِ هَذِهِ الْآيَةِ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِلْمُتَوَسِّمِينَ قَالَ لِلْمُتَفَرِّسِينَ";
tirmizi.urdu = "ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' مومن کی فراست سے ڈرو کیوں کہ وہ اللہ کے نور سے دیکھتاہے'،پھر آپ نے آیت إِنَّ فِی ذَلِکَ لآیَاتٍ لِلْمُتَوَسِّمِینَ ۱؎ تلاوت فرمائی۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-ہم اسے صرف اسی سند سے جانتے ہیں،بعض اہل علم نے اس آیت إِنَّ فِی ذَلِکَ لآیَاتٍ لِلْمُتَوَسِّمِینَ کی تفسیر یہ کی ہے کہ اس میں نشانیاں ہیں اصحاب فراست کے لیے۔";
tirmizi.hukam = "";
tirmizi.description = `[3127] اتقوا فراسۃ المؤمن
ضعیف    باب ومن سورۃ الحجر
عطیۃ : ضعیف (تقدم : 477) وللحدیث شواہد ضعیفۃ۔`;
tirmizi.anwaar = [282,1];