var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ عَنْ يَحْيَى الْبَكَّاءِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ قَال سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعٌ قَبْلَ الظُّهْرِ بَعْدَ الزَّوَالِ تُحْسَبُ بِمِثْلِهِنَّ فِي صَلَاةِ السَّحَرِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَيْسَ مِنْ شَيْءٍ إِلَّا وَيُسَبِّحُ اللَّهَ تِلْكَ السَّاعَةَ ثُمَّ قَرَأَ يَتَفَيَّأُ ظِلَالُهُ عَنْ الْيَمِينِ وَالشَّمَائِلِ سُجَّدًا لِلَّهِ وَهُمْ دَاخِرُونَ الْآيَةَ كُلَّهَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَلِيِّ بْنِ عَاصِمٍ";
tirmizi.urdu = "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' زوال یعنی سورج ڈھلنے کے بعد ظہر کی صلاۃ سے پہلے چاررکعتیں سحر (تہجد) کی چاررکعتوں کے ثواب کے برابر کا درجہ رکھتی ہیں'،آپ نے فرمایا:' کوئی بھی چیز ایسی نہیں ہے جو اس گھڑی (یعنی زوال کے وقت) اللہ کی تسبیح نہ بیان کرتی ہو۔پھر آپ نے آیت یَتَفَیَّأُ ظِلالُہُ عَنِ الْیَمِینِ وَالشَّمَائِلِ سُجَّدًا لِلَّہِ وَہُمْ دَاخِرُونَ ۱؎ پڑھی'۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے،اسے ہم صرف علی بن عاصم کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3128] أربع قبل الظھر بعد الزوال
إسنادہ ضعیف باب ومن سورۃالنحل
یحیی البکاء : ضعیف (تقدم : 195) `;
tirmizi.anwaar = [282,1];