var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا جَرِيرٌ عَنْ قَابُوسَ بْنِ أَبِي ظَبْيَانَ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ ثُمَّ أُمِرَ بِالْهِجْرَةِ فَنَزَلَتْ عَلَيْهِ وَقُلْ رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں: نبی اکرم ﷺ مکہ میں تھے،پھرآپ کو ہجرت کا حکم ملا،اسی موقع پر آیت: وَقُلْ رَبِّ أَدْخِلْنِی مُدْخَلَ صِدْقٍ وَأَخْرِجْنِی مُخْرَجَ صِدْقٍ وَاجْعَلْ لِی مِنْ لَدُنْکَ سُلْطَانًا نَصِیرًا ۱؎ نازل ہوئی۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3139] کان النبيﷺ بمکۃ ثم أمر بالھجرۃ
إسنادہ ضعیف باب ومن سورۃ بني إسرائیل
قابوس : ضعیف (تقدم : 1053) `;
tirmizi.anwaar = [282,1];