var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ،حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ،عَنْ لَيْثٍ،عَنْ عَبْدِاللهِ بْنِ الْحَسَنِ،عَنْ أُمِّهِ فَاطِمَةَ بِنْتِ الْحُسَيْنِ،عَنْ جَدَّتِهَا فَاطِمَةَ الْكُبْرَى قَالَتْ: كَانَ رَسُولُ اللهِ ﷺ إِذَا دَخَلَ الْمَسْجِدَ صَلَّى عَلَى مُحَمَّدٍ وَسَلَّمَ،وَقَالَ: رَبِّ اغْفِرْ لِي ذُنُوبِي،وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ،وَإِذَا خَرَجَ صَلَّى عَلَى مُحَمَّدٍ وَسَلَّمَ،وَقَالَ: رَبِّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ فَضْلِكَ.";
tirmizi.urdu = "فاطمہ بنت حسین اپنی دادی فاطمہ کبریٰ رضی اللہ عنہا سے روایت کرتی ہیں کہ رسول اللہﷺ جب مسجد میں داخل ہوتے تو محمد(ﷺ) پردرود وسلام بھیجتے اور یہ دعاپڑھتے: 'رَبِّ اغْفِرْ لِی ذُنُوبِی وَافْتَحْ لِی أَبْوَابَ رَحْمَتِکَ' (اے میرے رب! میرے گناہ بخش دے اور اپنی رحمت کے دروازے میرے لیے کھول دے) اور جب نکلتے تو محمد(ﷺ)پر صلاۃ (درود) وسلام بھیجتے اوریہ کہتے:'رَبِّ اغْفِرْ لِی ذُنُوبِی وَافْتَحْ لِی أَبْوَابَ فَضْلِکَ' (اے میرے رب! میرے گناہ بخش دے اور اپنے فضل کے دروازے میرے لیے کھول دے)";
tirmizi.hukam = "";
tirmizi.description = `[314] رب اغفر لي ذنوبي وافتح لي
إسنادہ ضعیف / جہ 771    باب ما جاء ما یقول عند دخولہ المسجد
لیث بن أبي سلیم ضعیف ( تقدم: 218) وحدیث مسلم (713) یغني عنہ۔`;
tirmizi.anwaar = [198,1];