var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدِ بْنِ فُضَيْلٍ الْجَزَرِيُّ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا صَفْوَانُ بْنُ صَالِحٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ يَزِيدَ بْنِ يُوسُفَ الصَّنْعَانِيِّ عَنْ مَكْحُولٍ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ وَكَانَ تَحْتَهُ كَنْزٌ لَهُمَا قَالَ ذَهَبٌ وَفِضَّةٌ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ حَدَّثَنَا صَفْوَانُ بْنُ صَالِحٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ يَزِيدَ بْنِ يُوسُفَ الصَّنْعَانِيِّ عَنْ يَزِيدَ بْنِ يَزِيدَ بْنِ جَابِرٍ عَنْ مَكْحُولٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "ابوالدرداء رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے اللہ تعالیٰ کے قول وَکَانَ تَحْتَہُ کَنْزٌ لَہُمَا ۱؎ کے بارے میں فرمایا:’’کنز سے مراد سونا چاندی ہے‘‘۔اس سند سے یزید بن یزید بن جابرکے واسطہ سے مکحول سے اسی سند سے اسی جیسی حدیث آئی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3152] ذھب وفضۃ
إسنادہ ضعیف باب ومن سورۃ الکھف
یزید بن یوسف : ضعیف (تق: 7794) `;
tirmizi.anwaar = [283,1];