var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَيْلُ وَادٍ فِي جَهَنَّمَ يَهْوِي فِيهِ الْكَافِرُ أَرْبَعِينَ خَرِيفًا قَبْلَ أَنْ يَبْلُغَ قَعْرَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ";
tirmizi.urdu = "ابوسعیدخدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺنے فرمایا: ' ویل' جہنم کی ایک وادی ہے (اور اتنی گہری ہے کہ) جب کافر اس میں گرے گا تو اس کو تہہ تک پہنچنے سے پہلے گرنے میں چالیس سال لگ جائیں گے' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-ہم ابن لہیعہ کے سوا کسی اور کو نہیں جانتے کہ وہ اسے مرفوعاً روایت کرتا ہو۔";
tirmizi.hukam = "";
tirmizi.description = `[3164] ویل واد في جھنم
إسنادہ ضعیف / تقدم طرفہ : 2576  باب ومن سورۃ الأنبیاء`;
tirmizi.anwaar = [283,1];