var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ قَالَ حَدَّثَنِي اللَّيْثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ خَالِدٍ عَنْ ابْنِ شِهَابٍ عَنْ مُحَمَّدِ بْنِ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا سُمِّيَ الْبَيْتَ الْعَتِيقَ لِأَنَّهُ لَمْ يَظْهَرْ عَلَيْهِ جَبَّارٌ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ الزُّهْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ";
tirmizi.urdu = "عبداللہ بن زبیر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' خانہ کعبہ کا نام بیت عتیق ۱؎ (آزاد گھر) اس لیے رکھاگیا کہ اس پر کسی جابر وظالم کا غلبہ وقبضہ نہیں ہوسکاہے'۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-یہ حدیث زہری کے واسطہ سے نبی اکرمﷺسے مرسل طریقہ سے آئی ہے۔اس سند سے زہری کے واسطہ سے نبی اکرم ﷺ سے اسی طرح روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3170] إنما سمي البیت العتیق لأنہ لم یظھر
إسنادہ ضعیف باب ومن سورۃ الحج
ابن شہاب الزہري عنعن (تقدم : 440) `;
tirmizi.anwaar = [284,1];