var tirmizi = {};
tirmizi.arabic = "وَقَدْ رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ بَنَى لِلَّهِ مَسْجِدًا صَغِيرًا كَانَ أَوْ كَبِيرًا بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ حَدَّثَنَا بِذَلِكَ قُتَيْبَةُ حَدَّثَنَا نُوحُ بْنُ قَيْسٍ عَنْ عَبْدِ الرَّحْمَنِ مَوْلَى قَيْسٍ عَنْ زِيَادٍ النُّمَيْرِيِّ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا";
tirmizi.urdu = "انس رضی اللہ عنہ سے روایت کی گئی ہے کہ نبی اکرمﷺ نے فرمایا:' جس نے اللہ کے لیے کوئی مسجد بنائی،چھوٹی ہویا بڑی،اللہ اس کے لیے جنت میں ایک گھر بنائے گا'۔";
tirmizi.hukam = "";
tirmizi.description = `[319] من بنی للّٰہ مسجدًا صغیرًا کان أوکبیرًا
إسنادہ ضعیف باب ما جاء في فضل بنیان المسجد
زیاد النمیري : ضعیف [’’ وھو ضعیف عندالجمھور ‘‘ ( مجمع الزوائد 10 / 388) ] وعبد الرحمن مولی قیس : مجہول ( تق: 2087،4053) `;
tirmizi.anwaar = [198,1];