var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو أُسَامَةَ وَعَبْدُ اللَّهِ بْنُ بَكْرٍ السَّهْمِيُّ عَنْ حَاتِمِ بْنِ أَبِي صَغِيرَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ أَبِي صَالِحٍ عَنْ أُمِّ هَانِئٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ وَتَأْتُونَ فِي نَادِيكُمْ الْمُنْكَرَ قَالَ كَانُوا يَخْذِفُونَ أَهْلَ الْأَرْضِ وَيَسْخَرُونَ مِنْهُمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ حَاتِمِ بْنِ أَبِي صَغِيرَةَ عَنْ سِمَاكٍ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا سُلَيْمُ بْنُ أَخْضَرَ عَنْ حَاتِمِ بْنِ أَبِي صَغِيرَةَ بِهَذَا الْإِسْنَادِ نَحْوَهُ";
tirmizi.urdu = "ام ہانی رضی اللہ عنہا کہتی ہیں: نبی اکرم ﷺ نے آیت وَتَأْتُونَ فِی نَادِیکُمُ الْمُنْکَرَ کے بارے میں ۱؎ فرمایا:' وہ (اپنی محفلوں میں)لوگوں پر کنکریاں پھینکتے تھے (بدتمیزی کرتے) اور ان کا مذاق اڑاتے تھے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن ہے،اور ہم اسے صرف حاتم بن ابی صغیرہ کی روایت سے جانتے ہیں جسے وہ سماک سے روایت کرتے ہیں۔\nاس سندسےسلیم بن اخضرنے حاتم بن ابی صغیرہ سے اسی سند کے ساتھ اسی طرح کی حدیث روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3190] کانوا یخذفون أھل الأرض
إسنادہ ضعیف باب ومن سورۃ العنکبوت
أبو صالح باذام: ضعیف ( تقدم : 732 ) `;
tirmizi.anwaar = [284,1];