var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ الْعَطَّارُ الْبَصْرِيُّ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ عَنْ إِسْحَقَ بْنِ يَحْيَى بْنِ طَلْحَةَ عَنْ مُوسَى بْنِ طَلْحَةَ قَالَ دَخَلْتُ عَلَى مُعَاوِيَةَ فَقَالَ أَلَا أُبَشِّرُكَ فَقُلْتُ بَلَى قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ طَلْحَةُ مِمَّنْ قَضَى نَحْبَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ مُعَاوِيَةَ إِلَّا مِنْ هَذَا الْوَجْهِ وَإِنَّمَا رُوِيَ هَذَا عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِيهِ";
tirmizi.urdu = "موسیٰ بن طلحہ کہتے ہیں کہ میں معاویہ رضی اللہ عنہ کے پاس گیا توانہوں نے کہا: کیا میں تمہیں ایک خوش خبری نہ سنادوں؟ میں نے کہا: ضرور،سنائیے،کہامیں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ہے کہ 'طلحہ رضی اللہ عنہ ان لوگوں میں سے ہیں جن کے بارے میں اللہ تعالیٰ نے مِمَّنْ قَضَی نَحْبَہُ فرمایاہے'،یعنی جو اپنا کام پورا کرچکے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،ہم اسے معاویہ رضی اللہ عنہ کی روایت سے صرف اسی سندسے جانتے ہیں،۲-جبکہ یہ حدیث موسیٰ بن طلحہ صرف طلحہ کی حدیث سے روایت کی جاتی ہے،(جوآگے آرہی ہے)";
tirmizi.hukam = "";
tirmizi.description = `[3202] ألا أبشرک
إسنادہ ضعیف / جہ 126۔127،یأتي : 3740   باب ومن سورۃ الأحزاب
إسحاق بن یحیی بن طلحۃ ضعیف ( تقدم : 2654) و الحدیث الآتي ( الأصل : 3203 ) یغني عنہ۔`;
tirmizi.anwaar = [285,1];