var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَبَانَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ لَوْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَاتِمًا شَيْئًا مِنْ الْوَحْيِ لَكَتَمَ هَذِهِ الْآيَةَ وَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ الْآيَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں: اگر رسول اللہ ﷺ وحی میں سے کوئی چیز چھپالینے والے ہوتے تو آیت وَإِذْ تَقُولُ لِلَّذِی أَنْعَمَ اللَّہُ عَلَیْہِ وَأَنْعَمْتَ عَلَیْہِ کوچھپاتے۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;