var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ قَزَعَةَ الْبَصْرِيُّ حَدَّثَنَا مَسْلَمَةُ بْنُ عَلْقَمَةَ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ عَامِرٍ الشَّعْبِيِّ فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ مَا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِكُمْ قَالَ مَا كَانَ لِيَعِيشَ لَهُ فِيكُمْ وَلَدٌ ذَكَرٌ";
tirmizi.urdu = "عامر شعبی اللہ کے اس قول مَا کَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِکُمْ ۱؎ کے بارے میں کہتے ہیں: اس سے مراد زندہ نہ رہنے والی نرینہ اولاد ہے۲؎۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;