var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْوَلِيدِ بْنِ الْعَيْزَارِ أَنَّهُ سَمِعَ رَجُلًا مِنْ ثَقِيفٍ يُحَدِّثُ عَنْ رَجُلٍ مِنْ كِنَانَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي هَذِهِ الْآيَةِ ثُمَّ أَوْرَثْنَا الْكِتَابَ الَّذِينَ اصْطَفَيْنَا مِنْ عِبَادِنَا فَمِنْهُمْ ظَالِمٌ لِنَفْسِهِ وَمِنْهُمْ مُقْتَصِدٌ وَمِنْهُمْ سَابِقٌ بِالْخَيْرَاتِ قَالَ هَؤُلَاءِ كُلُّهُمْ بِمَنْزِلَةٍ وَاحِدَةٍ وَكُلُّهُمْ فِي الْجَنَّةِ قَالَ هَذَا حَدِيثٌ غَرِيبٌ حَسَنٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "ابوسعید خدری رضی اللہ عنہ کہتے ہیں: نبی اکرمﷺنے اس آیت ثُمَّ أَوْرَثْنَا الْکِتَابَ الَّذِینَ اصْطَفَیْنَا مِنْ عِبَادِنَا فَمِنْہُمْ ظَالِمٌ لِنَفْسِہِ وَمِنْہُمْ مُقْتَصِدٌ وَمِنْہُمْ سَابِقٌ بِالْخَیْرَاتِ ۱؎ کے سلسلے میں فرمایا:' یہ سب ایک ہی درجے میں ہوں گے اور یہ سب کے سب جنت میں جانے والے لوگ ہیں'۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3225] ھٰؤلاء کلھم بمنزلۃ واحدۃ
إسنادہ ضعیف باب ومن سورۃ الملائکۃ
رجل من ثقیف ورجل من کنانۃ مجھولان وللحدیث شواھد ضعیفۃ عند الحاکم ( 2/ 426) وأحمد ( 5/ 194،198،6/ 444 ) وغیرھما۔`;
tirmizi.anwaar = [285,1];