var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ وَزِيرٍ الْوَاسِطِيُّ حَدَّثَنَا إِسْحَقُ بْنُ يُوسُفَ الْأَزْرَقُ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ أَبِي سُفْيَانَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كَانَتْ بَنُو سَلِمَةَ فِي نَاحِيَةِ الْمَدِينَةِ فَأَرَادُوا النُّقْلَةَ إِلَى قُرْبِ الْمَسْجِدِ فَنَزَلَتْ هَذِهِ الْآيَةَ إِنَّا نَحْنُ نُحْيِ الْمَوْتَى وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ آثَارَكُمْ تُكْتَبُ فَلَا تَنْتَقِلُوا قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ الثَّوْرِيِّ وَأَبُو سُفْيَانَ هُوَ طَرِيفٌ السَّعْدِيُّ";
tirmizi.urdu = "ابوسعید خدری رضی اللہ عنہ کہتے ہیں: بنوسلمہ (قبیلہ کے لوگ) مدینہ کے کسی نواحی علاقہ میں رہتے تھے۔انہوں نے وہاں سے منتقل ہوکر مسجد (نبوی) کے قریب آکر آباد ہونے کا ارادہ کیا تویہ آیت إِنَّا نَحْنُ نُحْیِ الْمَوْتَی وَنَکْتُبُ مَا قَدَّمُوا وَآثَارَہُمْ ۱؎ نازل ہوئی،تو رسول اللہ ﷺ نے فرمایا:' تمہارے قدم لکھے جاتے ہیں،اس لیے تم اپنے گھر نہ بدلو'۔امام ترمذی کہتے ہیں: ثوری سے مروی یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3226] إن آثارکم تکتب فلا تنتقلوا
إسنادہ ضعیف باب ومن سورۃ یٰسٓ
أبو سفیان طریف بن شھاب : ضعیف ( تقدم : 238) وللحدیث شواھد عند ابن ماجہ ( 785) والبزار وابن أبي حاتم وغیرہم دون قولہ : ’’ تنزلت ھٰذہ الآیۃ ‘‘۔`;
tirmizi.anwaar = [285,1];