var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ حَدَّثَنَا لَيْثُ بْنُ أَبِي سُلَيْمٍ عَنْ بِشْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ دَاعٍ دَعَا إِلَى شَيْءٍ إِلَّا كَانَ مَوْقُوفًا يَوْمَ الْقِيَامَةِ لَازِمًا بِهِ لَا يُفَارِقُهُ وَإِنْ دَعَا رَجُلٌ رَجُلًا ثُمَّ قَرَأَ قَوْلَ اللَّهِ عَزَّ وَجَلَّ وَقِفُوهُمْ إِنَّهُمْ مَسْئُولُونَ مَا لَكُمْ لَا تَنَاصَرُونَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا: ' جس کسی نے بھی کسی چیز کی طرف دعوت دی قیامت کے دن وہ اسی کے ساتھ چمٹااورٹھہرا رہے گا،وہ اسے چھوڑ کر آگے نہیں جاسکتا اگر چہ ایک آدمی نے ایک آدمی ہی کو بلایاہو' پھر آپ نے آیت وَقِفُوہُمْ إِنَّہُمْ مَسْئُولُونَ مَا لَکُمْ لاَتَنَاصَرُونَ ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3228] ما من داع دعا إلی شئ
إسنادہ ضعیف باب ومن سورۃ والصافات
لیث ضعیف ( تقدم : 218) وبشر : مجھول ( تقدم : 3126 )`;
tirmizi.anwaar = [286,1];