var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ زُهَيْرِ بْنِ مُحَمَّدٍ عَنْ رَجُلٍ عَنْ أَبِي الْعَالِيَةِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِ اللَّهِ تَعَالَى وَأَرْسَلْنَاهُ إِلَى مِائَةِ أَلْفٍ أَوْ يَزِيدُونَ قَالَ عِشْرُونَ أَلْفًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ سے آیت کریمہ: وَأَرْسَلْنَاہُ إِلَی مِائَۃِ أَلْفٍ أَوْ یَزِیدُونَ ۱؎ کے بارے میں پوچھاتوآپ نے فرمایا: ' ایک لاکھ بیس ہزار تھے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3229] عشرون ألفًا
إسنادہ ضعیف باب ومن سورۃ والصافات
رجل : مجہول `;
tirmizi.anwaar = [286,1];