var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ ابْنُ عَثْمَةَ حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِ اللَّهِ وَجَعَلْنَا ذُرِّيَّتَهُ هُمْ الْبَاقِينَ قَالَ حَامٌ وَسَامٌ وَيَافِثُ قَالَ أَبُو عِيسَى يُقَالُ يَافِتُ وَيَافِثُ بِالتَّاءِ وَالثَّاءِ وَيُقَالُ يَفِثُ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ سَعِيدِ بْنِ بَشِيرٍ";
tirmizi.urdu = "سمرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺنے اللہ تعالیٰ کے قول وَجَعَلْنَا ذُرِّیَّتَہُ ہُمُ الْبَاقِینَ ۱؎ کی تفسیر میں فرمایا:' (نوح کے تین بیٹے) حام،سام اور یافث تھے'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،ہم اسے صرف سعید بن بشیر کی روایت سے ہی جانتے ہیں،۲-یافت 'ت' سے اور یافث 'ث' سے دونوں طرح سے کہاجاتاہے ' یفث' بھی کہاجاتاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3230] حام وسام ویافث
إسنادہ ضعیف باب ومن سورۃ والصافات
سعید بن بشیر : ضعیف ( تقدم : 2443) `;
tirmizi.anwaar = [286,1];