var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الْعَقَدِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَامٌ أَبُو الْعَرَبِ وَحَامٌ أَبُو الْحَبَشِ وَيَافِثُ أَبُو الرُّومِ";
tirmizi.urdu = "سمرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺنے فرمایا:'سام ابوالعرب (عربوں کے باپ) ہیں اور حام ابوالحبش (اہل حبشہ کے باپ) ہیں اور یافث ابوالروم (رومیوں کے باپ) ہیں'۔";
tirmizi.hukam = "";
tirmizi.description = `[3231] سام أبو العرب وحام أبو الحبش
ضعیف / یأتي : 3931  باب ومن سورۃ والصافات
قتادۃ عنعن ( تقدم : 30) وللحدیث شاہدان ضعیفان عند الطبراني فی الکبیر (254/7،146/18) `;
tirmizi.anwaar = [286,1];