var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ: حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ،عَنْ مَنْصُورٍ،عَنْ إِبْرَاهِيمَ،عَنْ عَبِيدَةَ،عَنْ عَبْدِ اللَّهِ،قَالَ: «فَضَحِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَجُّبًا وَتَصْدِيقًا».: «هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ»";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں:پس نبی اکرمﷺتعجب سے اور(اس کی باتوں کی)تصدیق میں ہنس پڑے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "متفق علیہ — صحیح بخاری و صحیح مسلم";
tirmizi.description = ``;