var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ حَدَّثَنَا وَكِيعٌ عَنْ مُوسَى بْنِ عُبَيْدَةَ عَنْ يَزِيدَ بْنِ أَبَانَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُؤْمِنٍ إِلَّا وَلَهُ بَابَانِ بَابٌ يَصْعَدُ مِنْهُ عَمَلُهُ وَبَابٌ يَنْزِلُ مِنْهُ رِزْقُهُ فَإِذَا مَاتَ بَكَيَا عَلَيْهِ فَذَلِكَ قَوْلُهُ عَزَّ وَجَلَّ فَمَا بَكَتْ عَلَيْهِمْ السَّمَاءُ وَالْأَرْضُ وَمَا كَانُوا مُنْظَرِينَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ هَذَا الْوَجْهِ وَمُوسَى بْنُ عُبَيْدَةَ وَيَزِيدُ بْنُ أَبَانَ الرَّقَاشِيُّ يُضَعَّفَانِ فِي الْحَدِيثِ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺنے فرمایا:' ہرمومن کے لیے دو دروازے ہیں،ایک دروازہ وہ ہے جس سے اس کے نیک عمل چڑھتے ہیں اور ایک دروازہ وہ ہے جس سے اس کی روزی اترتی ہے،جب وہ مرجاتاہے تو یہ دونوں اس پر روتے ہیں،یہی ہے اللہ تعالیٰ کے اس فرمان: فَمَا بَکَتْ عَلَیْہِمُ السَّمَاء وَالأَرْضُ وَمَا کَانُوا مُنظَرِینَ (الدخان: 29) ۱؎ کامطلب '۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،ہم اسے مرفوع صرف اسی سند سے جانتے ہیں،۲-موسیٰ بن عبیدہ اور یزید بن ابان رقاشی حدیث بیان کرنے میں ضعیف ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3255] ما من مؤمن إلا ولہ بابان
إسنادہ ضعیف باب ومن سورۃ الدخان
یزید بن أبان و موسی بن عبیدۃ : ضعیفان ( تقدم : 1398،1122) `;
tirmizi.anwaar = [287,1];