var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا شَيْخٌ مِنْ أَهْلِ الْمَدِينَةِ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ تَلَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا هَذِهِ الْآيَةَ وَإِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُونُوا أَمْثَالَكُمْ قَالُوا وَمَنْ يُسْتَبْدَلُ بِنَا قَالَ فَضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَنْكِبِ سَلْمَانَ ثُمَّ قَالَ هَذَا وَقَوْمُهُ هَذَا وَقَوْمُهُ قَالَ هَذَا حَدِيثٌ غَرِيبٌ فِي إِسْنَادِهِ مَقَالٌ وَقَدْ رَوَى عَبْدُ اللَّهِ بْنُ جَعْفَرٍ أَيْضًا هَذَا الْحَدِيثَ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں: رسول اللہ ﷺ نے ایک دن یہ آیت وَإِنْ تَتَوَلَّوْا یَسْتَبْدِلْ قَوْمًا غَیْرَکُمْ ثُمَّ لا یَکُونُوا أَمْثَالَکُمْ ۱؎ تلاوت فرمائی،صحابہ نے کہا: ہمارے بدلے کون لوگ لائے جائیں گے؟ آپﷺ نے سلمان کے کندھے پرہاتھ مارا (رکھا) پھر فرمایا:' یہ اوراس کی قوم،یہ اور اس کی قوم'۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-اس کی سند میں کلام ہے،۳-عبداللہ بن جعفرنے بھی یہ حدیث علاء بن عبدالرحمٰن سے روایت کی ہے۔(ان کی روایت آگے آرہی ہے)";
tirmizi.hukam = "";
tirmizi.description = `[3260] ھذا و قومہ،ھذا و قومہ
إسنادہ ضعیف باب ومن سورۃ محمد (ﷺ)
شیخ من أھل المدینۃ مجھول۔`;
tirmizi.anwaar = [287,1];