var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ وَابْنُ أَبِي رِزْمَةَ وَأَبُو نُعَيْمٍ عَنْ إِسْرَائِيلَ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ مَا كَذَبَ الْفُؤَادُ مَا رَأَى قَالَ رَآهُ بِقَلْبِهِ قَالَ هَذَا حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ انہوں نے آیت مَا کَذَبَ الْفُؤَادُ مَا رَأَی ۱؎ پڑھی،کہا: نبی اکرمﷺنے اپنے رب کو دل کی آنکھ سے دیکھا۔امام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;