var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ الْخُزَاعِيُّ الْمَرْوَزِيُّ حَدَّثَنَا وَكِيعٌ عَنْ مُوسَى بْنِ عُبَيْدَةَ عَنْ يَزِيدَ بْنِ أَبَانَ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ إِنَّا أَنْشَأْنَاهُنَّ إِنْشَاءً قَالَ إِنَّ مِنْ الْمُنْشَآتِ اللَّائِي كُنَّ فِي الدُّنْيَا عَجَائِزَ عُمْشًا رُمْصًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مَرْفُوعَا إِلَّا مِنْ حَدِيثِ مُوسَى بْنِ عُبَيْدَةَ وَمُوسَى بْنُ عُبَيْدَةَ وَيَزِيدُ بْنُ أَبَانَ الرَّقَاشِيُّ يُضَعَّفَانِ فِي الْحَدِيثِ";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں: رسول اللہ ﷺ نے آیت: إِنَّا أَنْشَأْنَاہُنَّ إِنْشَائً ۱؎ کے سلسلے میں فرمایا: 'ان نئی اٹھان والی عورتوں میں وہ عورتیں بھی ہیں جو دنیا میں بوڑھی تھیں،جن کی آنکھیں خراب ہوچکی ہوں اور ان سے پانی بہتارہتاہو'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،ہم اسے مرفوع صرف موسیٰ بن عبیدہ کی روایت سے جانتے ہیں،۲-اور موسیٰ بن عبیدہ اور یزید بن ابان رقاشی حدیث بیان کرنے میں ضعیف قرار دیئے گئے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3296] إن من المنشآت اللا ئي کن فی الدنیا
إسنادہ ضعیف باب ومن سورۃ الواقعۃ
موسی بن عبیدۃ ضعیف ویزید بن أبان ضعیفان ( تقدم : 1122،1398 ) `;
tirmizi.anwaar = [288,1];