var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ سَعْدٍ الرَّازِيُّ أَنَّ أَبَاهُ أَخْبَرَهُ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَجُلًا بِبُخَارَى عَلَى بَغْلَةٍ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ وَيَقُولُ كَسَانِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
tirmizi.urdu = "عبدالرحمٰن بن عبداللہ بن سعد رازی سے روایت ہے کہ ان کے باب عبداللہ نے ان کو خبر دی،انہوں نے کہا: میں نے ایک شخص کو بخاریٰ میں خچر پر سوار سرپر سیاہ عمامہ باندھے ہوئے دیکھا وہ کہتا تھا: یہ وہ عمامہ ہے جسے رسول اللہ ﷺ نے مجھے پہنایا ہے ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[3321] رأیت رجلاً ببخاری علی بغلۃ
إسنادہ ضعیف / د 4038    باب ومن سورۃ الحاقۃ`;
tirmizi.anwaar = [289,1];