var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَزَّارُ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ أَخْبَرَنَا سُهَيْلُ بْنُ عَبْدِ اللَّهِ الْقُطَعِيُّ وَهُوَ أَخُو حَزْمِ بْنِ أَبِي حَزْمٍ الْقُطَعِيُّ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي هَذِهِ الْآيَةَ هُوَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَةِ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ أَنَا أَهْلٌ أَنْ أُتَّقَى فَمَنْ اتَّقَانِي فَلَمْ يَجْعَلْ مَعِي إِلَهًا فَأَنَا أَهْلٌ أَنْ أَغْفِرَ لَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَسُهَيْلٌ لَيْسَ بِالْقَوِيِّ فِي الْحَدِيثِ وَقَدْ تَفَرَّدَ بِهَذَا الْحَدِيثِ عَنْ ثَابِتٍ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺنے آیت کریمہ: ہُوَ أَہْلُ التَّقْوَی وَأَہْلُ الْمَغْفِرَۃِ ۱؎ کے بارے میں فرمایا: اللہ عزوجل کہتا ہے کہ میں اس کا اہل اور سزاوار ہوں کہ مجھ سے ڈرا جائے،تو جو مجھ سے ڈرا اور میرے ساتھ کسی اور کو معبود نہ ٹھہرا یا تو مجھے لائق ہے کہ میں اسے بخش دوں۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-سہل حدیث میں قوی نہیں مانے جاتے ہیں اوروہ یہ حدیث ثابت سے روایت کرنے میں تنہا(بھی) ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3328] قال اللّٰہ تبارک وتعالی : أنا أھل أن اتقٰی
إسنادہ ضعیف / جہ 4299   باب ومن سورۃ المدثر
سہیل : ضعیف ( تقدم :3250 ) `;
tirmizi.anwaar = [289,2];