var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْعَبْدَ إِذَا أَخْطَأَ خَطِيئَةً نُكِتَتْ فِي قَلْبِهِ نُكْتَةٌ سَوْدَاءُ فَإِذَا هُوَ نَزَعَ وَاسْتَغْفَرَ وَتَابَ سُقِلَ قَلْبُهُ وَإِنْ عَادَ زِيدَ فِيهَا حَتَّى تَعْلُوَ قَلْبَهُ وَهُوَ الرَّانُ الَّذِي ذَكَرَ اللَّهُ كَلَّا بَلْ رَانَ عَلَى قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' بندہ جب کوئی گناہ کرتاہے تو اس کے دل میں ایک سیاہ نکتہ پڑجاتا ہے،پھر جب وہ گناہ کو چھوڑ دیتا ہے اور استغفاراور توبہ کرتاہے تو اس کے دل کی صفائی ہوجاتی ہے (سیاہ دھبہ مٹ جاتا ہے) اور اگر وہ گناہ دوبارہ کرتاہے تو سیاہ نکتہ مزید پھیل جاتاہے یہاں تک کہ پورے دل پر چھا جاتا ہے،اور یہی وہ 'ران' ہے جس کا ذکر اللہ نے اس آیت کَلاَّ بَلْ رَانَ عَلَی قُلُوبِہِمْ مَا کَانُوا یَکْسِبُونَ ۱؎ میں کیاہے'۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3334] إن العبد إذا أخطأ خطیئۃ
إسنادہ ضعیف / جہ 4244،نک 11658 باب و من سورۃ ویل للمطففین
محمد بن عجلان عنعن ( تقدم : 1084)`;
tirmizi.anwaar = [290,1];