var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ دُرُسْتَ الْبَصْرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ حَمَّادٌ هُوَ عِنْدَنَا مَرْفُوعٌ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ قَالَ يَقُومُونَ فِي الرَّشْحِ إِلَى أَنْصَافِ آذَانِهِمْ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے،وہ آیت یَوْمَ یَقُومُ النَّاسُ لِرَبِّ الْعَالَمِینَ ۱؎ کی تفسیر میں کہتے ہیں کہ لو گ آدھے کانوں تک پسینے میں شرابور ہوں گے۔\nحماد کہتے ہیں: یہ حدیث ہمارے نزدیک مرفوع ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;