var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ ابْنِ عَوْنٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ قَالَ يَقُومُ أَحَدُهُمْ فِي الرَّشْحِ إِلَى أَنْصَافِ أُذُنَيْهِ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِيهِ عَنْ أَبِي هُرَيْرَةَ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے آیت 'یَوْمَ یَقُومُ النَّاسُ لِرَبِّ الْعَالَمِینَ' کی تفسیر میں فرمایا کہ اس دن ہر ایک آدھے کانوں تک پسینے میں کھڑا ہوگا۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے،اور اس باب میں ابوہریرہ سے بھی روایت ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;