var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ قَال سَمِعْتُ رَجُلًا بَدَوِيًّا أَعْرَابِيًّا يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَرْوِيهِ يَقُولُ مَنْ قَرَأَ وَالتِّينِ وَالزَّيْتُونِ فَقَرَأَ أَلَيْسَ اللَّهُ بِأَحْكَمِ الْحَاكِمِينَ فَلْيَقُلْ بَلَى وَأَنَا عَلَى ذَلِكَ مِنْ الشَّاهِدِينَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِنَّمَا يُرْوَى بِهَذَا الْإِسْنَادِ عَنْ هَذَا الْأَعْرَابِيِّ عَنْ أَبِي هُرَيْرَةَ وَلَا يُسَمَّى";
tirmizi.urdu = "اسماعیل بن امیہ کہتے ہیں: میں نے ایک بدوی اعرابی کو کہتے ہوئے سنا،میں نے ابوہریرہ رضی اللہ عنہ کو اسے روایت کرتے ہوئے سنا ہے،وہ کہتے تھے جو شخص (سورہ) وَالتِّینِ وَالزَّیْتُونِ پڑھے اور پڑھتے ہوئے أَلَیْسَ اللَّہُ بِأَحْکَمِ الْحَاکِمِینَ تک پہنچے تو کہے:'بلی وأنا ذلک من الشاہدین'۔\nامام ترمذی کہتے ہیں: یہ حدیث اسی سند کے ساتھ اسی اعرابی سے ابوہریرہ کے واسطے سے مروی ہے اور اس اعرابی کانام نہیں لیاگیا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3347] من قرأ سورۃ : والتین والزیتون
إسنادہ ضعیف / د 887 باب ومن سورۃ والتین
رجل بدوي أعرابي : مجہول ( المجموع شرح المہذب 67/4) `;
tirmizi.anwaar = [290,1];