var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ الرَّازِيُّ عَنْ عَمْرِو بْنِ أَبِي قَيْسٍ عَنْ الْحَجَّاجِ عَنْ الْمِنْهَالِ بْنِ عَمْرٍو عَنْ زِرِّ بْنِ حُبَيْشٍ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ مَا زِلْنَا نَشُكُّ فِي عَذَابِ الْقَبْرِ حَتَّى نَزَلَتْ أَلْهَاكُمْ التَّكَاثُرُ قَالَ أَبُو كُرَيْبٍ مَرَّةً عَنْ عَمْرِو بْنِ أَبِي قَيْسٍ هُوَ رَازِيٌّ وَعَمْرُو بْنُ قَيْسٍ الْمُلَائِيُّ كُوفِيٌّ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْمِنْهَالِ بْنِ عَمْرٍو قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں: ہم عذاب قبر کے بارے میں برابر شک میں رہے،یہاں تک کہ سورہ أَلْہَاکُمْ التَّکَاثُرُ نازل ہوئی،تو ہمیں اس پر یقین حاصل ہوا۔\nابوکریب کبھی عمرو بن ابی قیس کہتے ہیں،تو یہ عمروبن قیس رازی ہیں-اور عمر وبن قیس ملائی کوفی ہیں اور یہ ابن ابی لیلیٰ سے روایت کرتے ہیں: اوروہ (ابن ابی لیلیٰ) روایت کرتے ہیں منہال بن عمرو سے۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3355] ما زلنا نشک في عذاب القبر
إسنادہ ضعیف باب ومن سورۃ ألھاکم التکاثر
حجاج بن أرطاۃ ضعیف مدلس ( تقدم:527) وتابعہ محمد ابن أبي لیلی في سند المؤلف و محمد ابن أبي لیلی: ضعیف (تقدم : 194 ) `;
tirmizi.anwaar = [291,1];