var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا عِمْرَانُ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اللَّهِ تَعَالَى مِنْ الدُّعَاءِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ حَدِيثِ عِمْرَانَ الْقَطَّانِ وَعِمْرَانُ الْقَطَّانُ هُوَ ابْنُ دَاوَرَ وَيُكْنَى أَبَا الْعَوَّامِ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ عِمْرَانَ الْقَطَّانِ بِهَذَا الْإِسْنَادِ نَحْوَهُ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' اللہ کے نزدیک دعا سے زیادہ معزز ومکرم کوئی چیز(عبادت) نہیں ہے' ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے مرفوع صرف عمران قطان کی روایت سے جانتے ہیں،عمران القطان یہ ابن داور ہیں اور ان کی کنیت ابوالعوام ہے۔عبدالرحمٰن بن مہدی نے عمران القطان سے اسی طرح اسی سند سے روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3370] لیس شيء أکرم علی اللّٰہ
إسنادہ ضعیف / جہ 3829   باب ما جاء في فضل الدعاء
قتادۃ عنعن ( تقدم : 30) `;
tirmizi.anwaar = [291,1];