var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا مَسْلَمَةُ بْنُ عَمْرٍو قَالَ كَانَ عُمَيْرُ بْنُ هَانِئٍ يُصَلِّي كُلَّ يَوْمٍ أَلْفَ سَجْدَةٍ وَيُسَبِّحُ مِائَةَ أَلْفِ تَسْبِيحَةٍ";
tirmizi.urdu = "مسلمہ بن عمرو کہتے ہیں کہ عمیر بن ہانی ۱؎ ہردن ہزار رکعتیں صلاۃ پڑھتے تھے،اور سوہزار (یعنی ایک لاکھ) تسبیحات پڑھتے تھے،یعنی سبحان اللہ کہتے تھے۔";
tirmizi.hukam = "";
tirmizi.description = `[3415] کان عمیر بن ھانئ یصلي کل یوم
إسنادہ ضعیف باب ما جاء فی الدعا إذا انتبہ من اللیل
مسلمۃ بن عمرو : مجہول ( تق: 6663) `;
tirmizi.anwaar = [293,1];