var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْأُمَوِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ يَعْنِي إِذَا خَرَجَ مِنْ بَيْتِهِ بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ يُقَالُ لَهُ كُفِيتَ وَوُقِيتَ وَتَنَحَّى عَنْهُ الشَّيْطَانُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' جو شخص گھر سے نکلتے وقت:'بِسْمِ اللَّہِ تَوَکَّلْتُ عَلَی اللَّہِ لاَ حَوْلَ وَلا قُوَّۃَ إِلاَّ بِاللَّہِ' ۱؎ کہے،اس سے کہاجائے گا: تمہاری کفایت کردی گئی،اورتم (دشمن کے شرسے)بچالیے گئے،اورشیطان تم سے دورہوگیا۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3426] من قال إذا خرج من بیتہ
إسنادہ ضعیف / د 5095    باب ما جاء مایقول إذا خرج من بیتہ
ابن جریج عنعن ولم یثبت تصریح سماعہ في ھذا الحدیث (تقدم : 674) `;
tirmizi.anwaar = [293,1];