var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ عَامِرٍ الشَّعْبِيِّ عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ مِنْ بَيْتِهِ قَالَ بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نَزِلَّ أَوْ نَضِلَّ أَوْ نَظْلِمَ أَوْ نُظْلَمَ أَوْ نَجْهَلَ أَوْ يُجْهَلَ عَلَيْنَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ام المومنین ام سلمہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم ﷺ جب گھر سے نکلتے تویہ دعا پڑھتے تھے: 'بِسْمِ اللَّہِ تَوَکَّلْتُ عَلَی اللَّہِ،اللَّہُمَّ إِنَّا نَعُوذُ بِکَ مِنْ أَنْ نَزِلَّ أَوْ نَضِلَّ أَوْ نَظْلِمَ أَوْ نُظْلَمَ أَوْ نَجْہَلَ أَوْ یُجْہَلَ عَلَیْنَا' ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3427] بسم اللّٰہ،توکلت علی اللّٰہ
إسنادہ ضعیف / د 5094،ن 5488،جہ 3884   باب منہ [دعاء: بسم اللّٰہ توکلت علی اللّٰہ ]`;
tirmizi.anwaar = [293,1];