var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو جَعْفَرٍ السِّمْنَانِيُّ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا مُطَرِّفُ بْنُ عَبْدِ اللَّهِ الْمَدِينِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ الْعُمَرِيُّ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَأَى مُبْتَلًى فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلَاكَ بِهِ وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلًا لَمْ يُصِبْهُ ذَلِكَ الْبَلَاءُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' جو شخص کسی شخص کو مصیبت میں مبتلا دیکھے پھر کہے:'الْحَمْدُ لِلَّہِ الَّذِی عَافَانِی مِمَّا ابْتَلاَکَ بِہِ وَفَضَّلَنِی عَلَی کَثِیرٍ مِمَّنْ خَلَقَ تَفْضِیلاً لَمْ یُصِبْہُ ذَلِکَ الْبَلاَئُ ' تو اسے یہ بلا نہ پہنچے گی'۔\nامام ترمذی کہتے ہیں: یہ حدیث اس سند سے غریب ہے۔\nنوٹ:(سندمیں عبد اللہ بن عمر العمری ضعیف راوی ہیں،لیکن شواہد کی بنا پر یہ حدیث صحیح لغیرہ ہے،ملاحظہ ہو: الصحیحہ: ۲۰۶،۲۷۳۷،وتراجع الالبا نی ۲۲۸)";
tirmizi.hukam = "";
tirmizi.description = `[3432] من رأی مبتلاً فقال
إسنادہ ضعیف باب ماجاء ما یقول إذا رأی مبتلی
عبد اللّٰہ بن عمر العمري ضعیف ( انظر د 3721 ) 
وللحدیث شواھد ضعیفۃ عند أبي نعیم الأصبہاني (حلیۃ الأولیاء 5/ 13) وغیرہ۔`;
tirmizi.anwaar = [294,1];