var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ الْمُغِيرَةِ الْمَخْزُومِيُّ الْمَدِينِيُّ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَهَمَّهُ الْأَمْرُ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ فَقَالَ سُبْحَانَ اللَّهِ الْعَظِيمِ وَإِذَا اجْتَهَدَ فِي الدُّعَاءِ قَالَ يَا حَيُّ يَا قَيُّومُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ جب کسی مشکل معاملے سے دوچار ہوتے تو اپنا سر آسمان کی طرف اٹھاتے پھر کہتے:' سُبْحَانَ اللَّہِ الْعَظِیمِ' (اللہ پاک و برتر ہے۔)اور جب جی جان لگا کر دعاکرتے تو کہتے: 'یَا حَیُّ یَا قَیُّومُ' (اے زندہ ذات! اے کائنات کانظام چلانے والے۔)\nامام ترمذی کہتے ہیں: یہ حدیث غریب۔";
tirmizi.hukam = "";
tirmizi.description = `[3436] کان إذا أھمہ الأمر رفع رأسہ۔۔۔۔۔سبحان اللّٰہ العظیم
إسنادہ ضعیف جدًا،باب ما جاء ما یقول عند الکرب
إبراہیم بن الفضل : متروک ( تقدم : 2687) `;
tirmizi.anwaar = [294,1];