var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ حُمَيْدٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَدِمَ مِنْ سَفَرٍ فَنَظَرَ إِلَى جُدْرَانِ الْمَدِينَةِ أَوْضَعَ رَاحِلَتَهُ وَإِنْ كَانَ عَلَى دَابَّةٍ حَرَّكَهَا مِنْ حُبِّهَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ";
tirmizi.urdu = "انس رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ جب سفر سے واپس لوٹتے اور مدینہ کی دیوار یں دکھائی دینے لگتیں تو آپ اپنی اونٹنی (سواری) کو (اپنے وطن) مدینہ کی محبت میں تیز دوڑاتے ۱؎ اور اگر اپنی اونٹنی کے علاوہ کسی اور سواری پر ہوتے تو اسے بھی تیز بھگاتے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;