var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عُبَيْدِ اللَّهِ السُّلَيْمِيُّ الْبَصْرِيُّ حَدَّثَنَا أَبُو قُتَيْبَةَ سَلْمُ بْنُ قُتَيْبَةَ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ أُمَيَّةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَدَّعَ رَجُلًا أَخَذَ بِيَدِهِ فَلَا يَدَعُهَا حَتَّى يَكُونَ الرَّجُلُ هُوَ يَدَعُ يَدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيَقُولُ اسْتَوْدِعْ اللَّهَ دِينَكَ وَأَمَانَتَكَ وَآخِرَ عَمَلِكَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ ابْنِ عُمَرَ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ نبی اکرم ﷺ جب کسی شخص کو رخصت کرتے تواس کاہاتھ پکڑتے ۱؎ اور اس کا ہاتھ اس وقت تک نہ چھوڑتے جب تک کہ وہ شخص خود ہی آپ کا ہاتھ نہ چھوڑ دیتا اور آپ کہتے: ' اسْتَوْدِعْ اللَّہَ دِینَکَ وَأَمَانَتَکَ وَآخِرَ عَمَلِکَ ' ۲؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث اس سند سے غریب ہے،۲-یہ حدیث دوسری سند سے بھی ابن عمر سے آئی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3442] أستودع اللّٰہ دینک
إسنادہ ضعیف باب ما جاء ما یقول إذا ودع إنسانًا
إبراہیم بن عبد الرحمن بن یزید : مجھول ( تق : 208) وحدیث أبي داود ( 2600) یغني عنہ۔`;
tirmizi.anwaar = [294,1];