var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ حَجَّاجِ بْنِ أَرْطَاةَ عَنْ أَبِي مَطَرٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَمِعَ صَوْتَ الرَّعْدِ وَالصَّوَاعِقِ قَالَ اللَّهُمَّ لَا تَقْتُلْنَا بِغَضَبِكَ وَلَا تُهْلِكْنَا بِعَذَابِكَ وَعَافِنَا قَبْلَ ذَلِكَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم ﷺ جب بجلی کی گرج اورکڑک سنتے تو فرماتے: 'اللَّہُمَّ لاَ تَقْتُلْنَا بِغَضَبِکَ وَلاَ تُہْلِکْنَا بِعَذَابِکَ وَعَافِنَا قَبْلَ ذَلِکَ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3450] اللّٰہم لا تقتلنا بغضبک
إسنادہ ضعیف باب ما یقول إذا سمع الرعد
حجاج ضعیف( تقدم:527) وسقط ذکرہ من عمل الیوم واللیلۃ للنسائي (927) !`;
tirmizi.anwaar = [294,1];