var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ سُفْيَانَ الْمَدِينِيُّ حَدَّثَنِي بِلَالُ بْنِ يَحْيَى بْنِ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَأَى الْهِلَالَ قَالَ اللَّهُمَّ أَهْلِلْهُ عَلَيْنَا بِالْيُمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ رَبِّي وَرَبُّكَ اللَّهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "طلحہ بن عبید اللہ سے روایت ہے کہ نبی اکرم ﷺ جب چاند دیکھتے تھے تو کہتے تھے: ' اللَّہُمَّ أَہْلِلْہُ عَلَیْنَا بِالْیُمْنِ وَالإِیمَانِ وَالسَّلاَمَۃِ وَالإِسْلاَمِ رَبِّی وَرَبُّکَ اللَّہُ ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3451] اللّٰہم أھللہ علینا
إسنادہ ضعیف باب ما یقول عند رؤیۃ الھلال
سلیمان بن سفیان : ضعیف (تقدم : 2167) وبلال بن یحیی : لین ( تق :8780) وللحدیث شواھد ضعیفۃ عند ابن حبان (2374) والطبراني ( الأوسط : 6237) وغیرہما۔`;
tirmizi.anwaar = [294,1];