var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ حَدَّثَنَا خَالِدُ بْنُ مَعْدَانَ عَنْ أَبِي أُمَامَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رُفِعَتْ الْمَائِدَةُ مِنْ بَيْنِ يَدَيْهِ يَقُولُ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبُّنَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوامامہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ کے سامنے سے جب دستر خوان اٹھا لیاجاتا تو آپ کہتے: 'الْحَمْدُ لِلَّہِ حَمْدًا کَثِیرًا طَیِّبًا مُبَارَکًا فِیہِ غَیْرَ مُوَدَّعٍ وَلا مُسْتَغْنًی عَنْہُ رَبَّنَا' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;