var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ وَأَبُو خَالِدٍ الْأَحْمَرُ عَنْ حَجَّاجِ بْنِ أَرْطَاةَ عَنْ رِيَاحِ بْنِ عَبِيدَةَ قَالَ حَفْصٌ عَنْ ابْنِ أَخِي أَبِي سَعِيدٍ و قَالَ أَبُو خَالِدٍ عَنْ مَوْلًى لِأَبِي سَعِيدٍ عَنْ أَبِي سَعِيدٍ رَضِيَ اللَّهُ عَنْهُ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَوْ شَرِبَ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ";
tirmizi.urdu = "ابوسعیدخدری رضی اللہ عنہ کہتے ہیں کہ نبی اکرم ﷺ جب کھاپی چکتے توکہتے: 'الْحَمْدُ لِلَّہِ الَّذِی أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِینَ' ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[3457] الحمد للّٰہ الذي أطعمنا وسقانا
إسنادہ ضعیف / جہ 3283   باب مایقول إذا فرغ من الطعام
مولی لأبي سعید :مجہول وللحدیث شواہد ضعیفۃ۔`;
tirmizi.anwaar = [295,1];