var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ،حَدَّثَنَا الْمُقْرِءُ،حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ،عَنْ زَيْدِ بْنِ جَبِيرَةَ،عَنْ دَاوُدَ بْنِ الْحُصَيْنِ،عَنْ نَافِعٍ،عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ ﷺ نَهَى أَنْ يُصَلَّى فِي سَبْعَةِ مَوَاطِنَ فِي الْمَزْبَلَةِ،وَالْمَجْزَرَةِ،وَالْمَقْبَرَةِ،وَقَارِعَةِ الطَّرِيقِ،وَفِي الْحَمَّامِ،وَفِي مَعَاطِنِ الإِبِلِ،وَفَوْقَ ظَهْرِ بَيْتِ اللَّهِ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہﷺ نے سات مقامات میں صلاۃ پڑھنے سے منع فرمایا ہے: کوڑا کرکٹ ڈالنے کی جگہ میں،مذبح میں،قبرستان میں،عام راستوں پر،حمام (غسل خانہ)میں اونٹ باندھنے کی جگہ میں اور بیت اللہ کی چھت پر۔";
tirmizi.hukam = "";
tirmizi.description = `[346۔347] أن رسول اللّٰہ ﷺ نھی أن یصلّی في سبعۃ مواطن
ضعیف / جہ 746   باب ما جاء في کراہیۃ ما یصلي إلیہ وفیہ
زید بن جبیرۃ متروک( تق : 2122) وحدث عن داود بن الحصین بحدیث منکر جدًا وللحدیث شاھد ضعیف عند ابن ماجہ ( 747)`;
tirmizi.anwaar = [198,1];