var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا مُؤَمَّلٌ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَالَ سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ غُرِسَتْ لَهُ نَخْلَةٌ فِي الْجَنَّةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "جابر رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' جو شخص: ' سُبْحَانَ اللَّہِ الْعَظِیمِ' کہے گا اس کے لیے جنت میں کھجور کا ایک درخت لگایاجائے گا'۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔3465] من قال سبحان اللّٰہ العظیم وبحمدہ
إسنادہ ضعیف باب في فضائل سبحان اللّٰہ وبحمدہ
أبو الزبیر مدلس وعنعن ( تقدم : 10) وللحدیث شواھد ضعیفۃ عند أحمد ( 3/ 440) وغیرہ۔`;
tirmizi.anwaar = [295,1];