var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ حَمْزَةَ الزَّيَّاتِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ عَافِنِي فِي جَسَدِي وَعَافِنِي فِي بَصَرِي وَاجْعَلْهُ الْوَارِثَ مِنِّي لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ سَمِعْت مُحَمَّدًا يَقُولُ حَبِيبُ بْنُ أَبِي ثَابِتٍ لَمْ يَسْمَعْ مِنْ عُرْوَةَ بْنِ الزُّبَيْرِ شَيْئًا وَاللَّهُ أَعْلَمُ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ ﷺ کہتے تھے: 'اللَّہُمَّ عَافِنِی فِی جَسَدِی وَعَافِنِی فِی بَصَرِی وَاجْعَلْہُ الْوَارِثَ مِنِّی لاَ إِلَہَ إِلاَّ اللَّہُ الْحَلِیمُ الْکَرِیمُ سُبْحَانَ اللَّہِ رَبِّ الْعَرْشِ الْعَظِیمِ وَالْحَمْدُ لِلَّہِ رَبِّ الْعَالَمِینَ' ۱؎۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-میں نے محمد بن اسماعیل بخاری کو کہتے ہوئے سنا ہے کہ حبیب بن ابی ثابت نے عروہ بن زبیر سے کچھ بھی نہیں سناہے،اللہ بہتر جانتاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3480] اللّٰہم عافني في جسدي
إسنادہ ضعیف باب [دعاء : اللّٰہم عافني في جسدي ]
حبیب عنعن (تقدم :241) `;
tirmizi.anwaar = [296,1];