var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ حُمَيْدٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكَسَلِ وَالْهَرَمِ وَالْجُبْنِ وَالْبُخْلِ وَفِتْنَةِ الْمَسِيحِ وَعَذَابِ الْقَبْرِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "انس رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ یہ دعاکرتے تھے: ' اللَّہُمَّ إِنِّی أَعُوذُ بِکَ مِنَ الْکَسَلِ وَالْہَرَمِ وَالْجُبْنِ وَالْبُخْلِ وَفِتْنَۃِ الْمَسِیحِ وَعَذَابِ الْقَبْرِ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;