var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْبَزَّازُ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ الْحَسَنِ فِي قَوْلِهِ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً قَالَ فِي الدُّنْيَا الْعِلْمُ وَالْعِبَادَةُ وَفِي الْآخِرَةِ الْجَنَّةُ";
tirmizi.urdu = "اللہ تعالیٰ کی اس آیت: رَبَّنَا آتِنَا فِی الدُّنْیَا حَسَنَۃً وَفِی الآخِرَۃِ حَسَنَۃً کے بارے میں حسن سے مروی ہے،دنیا میں حسنہ سے مراد علم اور عبادت ہے،اور آخرت میں حسنہ سے مراد جنت ہے۔اس سند سے حمید نے ثابت سے،اور ثابت نے انس سے اسی طرح کی حدیث روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3488] فی الدنیا العلم والعبادۃ
إسنادہ ضعیف باب ما جاء في عقد التسبیح بالید
ھشام بن حسان عنعن ( تقدم : 460) ولکن مفہوم الحدیث صحیح بأدلۃ أخری۔`;
tirmizi.anwaar = [296,1];