var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ أَبِي جَعْفَرٍ الْخَطْمِيِّ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ الْأَنْصَارِيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ فِي دُعَائِهِ اللَّهُمَّ ارْزُقْنِي حُبَّكَ وَحُبَّ مَنْ يَنْفَعُنِي حُبُّهُ عِنْدَكَ اللَّهُمَّ مَا رَزَقْتَنِي مِمَّا أُحِبُّ فَاجْعَلْهُ قُوَّةً لِي فِيمَا تُحِبُّ اللَّهُمَّ وَمَا زَوَيْتَ عَنِّي مِمَّا أُحِبُّ فَاجْعَلْهُ فَرَاغًا لِي فِيمَا تُحِبُّ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَأَبُو جَعْفَرٍ الْخَطْمِيُّ اسْمُهُ عُمَيْرُ بْنُ يَزِيدَ بْنِ خُمَاشَةَ";
tirmizi.urdu = "عبداللہ بن یزید اخطمی انصاری سے روایت ہے کہ نبی اکرم ﷺ اپنی دعامیں کہتے تھے: ' اللَّہُمَّ ارْزُقْنِی حُبَّکَ وَحُبَّ مَنْ یَنْفَعُنِی حُبُّہُ عِنْدَکَ اللَّہُمَّ مَا رَزَقْتَنِی مِمَّا أُحِبُّ فَاجْعَلْہُ قُوَّۃً لِی فِیمَا تُحِبُّ اللَّہُمَّ وَمَا زَوَیْتَ عَنِّی مِمَّا أُحِبُّ فَاجْعَلْہُ فَرَاغًا لِی فِیمَا تُحِبُّ ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3491] اللّٰہم ارزقني حبک وحب من ینفعني
إسنادہ ضعیف باب دعاء اللّٰہم ارزقني حبک
سفیان بن وکیع : ضعیف ( تقدم : 3082 ) `;
tirmizi.anwaar = [296,1];