var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الثَّقَفِيُّ الْمَرْوَزِيُّ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَابِطٍ عَنْ أَبِي أُمَامَةَ قَالَ قِيلَ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الدُّعَاءِ أَسْمَعُ قَالَ جَوْفَ اللَّيْلِ الْآخِرِ وَدُبُرَ الصَّلَوَاتِ الْمَكْتُوبَاتِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ عَنْ أَبِي ذَرٍّ وَابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ جَوْفُ اللَّيْلِ الْآخِرُ الدُّعَاءُ فِيهِ أَفْضَلُ أَوْ أَرْجَى أَوْ نَحْوَ هَذَا";
tirmizi.urdu = "ابوامامہ رضی اللہ عنہ کہتے ہیں کہ پوچھا گیا: اے اللہ کے رسول! کون سی دعا زیادہ سنی جاتی ہے؟ آپ نے فرمایا: 'آدھی رات کے آخر کی دعا (یعنی تہائی رات میں مانگی ہوئی دعا) اور فرض صلاتوں کے اخیرمیں ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن ہے،۲-ابوذر اور ابن عمر رضی اللہ عنہما نبی اکرم ﷺ سے روایت کرتے ہیں کہ آپ نے فرمایا:' رات کے آخری حصہ میں د عا سب سے بہترہے،یا اس کے قبول ہونے کی امیدیں زیادہ ہیں یا اسی جیسی کوئی اور بات آپ نے فرمائی '۔";
tirmizi.hukam = "";
tirmizi.description = `[3499] جوف اللیل الآخر ودبر الصلوات
إسنادہ ضعیف باب [حدیث : ینزل ربنا کل لیلۃ إلی السماء الدنیا ]
عبد الرحمن بن سابط لم یسمع من أبي أمامۃ رضي اللّٰہ عنہ ( انظر جامع التحصیل للعلائي ص 222)`;
tirmizi.anwaar = [296,1];