var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ عُمَرَ الْهِلَالِيُّ عَنْ سَعِيدِ بْنِ إِيَاسٍ الْجُرَيْرِيِّ عَنْ أَبِي السَّلِيلِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ سَمِعْتُ دُعَاءَكَ اللَّيْلَةَ فَكَانَ الَّذِي وَصَلَ إِلَيَّ مِنْهُ أَنَّكَ تَقُولُ اللَّهُمَّ اغْفِرْ لِي ذَنْبِي وَوَسِّعْ لِي فِي دَارِي وَبَارِكْ لِي فِيمَا رَزَقْتَنِي قَالَ فَهَلْ تَرَاهُنَّ تَرَكْنَ شَيْئًا وَأَبُو السَّلِيلِ اسْمُهُ ضُرَيْبُ بْنُ نُفَيْرٍ وَيُقَالُ ابْنُ نُقَيْرِ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے،ایک شخص نے عرض کیا: اللہ کے رسول! میں نے آج رات آپ کی دعا سنی،میں نے آپ کی جودعاسنی وہ یہ تھی: ' اللَّہُمَّ اغْفِرْ لِی ذَنْبِی وَوَسِّعْ لِی فِی دَارِی وَبَارِکْ لِی فِیمَا رَزَقْتَنِی' ۱؎،آپ نے فرمایا:' کیا ان دعائیہ کلمات نے کچھ چھوڑا؟ (یعنی ان میں دین دنیا کی سبھی بھلائیاں آگئی ہیں۔)\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3500] اللّٰہم اغفر لي ذنبي ووسع لي في داري
إسنادہ ضعیف باب [دعاء : اللّٰہم اغفر لي ذنبي۔۔۔۔]
الجریري اختلط ( تقدم : 2058)`;
tirmizi.anwaar = [296,1];