var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ أَنَّ حُمَيْدًا الْمَكِّيَّ مَوْلَى ابْنِ عَلْقَمَةَ حَدَّثَهُ أَنَّ عَطَاءَ بْنَ أَبِي رَبَاحٍ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَرَرْتُمْ بِرِيَاضِ الْجَنَّةِ فَارْتَعُوا قُلْتُ يَا رَسُولَ اللَّهِ وَمَا رِيَاضُ الْجَنَّةِ قَالَ الْمَسَاجِدُ قُلْتُ وَمَا الرَّتْعُ يَا رَسُولَ اللَّهِ قَالَ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' جب تم جنت کے باغوں میں سے کسی باغ کے پاس سے گزرو تو کچھ چرچگ لیا کرو،میں پوچھا: اللہ کے رسول! ریاض الجنۃ کیا ہے؟ آپ نے فرمایا:' ریاض الجنۃ مساجد ہیں،میں نے کہا اور 'الرتع' کیا ہے،اے اللہ کے رسول! آپ نے فرمایا: 'سُبْحَانَ اللَّہِ وَالْحَمْدُ لِلَّہِ وَلا إِلَہَ إِلا اللَّہُ وَاللَّہُ أَکْبَرُ' کہنا' الرتع' ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3509] إذا مررتم بریاض الجنۃ فارتعوا
إسنادہ ضعیف باب [حدیث في أسماء اللّٰہ الحسنی]
حمید المکي : مجہول الحال وقال الحافظ فی التقریب ’’مجہول ‘‘ (1568) ثم حسن حدیثہ!`;
tirmizi.anwaar = [297,1];