var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ الضُّبَعِيُّ عَنْ كَهْمَسِ بْنِ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عَائِشَةَ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ عَلِمْتُ أَيُّ لَيْلَةٍ لَيْلَةُ الْقَدْرِ مَا أَقُولُ فِيهَا قَالَ قُولِي اللَّهُمَّ إِنَّكَ عُفُوٌّ كَرِيمٌ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے کہا: اللہ کے رسول! اگر مجھے معلوم ہوجائے کہ کون سی رات لیلۃ القدر ہے تو میں اس میں کیا پڑھوں؟ آپ نے فرمایا:' پڑھو ' اللَّہُمَّ إِنَّکَ عَفُوٌّ کَرِیمٌ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّی' ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3513] قولي : اللھم إنک عفو
إسنادہ ضعیف / جہ 3850   باب 85
عبد اللّٰہ بن بریدۃ لم یسمع من عائشۃ کما قال الدارقطني ( السنن 3/ 233ح 3517 ) و البیہقي ( 7/ 118)
و دفاع ابن الترکماني باطل لأن الخاص مقدم علی العام۔وللحدیث شاھد ضعیف عند النسائي فی الکبری (10714) فیہ سفیان الثوري مدلس و عنعن۔و شاھد آخر موقوف عندہ ( 10707 ) وسندہ ضعیف،فیہ۔۔۔۔۔۔۔عبد اللّٰہ بن جبیر و فیہ نظر و یقال : حنین و یقال : حسن۔! [ح 3514،انظر ص 318 ]`;
tirmizi.anwaar = [297,2];