var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ عَلِّمْنِي شَيْئًا أَسْأَلُهُ اللَّهَ عَزَّ وَجَلَّ قَالَ سَلْ اللَّهَ الْعَافِيَةَ فَمَكَثْتُ أَيَّامًا ثُمَّ جِئْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ عَلِّمْنِي شَيْئًا أَسْأَلُهُ اللَّهَ فَقَالَ لِي يَا عَبَّاسُ يَا عَمَّ رَسُولِ اللَّهِ سَلْ اللَّهَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَعَبْدُ اللَّهِ بْنُ الْحَارِثِ بْنِ نَوْفَلٍ قَدْ سَمِعَ مِنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ";
tirmizi.urdu = "عباس بن عبدالمطلب کہتے ہیں کہ میں نے کہا: اللہ کے رسول! مجھے کوئی ایسی چیز سکھائیے جسے میں اللہ رب العزت سے مانگتارہوں،آپ نے فرمایا:' اللہ سے عافیت مانگو،پھر کچھ دن رک کر میں رسول اللہ ﷺ کے پاس حاضر ہوا اور عرض کیا: مجھے کوئی ایسی چیز بتائیے جسے میں اللہ سے مانگتارہوں،آپ نے فرمایا:' اے عباس! اے رسول اللہ ﷺ کے چچا! دنیا وآخرت میں عافیت طلب کرو '۔امام ترمذی کہتے ہیں:۱-یہ حدیث صحیح ہے،۲-عبداللہ بن حارث بن نوفل نے عباس بن عبدالمطلب رضی اللہ عنہ سے سنا ہے (یعنی ان کا ان سے سماع ثابت ہے)۔";
tirmizi.hukam = "";
tirmizi.description = `[3514] قلت یا رسول اللّٰہ ! علّمني شیئًا
سندہ ضعیف،  باب 84
فیہ یزید بن أبي زیاد ضعیف و حدیث الطبراني ( 11/ 330۔331 ح 11908 ) و الحاکم ( 1/ 529 ح1939،و صححہ الحاکم و وافقہ الذہبي ) سندہ حسن وھو یغني عنہ۔
`;
tirmizi.anwaar = [318,1];