var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُمَرَ بْنِ أَبِي الْوَزِيرِ حَدَّثَنَا زَنْفَلُ بْنُ عَبْدِ اللَّهِ أَبُو عَبْدِ اللَّهِ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَمْرًا قَالَ اللَّهُمَّ خِرْ لِي وَاخْتَرْ لِي قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ زَنْفَلٍ وَهُوَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ وَيُقَالُ لَهُ زَنْفَلُ بْنُ عَبْدِ اللَّهِ الْعَرَفِيُّ وَكَانَ يَسْكُنُ عَرَفَاتٍ وَتَفَرَّدَ بِهَذَا الْحَدِيثِ وَلَا يُتَابَعُ عَلَيْهِ";
tirmizi.urdu = "ابوبکرصدیق رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ جب کسی کام کا ارادہ کرتے تویہ دعا فرماتے: 'اللَّہُمَّ خِرْ لِی وَاخْتَرْ لِی' ۱؎۔امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے۲-اور ہم اسے زنفل کی روایت کے سوا اور کسی سند سے نہیں جانتے،اوریہ محدثین کے نزیک ضعیف ہیں،اور انہیں زنفل بن عبداللہ عرفی بھی کہتے ہیں،وہ عرفات میں رہتے تھے،وہ اس حدیث میں منفرد ہیں،یعنی یہ روایت صرف انہوں نے ہی بیان کی ہے کسی اور نے نہیں) اورکسی نے بھی ان کی متابعت نہیں کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3516] اللّٰہم خر لي واختر لي
إسنادہ ضعیف باب [دعاء : اللّٰہم خر لي واختر لي ]
زنفل بن عبداﷲ : ضعیف (تق: 2038) `;
tirmizi.anwaar = [298,1];