var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادِ بْنِ أَنْعُمَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّسْبِيحُ نِصْفُ الْمِيزَانِ وَالْحَمْدُ لِلَّهِ يَمْلَؤُهُ وَلَا إِلَهَ إِلَّا اللَّهُ لَيْسَ لَهَا دُونَ اللَّهِ حِجَابٌ حَتَّى تَخْلُصَ إِلَيْهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ";
tirmizi.urdu = "عبداللہ بن عمرو رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' تسبیح (سبحان اللہ کہنے سے) نصف میزان (آدھا پلڑا) بھرجائے گا،اور' الحمد للہ ' میزان (پلڑے کے باقی خالی حصے) کو پورا بھر دے گا،اور ' لا إلہ الا اللہ ' کے تو اللہ تک پہنچنے میں کوئی حجاب ورکاوٹ ہے ہی نہیں'۔\nامام ترمذی کہتے ہیں: یہ حدیث اس سند سے غریب ہے اور اس کی سند قوی نہیں ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3518] التسبیح نصف المیزان
إسنادہ ضعیف باب التسبیح نصف المیزان
عبد الرحمن الإفریقي ضعیف ( تقدم : 54) والحدیث الآتي ( الأصل : 3519) یغني عنہ۔`;
tirmizi.anwaar = [298,1];