var tirmizi = {};
tirmizi.arabic = "وَرُوِي عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِذَا وُضِعَ الْعَشَاءُ وَأُقِيمَتْ الصَّلَاةُ فَابْدَءُوا بِالْعَشَاءِ قَالَ وَتَعَشَّى ابْنُ عُمَرَ وَهُوَ يَسْمَعُ قِرَاءَةَ الْإِمَامِ قَالَ حَدَّثَنَا بِذَلِكَ هَنَّادٌ حَدَّثَنَا عَبْدَةُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:'جب شام کاکھانا(تمہارے سامنے) رکھ دیا جائے اور صلاۃ کھڑی ہوجائے تو پہلے کھانا کھاؤ'،ابن عمر رضی اللہ عنہما شام کا کھانا کھارہے تھے اور امام کی قرأت سن رہے تھے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;