var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ عَنْ الْقَعْقَاعِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا كَانَ يَدْعُو بِإِصْبَعَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحِّدْ أَحِّدْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَمَعْنَى هَذَا الْحَدِيثِ إِذَا أَشَارَ الرَّجُلُ بِإِصْبَعَيْهِ فِي الدُّعَاءِ عِنْدَ الشَّهَادَةِ لَا يُشِيرُ إِلَّا بِإِصْبَعٍ وَاحِدَةٍ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک شخص اپنی دو انگلیوں کے اشارے سے دعاکرتاتھا تو آپ نے اس سے کہا:' ایک سے ایک سے ' ۱؎۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح غریب ہے،۲-یہی اس حدیث کا مفہوم یہ ہے کہ آدمی تشہد میں انگلیوں سے اشارہ کرتے وقت صرف ایک انگلی سے اشارہ کرے۔";
tirmizi.hukam = "";
tirmizi.description = `[3557] أحّد أحّد
إسنادہ ضعیف / ن 1273    باب إن اللّٰہ حیي کریم
محمد بن عجلان عنعن۔( تقدم:1084) وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [299,1];