var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ سُفْيَانَ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ أَنَّهُ اسْتَأْذَنَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعُمْرَةِ فَقَالَ أَيْ أُخَيَّ أَشْرِكْنَا فِي دُعَائِكَ وَلَا تَنْسَنَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عمر رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی اکرم ﷺ سے عمرہ کرنے کی اجازت مانگی تو آپ نے (اجازت دیتے ہوئے) کہا: اے میرے بھائی! اپنی دعا میں ہمیں بھی شریک رکھنا،بھولنا نہیں۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3562] أي أخي أشرکنا في دعائک
إسنادہ ضعیف / د 1498،جہ 2894   [باب : 109]`;
tirmizi.anwaar = [300,1];