var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ سَيَّارٍ عَنْ أَبِي وَائِلٍ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّ مُكَاتَبًا جَاءَهُ فَقَالَ إِنِّي قَدْ عَجَزْتُ عَنْ كِتَابَتِي فَأَعِنِّي قَالَ أَلَا أُعَلِّمُكَ كَلِمَاتٍ عَلَّمَنِيهِنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كَانَ عَلَيْكَ مِثْلُ جَبَلِ صِيرٍ دَيْنًا أَدَّاهُ اللَّهُ عَنْكَ قَالَ قُلْ اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "علی رضی اللہ عنہ سے روایت ہے کہ ایک مکاتب غلام نے ۱؎ ان کے پاس آکرکہا کہ میں اپنی مکاتبت کی رقم ادا نہیں کرپارہاہوں،آپ ہماری کچھ مدد فرمادیجئے تو انہوں نے کہا: کیا میں تم کو کچھ ایسے کلمے نہ سکھادوں جنہیں رسول اللہ ﷺ نے ہمیں سکھائے تھے؟ اگر تیرے پاس 'صیر' پہاڑ کے برابر بھی قرض ہوتوتیری جانب سے اللہ اسے ادا فرمادے گا،انہوں نے کہا: کہو: 'اللَّہُمَّ اکْفِنِی بِحَلَالِکَ عَنْ حَرَامِکَ وَأَغْنِنِی بِفَضْلِکَ عَمَّنْ سِوَاکَ ' ۲؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3563] اللہم اکفنی بحلالک عن حرامک واغنني بفضلک عمن سواک
سندہ ضعیف / فیہ عبدالرحمٰن بن اسحاق الکوفی الواسطی وھو کذاب مشھور (بل کاد أن یکون إجماعًا علی تضعیفہ)
ولہ شاھد ضعیف فی الامالي إبن بشران (565)
أنظر اشاعۃ الحدیث حضرو: ش 125 ص 117۔118،ش 133 ص 16`;
tirmizi.anwaar = [318,1];