var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا عَادَ مَرِيضًا قَالَ اللَّهُمَّ أَذْهِبْ الْبَأْسَ رَبَّ النَّاسِ وَاشْفِ فَأَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں کہ جب نبی اکرم ﷺ کسی بیمار کی عیادت کرتے تو یہ دعا پڑھتے تھے: ' اللَّہُمَّ أَذْہِبِ الْبَأْسَ رَبَّ النَّاسِ وَاشْفِ فَأَنْتَ الشَّافِی لاَ شِفَائَ إِلاَّ شِفَاؤُکَ شِفَائً لاَ یُغَادِرُ سَقَمًا' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;