var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَزَيْدُ بْنُ حُبَابٍ عَنْ مُوسَى بْنِ عُبَيْدَةَ عَنْ مُحَمَّدِ بْنِ ثَابِتٍ عَنْ أَبِي حَكِيمٍ مَوْلَى الزُّبَيْرِ عَنْ الزُّبَيْرِ بْنِ الْعَوَّامِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ صَبَاحٍ يُصْبِحُ الْعَبْدُ فِيهِ إِلَّا وَمُنَادٍ يُنَادِي سُبْحَانَ الْمَلِكِ الْقُدُّوسِ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "زبیر بن عوام رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' کوئی صبح ایسی نہیں ہے کہ اللہ کے بندے صبح کرتے ہوں اور اس صبح میں کوئی پکار کر کہنے والایہ نہ کہتا ہو کہ سُبْحَانَ الْمَلِکِ الْقُدُّوسِ کی تسبیح پڑھاکرو ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3569] ما من صباح یصبح العبد
إسنادہ ضعیف باب في دعاء النبي ﷺ وتعوذہ في دبر کل صلاۃ
موسی بن عبیدۃ : ضعیف کما تقدم (1122) وشیخہ محمد بن ثابت : مجہول ( تق : 5772)`;
tirmizi.anwaar = [300,1];