var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ أَخْبَرَنِي أَبِي عَنْ الْمُثَنَّى بْنِ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا غَزَا قَالَ اللَّهُمَّ أَنْتَ عَضُدِي وَأَنْتَ نَصِيرِي وَبِكَ أُقَاتِلُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَمَعْنَى قَوْلِهِ عَضُدِي يَعْنِي عَوْنِي";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں کہ جب نبی اکرم ﷺ جہاد کرتے (لڑتے) تو یہ دعا پڑھتے: 'اللَّہُمَّ أَنْتَ عَضُدِی وَأَنْتَ نَصِیرِی وَبِکَ أُقَاتِلُ ' ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے ۲-اور' عضدی' کے معنی ہیں تو میرا مدد گار ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3584] اللّٰہم أنت عضدي وأنت نصیري
إسنادہ ضعیف /د 2632 باب فی الدعاء إذا غزا`;
tirmizi.anwaar = [300,1];