var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَلِيُّ بْنُ أَبِي بَكْرٍ عَنْ الْجَرَّاحِ بْنِ الضَّحَّاكِ الْكِنْدِيِّ عَنْ أَبِي شَيْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ عَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْ اللَّهُمَّ اجْعَلْ سَرِيرَتِي خَيْرًا مِنْ عَلَانِيَتِي وَاجْعَلْ عَلَانِيَتِي صَالِحَةً اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ صَالِحِ مَا تُؤْتِي النَّاسَ مِنْ الْمَالِ وَالْأَهْلِ وَالْوَلَدِ غَيْرِ الضَّالِّ وَلَا الْمُضِلِّ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ";
tirmizi.urdu = "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ ہمیں رسول اللہ ﷺ نے سکھایا،آپ نے فرمایا:' کہو' اللَّہُمَّ اجْعَلْ سَرِیرَتِی خَیْرًا مِنْ عَلانِیَتِی وَاجْعَلْ عَلاَنِیَتِی صَالِحَۃً اللَّہُمَّ إِنِّی أَسْأَلُکَ مِنْ صَالِحِ مَا تُؤْتِی النَّاسَ مِنْ الْمَالِ وَالأَہْلِ وَالْوَلَدِ غَیْرِ الضَّالِّ وَلاَ الْمُضِلِّ ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں اور اس کی سند قوی نہیں ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3586] قل اللّٰہم اجعل سریرتي خیرًا من علانیتي
إسنادہ ضعیف باب [دعاء : اللّٰہم اجعل سریرتي خیرًا۔۔۔]
أبو شیبۃ عبد الرحمن بن إسحاق الکوفي : ضعیف ( تقدم : 741 )`;
tirmizi.anwaar = [301,1];