var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ مُحَمَّدُ بْنُ يَزِيدَ الْكُوفِيُّ حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ حَدَّثَنَا سُفْيَانُ عَنْ زَيْدٍ الْعَمِّيِّ عَنْ أَبِي إِيَاسٍ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدُّعَاءُ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ قَالُوا فَمَاذَا نَقُولُ يَا رَسُولَ اللَّهِ قَالَ سَلُوا اللَّهَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ زَادَ يَحْيَى بْنُ الْيَمَانِ فِي هَذَا الْحَدِيثِ هَذَا الْحَرْفَ قَالُوا فَمَاذَا نَقُولُ قَالَ سَلُوا اللَّهَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' اذان اور اقامت کے درمیان مانگی جانے والی دعا لوٹائی نہیں جاتی،(یعنی قبول ہوجاتی ہے) لوگوں نے پوچھا: اس دوران ہم کون سی دعامانگیں اے اللہ کے رسول! آپ نے فرمایا:' دنیا اور آخرت (دونوں) میں عافیت مانگو'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن ہے،یحییٰ بن ابان نے اس حدیث میں اس عبارت کا اضافہ کیا ہے کہ ان لوگوں نے عرض کیا کہ ہم کیا کہیں؟ آپ نے فرمایا:' دنیا و آخرت میں عافیت (یعنی امن وسکون) مانگو۔";
tirmizi.hukam = "";
tirmizi.description = `[3594] الدعاء لا یرد بین الأذان والإقامۃ
إسنادہ ضعیف باب فی العفو والعافیۃ
زید العمی : ضعیف ( تقدم : 1442) وحدیث أبي داود ( 521) یغني عنہ۔`;
tirmizi.anwaar = [301,1];