var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ عُمَرَ بْنِ رَاشِدٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبَقَ الْمُفْرِدُونَ قَالُوا وَمَا الْمُفْرِدُونَ يَا رَسُولَ اللَّهِ قَالَ الْمُسْتَهْتَرُونَ فِي ذِكْرِ اللَّهِ يَضَعُ الذِّكْرُ عَنْهُمْ أَثْقَالَهُمْ فَيَأْتُونَ يَوْمَ الْقِيَامَةِ خِفَافًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' ہلکے پھلکے لوگ آگے نکل گئے،لوگوں نے پوچھا: اللہ کے رسول! یہ ہلکے پھلکے لوگ کون ہیں؟ آپ ﷺنے فرمایا:' اللہ کی یاد وذکر میں ڈوبے رہنے والے لوگ،ذکر ان کا بوجھ ان کے اوپر سے اتار کر رکھ دے گا اورقیامت کے دن ہلکے پھلکے آئیں گے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3596] سبق المفردون
إسنادہ ضعیف باب فی العفو والعافیۃ
عمر بن راشد : ضعیف ( تقدم : 2000 ) والحدیث صحیح بشواہد دون قولہ : ’’ یضع الذکر‘‘ إلخ۔`;
tirmizi.anwaar = [301,1];