var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ مُوسَى بْنِ عُبَيْدَةَ عَنْ مُحَمَّدِ بْنِ ثَابِتٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ وَأَعُوذُ بِاللَّهِ مِنْ حَالِ أَهْلِ النَّارِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے یہ دعا پڑھی: 'اللَّہُمَّ انْفَعْنِی بِمَا عَلَّمْتَنِی وَعَلِّمْنِی مَا یَنْفَعُنِی وَزِدْنِی عِلْمًا الْحَمْدُ لِلَّہِ عَلَی کُلِّ حَالٍ وَأَعُوذُ بِاللَّہِ مِنْ حَالِ أَہْلِ النَّارِ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3599] اللّٰہم انفعني بما علمتني
إسنادہ ضعیف / جہ 251،3833
موسی بن عبیدۃ: ضعیف (تقدم: 1122)
وروایۃ المستدرک (1/ 510) یغنی عنہ`;
tirmizi.anwaar = [301,1];