var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعِيذُوا بِاللَّهِ مِنْ عَذَابِ جَهَنَّمَ وَاسْتَعِيذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ اسْتَعِيذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَاسْتَعِيذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا يَحْيَى بْنُ مُوسَى أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَالَ حِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ لَمْ يَضُرَّهُ حُمَةٌ تِلْكَ اللَّيْلَةَ قَالَ سُهَيْلٌ فَكَانَ أَهْلُنَا تَعَلَّمُوهَا فَكَانُوا يَقُولُونَهَا كُلَّ لَيْلَةٍ فَلُدِغَتْ جَارِيَةٌ مِنْهُمْ فَلَمْ تَجِدْ لَهَا وَجَعًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَرَوَى مَالِكُ بْنُ أَنَسٍ هَذَا الْحَدِيثَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَى عُبَيْدُ اللَّهِ بْنُ عُمَرَ وَغَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ سُهَيْلٍ وَلَمْ يَذْكُرُوا فِيهِ عَنْ أَبِي هُرَيْرَةَ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' اللہ سے پناہ مانگو جہنم کے عذاب سے،اللہ سے پناہ مانگو قبر کے عذاب سے،اللہ سے پناہ مانگومسیح دجال کے فتنے سے اور اللہ سے پناہ مانگو زندگی اور موت کے فتنے سے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺنے فرمایا:' جس نے شام کے وقت تین مرتبہ 'أَعُوذُ بِکَلِمَاتِ اللَّہِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ ' پڑھا،اسے اس رات کوئی بھی ڈنک مارنے والا جانور تکلیف نہیں پہنچا سکتا'۔سہیل کہتے ہیں: میرے گھر والوں نے اسے سیکھا اور ہررات اسے پڑھتے،پھر میرے گھر والوں میں سے ایک لونڈی کو کسی جانور نے ڈنک مارا تو اس ڈنک سے اسے کچھ بھی تکلیف محسوس نہ ہوئی۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-مالک بن انس نے یہ سہیل بن ابی صالح سے،سہیل نے اپنے والد ابوصالح سے اور ابوصالح نے ابوہریرہ رضی اللہ عنہ کے واسطہ سے نبی اکرم ﷺ سے روایت کی ہے،۳-عبید اللہ بن عمر اور دوسرے راویوں نے بھی یہ حدیث سہیل سے روایت کی ہے،لیکن اس میں ابوہریرہ رضی اللہ عنہ کے واسطہ کا ذکر نہیں کیاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3604] 2/ اللھم اجعلني أعظّم شکرک
ضعیف
باب دعاء اللّٰہم اجعلني أعظم
حدیث الفرج بن فضالۃ عن أبي سعید عن أبي ہریرۃ قال : ’’ دعاء حفظتہ من رسول اللّٰہ ﷺ لا أدعہ : اللّٰہم اجعلني أعظم شکرک ‘‘ إلخ إسنادہ ضعیف / فرج :ضعیف ( تقدم : 2210) 
3/ ما من رجل یدعو اللّٰہ بدعاء
ضعیف
حدیث اللیث بن أبي سلیم عن زیاد عن أبي ہریرۃ قال قال رسول للّٰہﷺ ’’ما من رجل یدعو اللّٰہ بدعاء إلااستجیب لہ‘‘ سندہ ضعیف،اللیث ضعیف تقدم (218) وشیخہ غیر منسوب۔
4/ ما من عبد یرفع یدیہ
ضعیف جدًا
حدیث :’’ما من عبد یرفع یدیہ حتی یبدو إبطہ ‘‘ إسنادہ ضعیف جدًا،یحیی بن عبیداللّٰہ : متروک ( تقدم : 1929)
6/ لینظرن أحدکم ما الذي یتمني أبو سلمۃ
ضعیف
حدیث أبي سلمۃ قال قال رسول اللّٰہ ﷺ : ’’ لینظرن أحدکم ما الذي یتمنی ‘‘ إلخ إسنادہ ضعیف لإرسالہ۔`;
tirmizi.anwaar = [301,2];