var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ أُنْزِلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ ابْنُ أَرْبَعِينَ فَأَقَامَ بِمَكَّةَ ثَلَاثَ عَشْرَةَ وَبِالْمَدِينَةِ عَشْرًا وَتُوُفِّيَ وَهُوَ ابْنُ ثَلَاثٍ وَسِتِّينَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ پر وحی نازل کی گئی توآپ چالیس سال کے تھے،پھر آپ مکہ میں تیرہ سال تک رہے اور مدینہ میں دس سال تک،اور آپ کی وفات ہوئی تو آپ ترسٹھ (۶۳) سال کے تھے۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;