var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ هِشَامٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قُبِضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ ابْنُ خَمْسٍ وَسِتِّينَ سَنَةً قَالَ أَبُو عِيسَى وَهَكَذَا حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَرَوَى عَنْهُ مُحَمَّدُ بْنُ إِسْمَعِيلَ مِثْلَ ذَلِكَ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم ﷺ کی وفات ہوئی تو آپ پینسٹھ (۶۵) سال کے تھے ۱؎۔\nامام ترمذی کہتے ہیں: اسی طرح سے ہم سے محمدبن بشار نے بیان کیاہے اوران سے محمد بن اسماعیل بخاری نے اسی کے مثل روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3622] قبض النبيﷺ وھو ابن خمس وستین
شاذ باب ما جاء في مبعث النبي ﷺ وابن کم کان حین بعث
ہشام بن حسان عنعن (تقدم : 460 ) والحدیث شاذ مخالف للروایات الصحیحۃ۔`;
tirmizi.anwaar = [303,1];