var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبَّادُ بْنُ يَعْقُوبَ الْكُوفِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ أَبِي ثَوْرٍ عَنْ السُّدِّيِّ عَنْ عَبَّادِ بْنِ أَبِي يَزِيدَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ كُنْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ فَخَرَجْنَا فِي بَعْضِ نَوَاحِيهَا فَمَا اسْتَقْبَلَهُ جَبَلٌ وَلَا شَجَرٌ إِلَّا وَهُوَ يَقُولُ السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ رَوَاهُ غَيْرُ وَاحِدٍ عَنْ الْوَلِيدِ بْنِ أَبِي ثَوْرٍ وَقَالُوا عَنْ عَبَّادٍ أَبِي يَزِيدَ مِنْهُمْ فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ";
tirmizi.urdu = "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں:میں نبی اکرم ﷺ کے ساتھ مکہ میں تھا،جب ہم اس کے بعض اطراف میں نکلے تو جوبھی پہاڑ اور درخت آپ کے سامنے آتے سبھی ' السلام علیک یا رسول اللہ ' کہتے۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-کئی لوگوں نے یہ حدیث ولید بن ابی ثور سے روایت کی ہے اوران سب نے 'عن عباد أبی یزید' کہاہے،اور انہیں میں سے فروہ بن ابی المغراء بھی ہیں ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[3626] کنت مع النبيﷺ بمکۃ
إسنادہ ضعیف باب [في قول علي في استقبال]
الولید بن أبي ثور : ضعیف و عباد بن أبي یزید : مجہول (تق: 7431،3152)
و قال الھیثمي في ولید بن عبد اللّٰہ بن أبي ثور الھمداني الکوفي : ضعفہ الجمہور ( مجمع الزوائد 279/5)`;
tirmizi.anwaar = [303,1];