var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ قَالَ مَا رَأَيْتُ أَحَدًا أَكْثَرَ تَبَسُّمًا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "عبداللہ بن حارث بن جزء رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ سے بڑھ کر مسکرانے والا میں نے کسی کو نہیں دیکھا۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3641] ما رأیت أحدًا أکثر تبسمًا
إسنادہ ضعیف باب في بشاشۃ النبي ﷺ
عبداللّٰہ بن لھیعۃ حدث بہ قبل اختلاطہ ولکنہ مدلس و عنعن (تقدم : 10) فالسند ضعیف والحدیث الآتي (الأصل : 3642 ) یغني عنہ۔`;
tirmizi.anwaar = [304,1];