var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ أَخْبَرَنَا الْحَجَّاجُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كَانَ فِي سَاقَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُمُوشَةٌ وَكَانَ لَا يَضْحَكُ إِلَّا تَبَسُّمًا وَكُنْتُ إِذَا نَظَرْتُ إِلَيْهِ قُلْتُ أَكْحَلُ الْعَيْنَيْنِ وَلَيْسَ بِأَكْحَلَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ";
tirmizi.urdu = "جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ کی دونوں پنڈلیاں مناسب باریکی ۱؎ لیے ہوئے تھیں اور آپ کا ہنسنا صرف مسکرانا تھا،اور جب میں آپ کو دیکھتا تو کہتا کہ آپ آنکھوں میں سرمہ لگائے ہوئے ہیں،حالانکہ آپ سرمہ نہیں لگائے ہوتے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3645] کان في ساقي رسول اللّٰہ ﷺ حموشۃ
إسنادہ ضعیف باب [قول ابن سمرۃ : کان في ساق رسول اللّٰہ ﷺ ]
حجاج بن أرطاۃ : ضعیف مدلس و عنعن ( تقدم:527) وللحدیث شواہد غیر ’’حموشۃ‘‘۔`;
tirmizi.anwaar = [304,1];