var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عُمَرُ بْنُ إِسْمَعِيلَ بْنِ مُجَالِدٍ حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ ذَاتَ يَوْمٍ فَدَخَلَ الْمَسْجِدَ وَأَبُو بَكْرٍ وَعُمَرُ أَحَدُهُمَا عَنْ يَمِينِهِ وَالْآخَرُ عَنْ شِمَالِهِ وَهُوَ آخِذٌ بِأَيْدِيهِمَا وَقَالَ هَكَذَا نُبْعَثُ يَوْمَ الْقِيَامَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَسَعِيدُ بْنُ مَسْلَمَةَ لَيْسَ عِنْدَهُمْ بِالْقَوِيِّ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ أَيْضًا مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں: رسول اللہ ﷺ ایک دن نکلے اور مسجد میں داخل ہوئے،ابوبکر وعمر رضی اللہ عنہما میں سے ایک آپ کے دائیں جانب تھے اور دوسرے بائیں جانب،اور آپ ان دونوں کا ہاتھ پکڑے ہوئے تھے آپ نے فرمایا:' اسی طرح ہم قیامت کے دن اٹھائے جائیں گے'۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-سعید بن مسلمہ محدثین کے نزدیک قوی نہیں ہیں،۳-یہ حدیث اس سند کے علاوہ دوسری سند سے بھی نافع کے واسطہ سے ابن عمر سے آئی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3669] ھکذا نبعث یوم القیامۃ
إسنادہ ضعیف / جہ 99 باب في مناقب أبي بکر و عمر کلیہما
سعید بن مسلمۃ : ضعیف ( تق: 2395) `;
tirmizi.anwaar = [305,1];