var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى الْقَطَّانُ الْبَغْدَادِيُّ حَدَّثَنَا مَالِكُ بْنُ إِسْمَعِيلَ عَنْ مَنْصُورِ بْنِ أَبِي الْأَسْوَدِ حَدَّثَنِي كَثِيرٌ أَبُو إِسْمَعِيلَ عَنْ جُمَيْعِ بْنِ عُمَيْرٍ التَّيْمِيِّ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي بَكْرٍ أَنْتَ صَاحِبِي عَلَى الْحَوْضِ وَصَاحِبِي فِي الْغَارِ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ رسول اللہ ﷺ نے ابوبکر رضی اللہ عنہ سے فرمایا:'تم حوض کوثر پر میرے رفیق ہوگے جیساکہ غارمیں میرے رفیق تھے'۔امام ترمذی کہتے ہیں: یہ حدیث حسن،صحیح،غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3670] أنت صاحبي علی الحوض
إسنادہ ضعیف باب في مناقب أبي بکر و عمر کلیہما
کثیر النواء : ضعیف (تق: 5605) وشیخہ : جمیع بن عمیر ضعیف ( د 241) `;
tirmizi.anwaar = [305,1];