var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ حَدَّثَنَا أَحْمَدُ بْنُ بَشِيرٍ عَنْ عِيسَى بْنِ مَيْمُونٍ الْأَنْصَارِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْبَغِي لِقَوْمٍ فِيهِمْ أَبُو بَكْرٍ أَنْ يَؤُمَّهُمْ غَيْرُهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ ﷺ نے فرمایا:' کسی قوم کے لیے مناسب نہیں کہ ابوبکر رضی اللہ عنہ کی موجود گی میں ان کے سوا کوئی اور ان کی امامت کرے'۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3673] لا ینبغي لقوم فیھم أبو بکر
إسنادہ ضعیف باب في مناقب أبي بکر و عمر کلیہما
عیسی بن میمون : ضعیف ( تقدم : 1089) `;
tirmizi.anwaar = [305,1];