var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ قَالَ مَا أَظُنُّ رَجُلًا يَنْتَقِصُ أَبَا بَكْرٍ وَعُمَرَ يُحِبُّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "محمد بن سیرین کہتے ہیں کہ میں کسی کو نہیں سمجھتا کہ وہ نبی اکرم ﷺ سے محبت کرتا ہو اور وہ ابوبکر و عمر رضی اللہ عنہما کی تنقیص کرے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3685] ما أظن رجلاً ینتقص أبا بکر
إسنادہ ضعیف باب في مناقب أبي حفص عمر بن الخطاب رضي اللّٰہ عنہ
انظر الحدیث السابق :3684 `;
tirmizi.anwaar = [306,1];