var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْقُدُّوسِ حَدَّثَنَا الْأَعْمَشُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ عَنْ عَبِيدَةَ السَّلْمَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَطَّلِعُ عَلَيْكُمْ رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ فَاطَّلَعَ أَبُو بَكْرٍ ثُمَّ قَالَ يَطَّلِعُ عَلَيْكُمْ رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ فَاطَّلَعَ عُمَرُ وَفِي الْبَاب عَنْ أَبِي مُوسَى وَجَابِرٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ ابْنِ مَسْعُودٍ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' تمہارے پاس جنت والوں میں سے ایک شخص آرہاہے تو ابوبکر آئے،پھر آپ نے فرمایا:' تمہارے پاس جنت والوں میں سے ایک شخص آرہاہے،تو عمر رضی اللہ عنہ آئے'۔امام ترمذی کہتے ہیں: ۱-ابن مسعود رضی اللہ عنہ کی یہ حدیث غریب ہے،۲-اس باب میں ا بوموسیٰ اشعری اور جابر رضی اللہ عنہم سے احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3694] یطلع علیکم رجل من أھل الجنۃ
إسنادہ ضعیف باب في مناقب أبي حفص عمر بن الخطاب رضي اللّٰہ عنہ
 الأعمش عنعن ( تقدم : 169) وتلمیذہ عبد اللّٰہ بن عبد القدوس : ضعیف (تقدم : 2212) ولہ متابعۃ ضعیفۃ عندالطبراني فی الکبیر (206/10) `;
tirmizi.anwaar = [306,1];