var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ حَدَّثَنَا شَاذَانُ الْأَسْوَدُ بْنُ عَامِرٍ عَنْ سِنَانِ بْنِ هَارُونَ الْبُرْجُمِيِّ عَنْ كُلَيْبِ بْنِ وَائِلٍ عَنْ ابْنِ عُمَرَ قَالَ ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِتْنَةً فَقَالَ يُقْتَلُ فِيهَا هَذَا مَظْلُومًا لِعُثْمَانَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ ابْنِ عُمَرَ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے ایک فتنہ کا ذکر کیا تو فرمایا:' اس فتنہ میں یہ عثمان بھی مظلوم قتل کیاجائے گا'(یہ بات آپ نے عثمان رضی اللہ عنہ کے متعلق کہی۔\nامام ترمذی کہتے ہیں: ابن عمر کی یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3708] یقتل فیھا ھذا مظلومًا
إسنادہ ضعیف [باب في ] مناقب عثمان بن عفان رضي اللّٰہ عنہ
سنان بن ہارون البرجمي ضعیف ضعفہ الجمھور۔`;
tirmizi.anwaar = [307,1];