var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ أَبِي هَارُونَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ إِنَّا كُنَّا لَنَعْرِفُ الْمُنَافِقِينَ نَحْنُ مَعْشَرَ الْأَنْصَارِ بِبُغْضِهِمْ عَلِيَّ بْنَ أَبِي طَالِبٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ أَبِي هَارُونَ وَقَدْ تَكَلَّمَ شُعْبَةُ فِي أَبِي هَارُونَ وَقَدْ رُوِيَ هَذَا عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ";
tirmizi.urdu = "ابوسعید خدری رضی اللہ عنہ کہتے ہیں: ہم گروہِ انصار،منافقوں کو علی سے ان کے بغض رکھنے کی وجہ سے خوب پہچانتے تھے۔امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،ہم اسے صرف ابوہارون کی روایت سے جانتے ہیں اور شعبہ نے ابوہارون کے سلسلہ میں کلام کیاہے،۲-یہ حدیث اعمش سے بھی روایت کی گئی ہے،جسے انہوں نے ابوصالح سے اور ابوصالح نے ابوسعید خدری سے روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3717] 1/ إن کنا لنعرف المنافقین
إسنادہ ضعیف جدًا    باب مناقب علي بن أبي طالب
أبو ہارون : متروک ( تقدم :1950)
2/ لا یحب علیًا منافق
إسنادہ ضعیف [سندہ حسن]
مساور الحمیري و أمہ وثقہما الترمذي و الحاکم ( 4/ 173 ح 7328 ) و الذہبي فالسند حسن۔`;
tirmizi.anwaar = [307,1];