var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى الْقَطَّانُ الْبَغْدَادِيُّ حَدَّثَنَا عَلِيُّ بْنُ قَادِمٍ حَدَّثَنَا عَلِيُّ بْنُ صَالِحِ بْنِ حَيٍّ عَنْ حَكِيمِ بْنِ جُبَيْرٍ عَنْ جُمَيْعِ بْنِ عُمَيْرٍ التَّيْمِيِّ عَنْ ابْنِ عُمَرَ قَالَ آخَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَصْحَابِهِ فَجَاءَ عَلِيٌّ تَدْمَعُ عَيْنَاهُ فَقَالَ يَا رَسُولَ اللَّهِ آخَيْتَ بَيْنَ أَصْحَابِكَ وَلَمْ تُؤَاخِ بَيْنِي وَبَيْنَ أَحَدٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْتَ أَخِي فِي الدُّنْيَا وَالْآخِرَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَفِي الْبَاب عَنْ زَيْدِ بْنِ أَبِي أَوْفَى";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں: رسول اللہ ﷺ نے اپنے اصحاب کے درمیان باہمی بھائی چارا کرایا تو علی روتے ہوئے آئے اور کہا: اللہ کے رسول! آپ نے اپنے اصحاب کے درمیان بھائی چارا کرایا ہے اور میری بھائی چارگی کسی سے نہیں کرائی؟ تو رسول اللہ ﷺ نے ان سے فرمایا:' تم میرے بھائی ہو دنیا اور آخرت دونوں میں'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-اس باب میں زید بن ابی اوفیٰ سے بھی روایت ہے۔\nنوٹ:(سندمیں حکیم بن جبیر ضعیف رافضی ہے)";
tirmizi.hukam = "";
tirmizi.description = `[3720] أنت أخي فی الدنیا والآخرۃ
إسنادہ ضعیف باب مناقب علي بن أبي طالب
حکیم بن جبیر :ضعیف (تقدم : 155) وشیخہ جمیع بن عمیر : ضعیف (تقدم:3670)`;
tirmizi.anwaar = [308,1];