var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا خَلَّادُ بْنُ أَسْلَمَ الْبَغْدَادِيُّ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ أَخْبَرَنَا عَوْفٌ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ هِنْدٍ الْجَمَلِيِّ قَالَ قَالَ عَلِيٌّ كُنْتُ إِذَا سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَانِي وَإِذَا سَكَتُّ ابْتَدَأَنِي قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں: جب بھی میں رسول اللہ ﷺ سے مانگتاتوآپ مجھے دیتے تھے اور جب میں چپ رہتا توخودہی پہل کرتے '(دینے میں یا بولنے میں)۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3722] کنت إذا سألت رسول اللّٰہ ﷺ أعطاني
إسنادہ ضعیف باب 21
عبد اللّٰہ بن عمرو بن ھند لم یسمع من علي رضي اللّٰہ عنہ ( المراسیل لابن أبي حاتم ص 109 ) وجاء فی المستدرک ( 3/ 125 ح 4630) : ’’ سمعت علیًا رضي اللّٰہ عنہ ‘‘ ! 
و للحدیث لون آخر في خصائص النسائي ( 121 ) و فضائل الصحابۃ للإمام أحمد ( زوائد القطیعي : 1099 ) `;
tirmizi.anwaar = [308,1];