var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الرُّومِيِّ حَدَّثَنَا شَرِيكٌ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ سُوَيْدِ بْنِ غَفَلَةَ عَنْ الصُّنَابِحِيِّ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا دَارُ الْحِكْمَةِ وَعَلِيٌّ بَابُهَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مُنْكَرٌ وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ شَرِيكٍ وَلَمْ يَذْكُرُوا فِيهِ عَنْ الصُّنَابِحِيِّ وَلَا نَعْرِفُ هَذَا الْحَدِيثَ عَنْ وَاحِدٍ مِنْ الثِّقَاتِ عَنْ شَرِيكٍ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' میں حکمت کا گھر ہوں اور علی اس کا دروازہ ہیں'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب،اور منکر ہے،۲-بعض راویوں نے اس حدیث کوشریک سے روایت کیا ہے،اور انہوں نے اس میں صنابحی کے واسطہ کا ذکر نہیں کیا ہے،اور ہم نہیں جانتے کہ یہ حدیث کسی ثقہ راوی کے واسطہ سے شریک سے آئی ہو،اس باب میں ابن عباس رضی اللہ عنہما سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3723] أنا دار الحکمۃ وعلي بابھا
إسنادہ ضعیف باب مناقب علي بن أبي طالب
شریک عنعن ( تقدم : 112) ولم یثبت تصریح سماعہ وللحدیث شواہد ضعیفۃ۔`;
tirmizi.anwaar = [308,1];