var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ سَالِمِ بْنِ أَبِي حَفْصَةَ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ يَا عَلِيُّ لَا يَحِلُّ لِأَحَدٍ أَنْ يُجْنِبَ فِي هَذَا الْمَسْجِدِ غَيْرِي وَغَيْرِكَ قَالَ عَلِيُّ بْنُ الْمُنْذِرِ قُلْتُ لِضِرَارِ بْنِ صُرَدٍ مَا مَعْنَى هَذَا الْحَدِيثِ قَالَ لَا يَحِلُّ لِأَحَدٍ يَسْتَطْرِقُهُ جُنُبًا غَيْرِي وَغَيْرِكَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَسَمِعَ مِنِّي مُحَمَّدُ بْنُ إِسْمَعِيلَ هَذَا الْحَدِيثَ فَاسْتَغْرَبَهُ";
tirmizi.urdu = "ابوسعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے علی سے فرمایا:' علی! میرے اور تمہارے علاوہ کسی کے لیے جائز نہیں کہ وہ اس مسجد میں جنبی رہے'۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں،۲-علی بن منذر کہتے ہیں: میں نے ضرار بن صرد سے پوچھا: اس حدیث کا مفہوم کیا ہے؟تو انہوں نے کہا: اس کا مطلب یہ ہے کہ میرے اور تمہارے علاوہ کسی کے لیے یہ جائز نہیں کہ حالت جنابت میں وہ اس مسجد میں سے گذرے،۳-مجھ سے محمد بن اسماعیل بخاری نے اس حدیث کو سنا تو وہ اچنبھے میں پڑگئے۔";
tirmizi.hukam = "";
tirmizi.description = `[3727] یا علي! لا یحل لأحد أن یجنب
إسنادہ ضعیف باب مناقب علي بن أبي طالب
عطیۃ : ضعیف ( تقدم : 477)`;
tirmizi.anwaar = [308,1];