var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا خَلَّادُ بْنُ أَسْلَمَ البَغْدَادِيُّ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ: أَخْبَرَنَا عَوْفٌ الأعرابي،عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ هِنْدٍ الحُبَلِيِّ،قَالَ: قَالَ عَلِيٌّ: «كُنْتُ إِذَا سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَانِي،وَإِذَا سَكَتُّ ابْتَدَأَنِي»: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الوَجْهِ\nوفي الباب عن جابر وزيد بن أسلم وأبي هريرة وأم سلمة";
tirmizi.urdu = "عبداللہ بن عمرو بن ہند جملی سے روایت ہے کہ علی کہتے تھے: جب بھی میں رسول اللہ ﷺ سے مانگتا توآپ مجھے دیتے تھے اور جب میں چپ رہتا توخودہی پہل کرتے (دینے میں یا بولنے میں)۔\nامام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3729] کنت إذا سألت رسول اللّٰہ ﷺ أعطاني
إسنادہ ضعیف / تقدم : 3722   باب [تحفۃ الأشراف ] 77`;
tirmizi.anwaar = [308,1];