var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ وَغَيْرُ وَاحِدٍ قَالُوا أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ أَبِي الْجَرَّاحِ حَدَّثَنِي جَابِرُ بْنُ صُبَيْحٍ قَالَ حَدَّثَتْنِي أُمُّ شَرَاحِيلَ قَالَتْ حَدَّثَتْنِي أُمُّ عَطِيَّةَ قَالَتْ بَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَيْشًا فِيهِمْ عَلِيٌّ قَالَتْ فَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ رَافِعٌ يَدَيْهِ يَقُولُ اللَّهُمَّ لَا تُمِتْنِي حَتَّى تُرِيَنِي عَلِيًّا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "ام عطیہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرمﷺ نے ایک لشکر روانہ فرمایا جس میں علی بھی تھے،میں نے نبی اکرم ﷺ کو سنا آپ اپنے دونوں ہاتھ اٹھائے ہوئے یہ دعا فرمارہے تھے: 'اے اللہ! تو مجھے مارنا نہیں جب تک کہ مجھے علی کو دکھانہ دے '۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3737] اللّٰہم لا تمتني حتی تریني علیًا
إسنادہ ضعیف باب مناقب علي بن أبي طالب
أبو الجراح :مجہول و أم شراحیل : لایعرف حالھا (تق: 8013،8738) `;
tirmizi.anwaar = [309,1];