var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ الْعَطَّارُ الْبَصْرِيُّ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ عَنْ إِسْحَقَ بْنِ يَحْيَى بْنِ طَلْحَةَ عَنْ عَمِّهِ مُوسَى بْنِ طَلْحَةَ قَالَ دَخَلْتُ عَلَى مُعَاوِيَةَ فَقَالَ أَلَا أُبَشِّرُكَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ طَلْحَةُ مِمَّنْ قَضَى نَحْبَهُ قَالَ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ مُعَاوِيَةَ إِلَّا مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "موسیٰ بن طلحہ کہتے ہیں:میں معاویہ رضی اللہ عنہ کے پاس آیا تو انہوں نے کہا: کیا میں تمہیں یہ خوش خبری نہ سناؤں کہ میں نے رسول اللہ کو فرماتے ہوئے سنا ہے: 'طلحہ ان لوگوں میں سے ہیں جن کے سلسلہ میں اللہ نے فرمایاہے کہ وہ اپنا کام پورا کرچکے ہیں ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے معاویہ رضی اللہ عنہ کی روایت سے صرف اسی سند سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3740] دخلت علی معاویۃ
إسنادہ ضعیف / تقدم : 3202   باب 21`;
tirmizi.anwaar = [309,1];