var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ صَخْرِ بْنِ جُوَيْرِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ قَالَ أَوْصَى الزُّبَيْرُ إِلَى ابْنِهِ عَبْدِ اللَّهِ صَبِيحَةَ الْجَمَلِ فَقَالَ مَا مِنِّي عُضْوٌ إِلَّا وَقَدْ جُرِحَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى انْتَهَى ذَاكَ إِلَى فَرْجِهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ";
tirmizi.urdu = "ہشام بن عروہ کہتے ہیں کہ زبیر نے اپنے بیٹے عبداللہ (رضی اللہ عنہما) کو جنگ جمل کی صبح کو وصیت کی اور کہا: میراکوئی عضو ایسا نہیں ہے جو رسول اللہ ﷺ کی رفاقت میں زخمی نہ ہوا ہو یہاں تک کہ میری شرمگاہ بھی ۱؎۔\nامام ترمذی کہتے ہیں: حماد بن زیدکی روایت سے یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3746] ما مني عضو إلی وقد جرح
إسنادہ ضعیف باب مناقب الزبیر بن العوام
ہشام لم یدرک الزبیر واستظہر المزي في تحفۃ الأشراف (180/3) بأنہ رواہ عن عبد اللّٰہ بن الزبیر بہ وإن صح ھذا فالسند صحیح۔`;
tirmizi.anwaar = [309,1];