var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا رَجَاءُ بْنُ مُحَمَّدٍ الْعُذْرِيُّ بَصْرِيٌّ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ سَعْدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ اسْتَجِبْ لِسَعْدٍ إِذَا دَعَاكَ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ إِسْمَعِيلَ عَنْ قَيْسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ اسْتَجِبْ لِسَعْدٍ إِذَا دَعَاكَ وَهَذَا أَصَحُّ";
tirmizi.urdu = "سعد بن ابی وقاص رضی اللہ عنہ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا:' اے اللہ! سعد جب تجھ سے دعا کریں تو ان کی دعا قبول فرما ' ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث اسماعیل بن ابی خالدسے قیس بن حازم کے واسطہ سے روایت کی گئی ہے کہ نبی اکرم ﷺ نے فرمایا:' اے اللہ! سعد جب تجھ سے دعاکریں تو ان کی دعا قبول فرما اور یہ زیادہ صحیح ہے۔(یعنی: مرسل روایت زیادہ صحیح ہے)";
tirmizi.hukam = "";
tirmizi.description = `[3751] اللّٰہم استجب لسعد
إسنادہ ضعیف باب مناقب أبي إسحاق سعد بن أبي وقاص
إسماعیل بن أبي خالد مدلس وعنعن ( د 2930 ) وللحدیث شواھد۔`;
tirmizi.anwaar = [309,1];