var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ عِكْرِمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ مَا احْتَذَى النِّعَالَ وَلَا انْتَعَلَ وَلَا رَكِبَ الْمَطَايَا وَلَا رَكِبَ الْكُورَ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ مِنْ جَعْفَرِ بْنِ أَبِي طَالِبٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَالْكُورُ الرَّحْلُ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں: نہ کسی نے جوتا پہنا یا اور نہ پہنا اورنہ سوار ہوا سواریوں پر اور نہ چڑھا اونٹ کی کاٹھی پر جو رسول اللہ ﷺ کے بعد جعفر بن ابی طالب سے افضل وبہتر ہو۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح غریب ہے،۲-کور کے معنیٰ کجاوہ کے ہیں۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;