var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ حَدَّثَنَا رَزِينٌ قَالَ حَدَّثَتْنِي سَلْمَى قَالَتْ دَخَلْتُ عَلَى أُمِّ سَلَمَةَ وَهِيَ تَبْكِي فَقُلْتُ مَا يُبْكِيكِ قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعْنِي فِي الْمَنَامِ وَعَلَى رَأْسِهِ وَلِحْيَتِهِ التُّرَابُ فَقُلْتُ مَا لَكَ يَا رَسُولَ اللَّهِ قَالَ شَهِدْتُ قَتْلَ الْحُسَيْنِ آنِفًا قَالَ هَذَا حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "سلمیٰ کہتی ہیں کہ میں ام المومنین ام سلمہ رضی اللہ عنہا کے پاس آئی،وہ رورہی تھیں،میں نے پوچھا: آپ کیوں رورہی ہیں؟ وہ بولیں،میں نے رسول اللہ ﷺ کو دیکھا ہے (یعنی خواب میں) آپ کے سراور داڑھی پر مٹی تھی،تو میں نے عرض کیا: آپ کو کیاہوا ہے؟ اللہ کے رسول! تو آپ نے فرمایا:' میں حسین کاقتل ابھی ابھی دیکھا ہے '۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3771] شھدت قتل الحسین آنفًا
إسنادہ ضعیف باب مناقب الحسن بن علي والحسین بن علي
سلمٰی : لا تعرف (تق: 8607) وحدیث أحمد (283/1) یغني عنہ۔`;
tirmizi.anwaar = [310,1];