var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ حَدَّثَنِي يُوسُفُ بْنُ إِبْرَاهِيمَ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ أَهْلِ بَيْتِكَ أَحَبُّ إِلَيْكَ قَالَ الْحَسَنُ وَالْحُسَيْنُ وَكَانَ يَقُولُ لِفَاطِمَةَ ادْعِي لِيَ ابْنَيَّ فَيَشُمُّهُمَا وَيَضُمُّهُمَا إِلَيْهِ قَالَ هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَنَسٍ";
tirmizi.urdu = "انس بن مالک کہتے ہیں: رسول اللہ ﷺ سے پوچھا گیا کہ آپ کے اہل بیت میں آپ کو سب سے زیادہ محبوب کون ہیں؟ تو آپ نے فرمایا:' حسن اور حسین رضی اللہ عنہما،آپ فاطمہ رضی اللہ عنہا سے فرماتے: میرے دونوں بیٹوں کو بلاؤ،پھر آپ انہیں چومتے اور انہیں اپنے سینہ سے لگاتے'۔\nامام ترمذی کہتے ہیں: انس کی روایت سے یہ حدیث اس سند سے غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3772] ادعي لي ابني
إسنادہ ضعیف باب مناقب الحسن بن علي والحسین بن علي
یوسف بن إبراہیم : ضعیف (تق: 7855) `;
tirmizi.anwaar = [310,2];