var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ حَدَّثَنَا الْأَشْعَثُ هُوَ ابْنُ عَبْدِ الْمَلِكِ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَ صَعِدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمِنْبَرَ فَقَالَ إِنَّ ابْنِي هَذَا سَيِّدٌ يُصْلِحُ اللَّهُ عَلَى يَدَيْهِ فِئَتَيْنِ عَظِيمَتَيْنِ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ يَعْنِي الْحَسَنَ بْنَ عَلِيٍّ";
tirmizi.urdu = "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺنے منبر پر چڑھ کرفرمایا:' میرا یہ بیٹا سردار ہے،اللہ تعالیٰ اس کے ذریعہ دو بڑے گروہوں میں صلح کرائے گا ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-اور 'ابنی ہذا' سے مراد حسن بن علی ہیں رضی اللہ عنہما۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;