var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ لَمْ يَكُنْ مِنْهُمْ أَحَدٌ أَشْبَهَ بِرَسُولِ اللَّهِ مِنْ الْحَسَنِ بْنِ عَلِيٍّ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں: لوگوں میں حسن بن علی رضی اللہ عنہما سے زیادہ اللہ کے رسول کے مشابہ کوئی نہیں تھا۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;