var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ أَبِي جُحَيْفَةَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ وَفِي الْبَاب عَنْ أَبِي بَكْرٍ الصِّدِّيقِ وَابْنِ عَبَّاسٍ وَابْنِ الزُّبَيْرِ";
tirmizi.urdu = "ابوجحیفہ رضی اللہ عنہ کہتے ہیں: میں نے رسول اللہ ﷺ کو دیکھا اورحسن بن علی رضی اللہ عنہما ان سے مشابہت رکھتے تھے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اس باب میں ابوبکر صدیق،ابن عباس اور عبداللہ بن زبیر رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;