var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ قَالَ لَمَّا جِيءَ بِرَأْسِ عُبَيْدِ اللَّهِ بْنِ زِيَادٍ وَأَصْحَابِهِ نُضِّدَتْ فِي الْمَسْجِدِ فِي الرَّحَبَةِ فَانْتَهَيْتُ إِلَيْهِمْ وَهُمْ يَقُولُونَ قَدْ جَاءَتْ قَدْ جَاءَتْ فَإِذَا حَيَّةٌ قَدْ جَاءَتْ تَخَلَّلُ الرُّءُوسَ حَتَّى دَخَلَتْ فِي مَنْخَرَيْ عُبَيْدِ اللَّهِ بْنِ زِيَادٍ فَمَكَثَتْ هُنَيْهَةً ثُمَّ خَرَجَتْ فَذَهَبَتْ حَتَّى تَغَيَّبَتْ ثُمَّ قَالُوا قَدْ جَاءَتْ قَدْ جَاءَتْ فَفَعَلَتْ ذَلِكَ مَرَّتَيْنِ أَوْ ثَلَاثًا هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عمارہ بن عمیر کہتے ہیں کہ جب عبیداللہ بن زیاد اور اس کے ساتھیوں کے سر لائے گئے ۱؎ اورکوفہ کی ایک مسجد میں انہیں ترتیب سے رکھ دیاگیا اور میں وہاں پہنچا تو لوگ یہ کہہ رہے تھے: آیا آیا،تو کیا دیکھتاہوں کہ ایک سانپ سروں کے بیچ سے ہوکر آیا اور عبید اللہ بن زیاد کے دونوں نتھنوں میں داخل ہوگیا اور تھوڑی دیر اس میں رہا پھر نکل کر چلاگیا،یہاں تک کہ غائب ہوگیا،پھر لوگ کہنے لگے: آیا آیا اس طرح دو یا تین بار ہوا ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3780] لما جيء برأس عبیداللّٰہ بن زیاد
إسنادہ ضعیف باب مناقب الحسن بن علي والحسین بن علي
الأعمش مدلس وعنعن ( تقدم : 169) ولہ شاہد ضعیف في تاریخ دمشق (341/39) ومع تدلیس الأعمش،صححہ الذھبي (سیر أعلام النبلاء 549/3) !`;
tirmizi.anwaar = [311,1];