var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا زَمْعَةُ بْنُ صَالِحٍ عَنْ سَلَمَةَ بْنِ وَهْرَامٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَامِلَ الْحُسَيْنِ بْنِ عَلِيٍّ عَلَى عَاتِقِهِ فَقَالَ رَجُلٌ نِعْمَ الْمَرْكَبُ رَكِبْتَ يَا غُلَامُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنِعْمَ الرَّاكِبُ هُوَ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَزَمْعَةُ بْنُ صَالِحٍ قَدْ ضَعَّفَهُ بَعْضُ أَهْلِ الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں: رسول اللہ ﷺ حسین بن علی رضی اللہ عنہما کو اپنے کندھے پر اٹھائے ہوئے تھے تو ایک شخص نے کہا:بیٹے! کیاہی اچھی سواری ہے جس پر تو سوار ہے،تو نبی اکرم ﷺ نے فرمایا:' اور سوار بھی کیا ہی اچھا ہے'۔امام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،ہم اسے صرف اسی سند سے جانتے ہیں،۲-زمعہ بن صالح کی بعض محدثین نے ان کے حفظ کے تعلق سے تضعیف کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3784] ونعم الراکب ھو
إسنادہ ضعیف باب مناقب الحسن بن علي والحسین بن علي
زمعۃ : ضعیف (تقدم : 3616) وللحدیث شواہد ضعیفۃ۔`;
tirmizi.anwaar = [311,1];