var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ قَالَ: حَدَّثَنَا سُفْيَانُ،عَنْ كَثِيرٍ النَّوَّاءِ،عَنْ أَبِي إِدْرِيسَ،عَنْ المُسَيِّبِ بْنِ نَجَبَةَ،قَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ كُلَّ نَبِيٍّ أُعْطِيَ سَبْعَةَ نُجَبَاءَ رُفَقَاءَ أَوْ رُقَبَاءَ وَأُعْطِيتُ أَنَا أَرْبَعَةَ عَشَرَ»،قُلْنَا: مَنْ هُمْ؟ قَالَ،«أَنَا وَابْنَايَ،وَجَعْفَرُ،وَحَمْزَةُ،وَأَبُو بَكْرٍ،وَعُمَرُ،وَمُصْعَبُ بْنُ عُمَيْرٍ،وَبِلَالٌ،وَسَلْمَانُ،وَعَمَّارٌ،وَالْمِقْدَادُ،وَحُذَيْفَةُ،وَعَبْدُ اللَّهِ بْنُ مَسْعُودٍ»: «هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الوَجْهِ. وَقَدْ رُوِيَ هَذَا الحَدِيثُ عَنْ عَلِيٍّ مَوْقُوفًا»";
tirmizi.urdu = "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ نبی اکرم ﷺ نے فرمایا:' ہر نبی کو اللہ نے سات نقیب عنایت فرمائے ہیں،اور مجھے چودہ،ہم نے عرض کیا: وہ کون لوگ ہیں؟ آپ نے فرمایا:' میں،میرے دونوں نواسے،جعفر،حمزہ،ابوبکر،عمر،مصعب بن عمیر،بلال،سلمان،مقداد،حذیفہ،عمار اور عبداللہ بن مسعود رضی اللہ عنہم '۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث اس سند سے حسن غریب ہے،۲-یہ حدیث علی رضی اللہ عنہ سے موقوفاً بھی آئی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3785] إن کل نبي أعطي سبعۃ نجباء
إسنادہ ضعیف باب مناقب الحسن بن علي والحسین بن علي
کثیر : ضعیف (تقدم: 3670) `;
tirmizi.anwaar = [311,1];