var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ الْحَسَنِ بْنِ صَالِحٍ عَنْ أَبِي رَبِيعَةَ الْإِيَادِيِّ عَنْ الْحَسَنِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْجَنَّةَ لَتَشْتَاقُ إِلَى ثَلَاثَةٍ عَلِيٍّ وَعَمَّارٍ وَسَلْمَانَ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْحَسَنِ بْنِ صَالِحٍ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' جنت تین آدمیوں کی مشتاق ہے: علی،عمار،اور سلمان رضی اللہ عنہم کی '۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف حسن بن صالح کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3797] إن الجنۃ تشتاق إلی ثلاثۃ
إسنادہ ضعیف باب مناقب سلمان الفارسي
الحسن عنعن ( تقدم : 21) `;
tirmizi.anwaar = [311,1];