var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْعَبَّاسُ الْعَنْبَرِيُّ حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنِي أَبُو زُمَيْلٍ هُوَ سِمَاكُ بْنُ الْوَلِيدِ الْحَنَفِيُّ عَنْ مَالِكِ بْنِ مَرْثَدٍ عَنْ أَبِيهِ عَنْ أَبِي ذَرٍّ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَظَلَّتْ الْخَضْرَاءُ وَلَا أَقَلَّتْ الْغَبْرَاءُ مِنْ ذِي لَهْجَةٍ أَصْدَقَ وَلَا أَوْفَى مِنْ أَبِي ذَرٍّ شِبْهِ عِيسَى ابْنِ مَرْيَمَ عَلَيْهِ السَّلَام فَقَالَ عُمَرُ بْنُ الْخَطَّابِ كَالْحَاسِدِ يَا رَسُولَ اللَّهِ أَفَتَعْرِفُ ذَلِكَ لَهُ قَالَ نَعَمْ فَاعْرِفُوهُ لَهُ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ فَقَالَ أَبُو ذَرٍّ يَمْشِي فِي الْأَرْضِ بِزُهْدِ عِيسَى ابْنِ مَرْيَمَ عَلَيْهِ السَّلَام";
tirmizi.urdu = "ابوذر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' آسمان نے کسی پر سایہ نہیں کیا اور نہ زمین نے کسی کو پناہ دی جو ابوذر سے-جو عیسیٰ بن مریم کے مشابہ ہیں-زیادہ زبان کا سچا اور اس کا پاس ولحاظ رکھنے والاہو'،یہ سن کر عمر بن خطاب رضی اللہ عنہ رشک کے انداز میں بولے: اللہ کے رسول! کیا ہم یہ بات انہیں بتادیں؟ آپ نے فرمایا:' ہاں،بتادو'۔\nامام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے،۲-اور بعضوں نے اس حدیث کوروایت کیا ہے اس میں ہے کہ آپ نے فرمایا:' ابوذر زمین پر عیسیٰ بن مریم کی زاہدانہ چال چلتے ہیں'۔";
tirmizi.hukam = "";
tirmizi.description = `[3802] أبو ذر یمشي فی الأرض بزھد عیسی
لاأصل لہ
باب مناقب أبي ذر الغفاري
ھذا الحدیث لم أجدہ وأما حدیث ((ما أظلت الخضراء)) إلخ فسندہ حسن۔`;
tirmizi.anwaar = [312,1];