var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا صَاعِدٌ الْحَرَّانِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مَنْصُورٌ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كُنْتُ مُؤَمِّرًا أَحَدًا مِنْ غَيْرِ مَشُورَةٍ مِنْهُمْ لَأَمَّرْتُ عَلَيْهِمْ ابْنَ أُمِّ عَبْدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ الْحَارِثِ عَنْ عَلِيٍّ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' اگر میں بغیر مشورہ کے ان میں سے کسی کو امیر بناتا تو ام عبد کے بیٹے (عبداللہ بن مسعود) کو امیر بناتا'۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف حارث کی روایت سے جانتے ہیں جسے وہ علی سے روایت کرتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3808۔3809 ] لو کنت مؤمرًا أحدًا منھم
إسنادہ ضعیف / جہ 137    باب مناقب عبد اللّٰہ بن مسعود رضي اللّٰہ عنہ
الحارث الأعور : ضعیف ( تقدم :282 ) `;
tirmizi.anwaar = [312,1];