var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كُنْتُ مُؤَمِّرًا أَحَدًا مِنْ غَيْرِ مَشُورَةٍ لَأَمَّرْتُ ابْنَ أُمِّ عَبْدٍ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' اگر میں بغیر مشورہ کے کسی کو امیر بناتاتو ام عبد کے بیٹے (عبداللہ بن مسعود) کو امیر بناتا'۔";
tirmizi.hukam = "";
tirmizi.description = `۔3809 ] لو کنت مؤمرًا أحدًا منھم
إسنادہ ضعیف / جہ 137    باب مناقب عبد اللّٰہ بن مسعود رضي اللّٰہ عنہ
الحارث الأعور : ضعیف ( تقدم :282 ) `;
tirmizi.anwaar = [312,1];