var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا إِسْحَقُ بْنُ عِيسَى عَنْ شَرِيكٍ عَنْ أَبِي الْيَقْظَانِ عَنْ زَاذَانَ عَنْ حُذَيْفَةَ قَالَ قَالُوا يَا رَسُولَ اللَّهِ لَوْ اسْتَخْلَفْتَ قَالَ إِنْ أَسْتَخْلِفْ عَلَيْكُمْ فَعَصَيْتُمُوهُ عُذِّبْتُمْ وَلَكِنْ مَا حَدَّثَكُمْ حُذَيْفَةُ فَصَدِّقُوهُ وَمَا أَقْرَأَكُمْ عَبْدُ اللَّهِ فَاقْرَءُوهُ قَالَ عَبْدُ اللَّهِ فَقُلْتُ لِإِسْحَقَ بْنِ عِيسَى يَقُولُونَ هَذَا عَنْ أَبِي وَائِلٍ قَالَ عَنْ زَاذَانَ إِنْ شَاءَ اللَّهُ قَالَ هَذَا حَدِيثٌ حَسَنٌ وَهُوَ حَدِيثُ شَرِيكٍ";
tirmizi.urdu = "حذیفہ رضی اللہ عنہ کہتے ہیں کہ لوگوں نے عرض کیا: اللہ کے رسول! کاش! آپ اپنا جانشین مقرر فرمادیتے،آپ نے فرمایا:' اگر میں نے اپنا جانشین مقرر کردیا اور تم نے اس کی نافرمانی کی تو تم عذاب دیئے جاؤ گے،البتہ حذیفہ جو کچھ تم سے کہیں تم ان کی تصدیق کرو'،اورجو عبداللہ (بن مسعود) ۱؎ تمہیں پڑھائیں انہیں پڑھ لو'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن ہے اور یہ شریک کی روایت سے ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3812] إن استخلفت علیکم فعصیتموہ عذبتم
إسنادہ ضعیف باب مناقب حذیفۃ بن الیمان
أبو الیقظان :ضعیف (تقدم : 126) `;
tirmizi.anwaar = [312,1];