var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ مَا كُنَّا نَدْعُو زَيْدَ بْنَ حَارِثَةَ إِلَّا زَيْدَ ابْنَ مُحَمَّدٍ حَتَّى نَزَلَتْ ادْعُوهُمْ لِآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللَّهِ قَالَ هَذَا حَدِيثٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ ہم زید بن حارثہ کو زید بن محمد ہی کہہ کر پکارتے تھے یہاں تک کہ آیت کریمہ ادْعُوہُمْ لآبَائِہِمْ ہُوَ أَقْسَطُ عِنْدَ اللَّہِ ۱؎ نازل ہوئی۔امام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;