var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو الْأَزْدِيُّ حَدَّثَنَا زَائِدَةُ عَنْ بَيَانٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ مَا حَجَبَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنْذُ أَسْلَمْتُ وَلَا رَآنِي إِلَّا ضَحِكَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "جریر بن عبداللہ بجلی رضی اللہ عنہ کہتے ہیں: جب سے میں اسلام لایاہوں رسول اللہ ﷺ نے مجھے (اجازت مانگنے پر اندر داخل ہو نے سے)منع نہیں فرمایا ۱؎ اور جب بھی آپ نے مجھے دیکھا آپ مسکرائے۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;