var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا زَائِدَةُ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ قَيْسٍ عَنْ جَرِيرٍ قَالَ مَا حَجَبَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنْذُ أَسْلَمْتُ وَلَا رَآنِي إِلَّا تَبَسَّمَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "جریربن عبداللہ بجلی رضی اللہ عنہ کہتے ہیں: رسول اللہ ﷺ نے جب سے میں اسلام لایاہوں مجھے (اندرجانے سے)منع نہیں کیا اور جب بھی آپ نے مجھے دیکھا آپ مسکرائے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;