var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمَحْمُودُ بْنُ غَيْلَانَ قَالَا حَدَّثَنَا أَبُو أَحْمَدَ عَنْ سُفْيَانَ عَنْ لَيْثٍ عَنْ أَبِي جَهْضَمٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ رَأَى جِبْرِيلَ عَلَيْهِ السَّلَام مَرَّتَيْنِ وَدَعَا لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّتَيْنِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ مُرْسَلٌ وَلَا نَعْرِفُ لِأَبِي جَهْضَمٍ سَمَاعًا مِنْ ابْنِ عَبَّاسٍ وَقَدْ رَوَى عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ وَأَبُو جَهْضَمٍ اسْمُهُ مُوسَى بْنُ سَالِمٍ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ انہوں نے جبرئیل علیہ السلام کو دوبار دیکھا اور نبی اکرم ﷺ نے ان کے لیے دومرتبہ دعائیں کیں۔امام ترمذی کہتے ہیں:۱-یہ حدیث مرسل ہے،ہمیں نہیں معلوم کہ ابوجہضم کا ابن عباس سے سماع ہے یا نہیں ۲-یہ حدیث عبید اللہ بن عبداللہ بن عباس سے بھی ابن عباس کے واسطہ سے آئی ہے،۳-اور ابوجہضم کانام موسیٰ بن سالم ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3822] أنہ رأی جبرئیل مرتین
إسنادہ ضعیف باب مناقب عبد اللّٰہ بن عباس
لیث : ضعیف (تقدم : 218) والسند منقطع وسفیان الثوري عنعن (تقدم : 746) `;
tirmizi.anwaar = [312,1];