var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِسْحَقَ الْجَوْهَرِيُّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُؤَمَّلِ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى فِي بَيْتِ الزُّبَيْرِ مِصْبَاحًا فَقَالَ يَا عَائِشَةُ مَا أُرَى أَسْمَاءَ إِلَّا قَدْ نُفِسَتْ فَلَا تُسَمُّوهُ حَتَّى أُسَمِّيَهُ فَسَمَّاهُ عَبْدَ اللَّهِ وَحَنَّكَهُ بِتَمْرَةٍ بِيَدِهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم ﷺ نے (خواب میں) زبیر کے گھر میں ایک چراغ دیکھا تو آپ نے عائشہ سے فرمایا:' عائشہ! میں یہی سمجھاہوں کہ اسماء کے یہاں ولادت ہونے والی ہے،تو اس کانام تم لوگ نہ رکھنا،میں رکھوں گا،تو آپ ﷺنے ان کا نام عبداللہ رکھا،اور اپنے ہاتھ سے ایک کھجور کے ذریعہ ان کی تحنیک کی ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3826] یا عائشۃ ! ما أری أسماء إلا قد
إسنادہ ضعیف باب مناقب لعبد اللّٰہ بن الزبیر
عبد اللّٰہ بن المؤمل : ضعیف الحدیث (تق: 3648) وحدیث مسلم (2146) ھو المحفوظ۔`;
tirmizi.anwaar = [312,1];