var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ: حَدَّثَنَا أَبُو أُسَامَةَ،عَنْ شَرِيكٍ،عَنْ عَاصِمٍ الْأَحْوَلِ،عَنْ أَنَسٍ،قَالَ: رُبَّمَا قَالَ لِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا ذَا الأُذُنَيْنِ». قَالَ أَبُو أُسَامَةَ: يَعْنِي يُمَازِحُهُ: «هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ»";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں کہ کبھی کبھی نبی اکرم ﷺ مجھے کہتے: 'اے دوکانوں والے'۔ابواسامہ کہتے ہیں: یعنی آپ ان سے یہ مذاق کے طورپر فرماتے ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث غریب صحیح ہے۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;