var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا مَيْمُونٌ أَبُو عَبْدِ اللَّهِ حَدَّثَنَا ثَابِتٌ الْبُنَانِىُّ قَالَ قَالَ لِي أَنَسُ بْنُ مَالِكٍ يَا ثَابِتُ خُذْ عَنِّي فَإِنَّكَ لَنْ تَأْخُذَ عَنْ أَحَدٍ أَوْثَقَ مِنِّي إِنِّي أَخَذْتُهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ جِبْرِيلَ وَأَخَذَهُ جِبْرِيلُ عَنْ اللَّهِ تَعَالَى قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ زَيْدِ بْنِ الْحُبَابِ حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ مَيْمُونٍ أَبِي عَبْدِ اللَّهِ عَنْ ثَابِتٍ عَنْ أَنَسٍ نَحْوَ حَدِيثِ إِبْرَاهِيمَ بْنِ يَعْقُوبَ وَلَمْ يَذْكُرْ فِيهِ وَأَخَذَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ جِبْرِيلَ";
tirmizi.urdu = "ثابت بنانی کا بیان ہے کہ مجھ سے انس بن مالک رضی اللہ عنہ نے کہا: اے ثابت مجھ سے علم دین حاصل کرو کیوں کہ اس کے لیے تم مجھ سے زیادہ معتبر آدمی کسی کو نہیں پاؤگے،میں نے اسے (براہ راست) رسول اللہ ﷺ سے لیا ہے،اور آپ ﷺنے جبرئیل سے اور جبرئیل نے اللہ تعالیٰ سے لیا ہے۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے،ہم اسے صرف زید بن حباب کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3831۔3832] یا ثابت! خذ عني فإنک لم تأخذ
إسنادہ ضعیف باب مناقب لأنس بن مالک
میمون بن أبان : مستور (تق: 7042) أي مجہول الحال،وثقہ ابن حبان وحدہ۔`;
tirmizi.anwaar = [313,1];