var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ قَالَ: حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ،عَنْ مَيْمُونٍ أَبِي عَبْدِ اللَّهِ،عَنْ ثَابِتٍ،عَنْ أَنَسٍ،نَحْوَ حَدِيثِ إِبْرَاهِيمَ بْنِ يَعْقُوبَ،وَلَمْ يَذْكُرْ فِيهِ وَأَخَذَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ جِبْرِيلَ";
tirmizi.urdu = "اس سند سے بھی انس رضی اللہ عنہ سے ابراہیم بن یعقوب والی حدیث ہی کی طرح حدیث مروی ہے،لیکن اس میں اس کا ذکر نہیں ہے کہ نبی اکرم ﷺ نے اسے جبرئیل سے لیا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔3832] یا ثابت! خذ عني فإنک لم تأخذ
إسنادہ ضعیف باب مناقب لأنس بن مالک
میمون بن أبان : مستور (تق: 7042) أي مجہول الحال،وثقہ ابن حبان وحدہ۔`;
tirmizi.anwaar = [313,1];