var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا عَمْرُو بْنُ وَاقِدٍ عَنْ يُونُسَ بْنِ حَلْبَسٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ قَالَ لَمَّا عَزَلَ عُمَرُ بْنُ الْخَطَّابِ عُمَيْرَ بْنَ سَعْدٍ عَنْ حِمْصَ وَلَّى مُعَاوِيَةَ فَقَالَ النَّاسُ عَزَلَ عُمَيْرًا وَوَلَّى مُعَاوِيَةَ فَقَالَ عُمَيْرٌ لَا تَذْكُرُوا مُعَاوِيَةَ إِلَّا بِخَيْرٍ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ اهْدِ بِهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ قَالَ وَعَمْرُو بْنُ وَاقِدٍ يُضَعَّفُ";
tirmizi.urdu = "ابوادریس خولانی کہتے ہیں کہ جب عمر بن خطاب رضی اللہ عنہ نے عمیر بن سعد کو حمص سے معزول کیااور ان کی جگہ معاویہ رضی اللہ عنہ کو والی بنایا تو لوگوں نے کہا: انہوں نے عمیر کو معزول کردیا اور معاویہ کووالی بنایا،تو عمیر نے کہا: تم لوگ معاویہ رضی اللہ عنہ کا ذکر بھلے طریقہ سے کرو کیوں کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ہے:' اے اللہ! ان کے ذریعہ ہدایت دے'۔امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-عمرو بن واقد حدیث میں ضعیف ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3843] لما عزل عمر بن الخطاب عمیر بن سعد
إسنادہ ضعیف جدًا    باب مناقب معاویۃ بن أبي سفیان
عمرو بن واقد متروک ( تقدم : 2340 ) و الحدیث السابق ( الأصل : 3842 ) یغني عنہ۔`;
tirmizi.anwaar = [313,1];