var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ مِشْرَحِ بْنِ هَاعَانَ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْلَمَ النَّاسُ وَآمَنَ عَمْرُو بْنُ الْعَاصِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ عَنْ مِشْرَحِ بْنِ هَاعَانَ وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ";
tirmizi.urdu = "عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' لوگ اسلام لائے اور عمرو بن عاص رضی اللہ عنہ ایمان لائے ' ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف ابن لہیعہ کی روایت سے جانتے ہیں جسے وہ مشرح بن ہاعان سے روایت کرتے ہیں اوراس کی سندزیادہ قوی نہیں ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 6245
وللحدیث شاھد`;