var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَزْهَرُ السَّمَّانُ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ خِدَاشٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيَدْخُلَنَّ الْجَنَّةَ مَنْ بَايَعَ تَحْتَ الشَّجَرَةِ إِلَّا صَاحِبَ الْجَمَلِ الْأَحْمَرِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "جابر رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' جنہوں نے درخت کے نیچے بیعت کی (یعنی بیعت رضوان میں شریک رہے) وہ ضرور جنت میں داخل ہوں گے،سوائے سرخ اونٹ والے کے' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3863] لیدخلن الجنۃ من بایع تحت الشجرۃ
إسنادہ ضعیف باب في من سب أصحاب النبي ﷺ
أبو الزبیر عنعن ( تقدم : 927) وتلمیذہ خداش : لین الحدیث (تق: 1705) `;
tirmizi.anwaar = [313,1];