var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حُسَيْنُ بْنُ يَزِيدَ الْكُوفِيُّ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ أَبِي الْجَحَّافِ عَنْ جُمَيْعِ بْنِ عُمَيْرٍ التَّيْمِيِّ قَالَ دَخَلْتُ مَعَ عَمَّتِي عَلَى عَائِشَةَ فَسُئِلَتْ أَيُّ النَّاسِ كَانَ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ فَاطِمَةُ فَقِيلَ مِنْ الرِّجَالِ قَالَتْ زَوْجُهَا إِنْ كَانَ مَا عَلِمْتُ صَوَّامًا قَوَّامًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ قَالَ وَأَبُو الْجَحَّافِ اسْمُهُ دَاوُدُ بْنُ أَبِي عَوْفٍ وَيُرْوَى عَنْ سُفْيَانَ الثَّوْرِيِّ حَدَّثَنَا أَبُو الْجَحَّافِ وَكَانَ مَرْضِيًّا";
tirmizi.urdu = "جمیع بن عمیر تیمی کہتے ہیں کہ میں اپنے چچا کے ساتھ عائشہ کے پاس آیا تو ان سے پوچھا گیا: لوگوں میں رسول اللہ ﷺ کو سب سے زیادہ محبوب کون تھا؟ تو انہوں نے کہا: فاطمہ،پھر پوچھاگیا: مردوں میں کون تھا؟ انہوں نے کہا: ان کے شوہر،یعنی علی،میں خوب جانتی ہوں وہ بڑے صائم اور تہجد گزار تھے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-ابوجحاف کانام داود بن ابی عوف ہے،اور سفیان ثوری سے ' عن ابی الجحاف ' کے بجائے یوں مروی ہے: ' حَدَّثَنَا أَبُو الْجَحَّافِ وَکَانَ مَرْضِیًّا'۔";
tirmizi.hukam = "";
tirmizi.description = `[3874] زوجھا إن کان ما علمت صوامًا قوامًا
إسنادہ ضعیف باب ما جاء في فضل فاطمۃ رضي اﷲ عنہا
جمیع بن عمیر : ضعیف ( تقدم : 3670 ) `;
tirmizi.anwaar = [314,1];