var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ حَدَّثَنَا خَالِدُ بْنُ سَلَمَةَ الْمَخْزُومِيُّ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ مَا أَشْكَلَ عَلَيْنَا أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثٌ قَطُّ فَسَأَلْنَا عَائِشَةَ إِلَّا وَجَدْنَا عِنْدَهَا مِنْهُ عِلْمًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ";
tirmizi.urdu = "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ ہم اصحاب رسول اللہ ﷺ پرجب بھی کوئی حدیث مشکل ہوتی اور ہم نے اس کے بارے میں عائشہ سے پوچھاتو ہمیں ان کے پاس اس کے بارے میں کوئی جانکاری ضرورملی ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = `مشکوۃ المصابیح: 6194`;