var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ الْكُوفِيُّ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو عَنْ زَائِدَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ مُوسَى بْنِ طَلْحَةَ قَالَ مَا رَأَيْتُ أَحَدًا أَفْصَحَ مِنْ عَائِشَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ";
tirmizi.urdu = "موسیٰ بن طلحہ کہتے ہیں کہ میں نے عائشہ رضی اللہ عنہا سے زیادہ فصیح کسی کو نہیں دیکھا۔\nامام ترمذی کہتے ہی: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3884] ما رأیت أحدًا أفصح من عائشۃ
إسنادہ ضعیف باب من فضل عائشۃ رضي اللّٰہ عنھا
عبد الملک بن عمیر عنعن (تقدم : 3659 ) والمفہوم صحیح۔`;
tirmizi.anwaar = [314,1];