var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ غَالِبٍ أَنَّ رَجُلًا نَالَ مِنْ عَائِشَةَ عِنْدَ عَمَّارِ بْنِ يَاسِرٍ فَقَالَ أَغْرِبْ مَقْبُوحًا مَنْبُوحًا أَتُؤْذِي حَبِيبَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عمروبن غالب سے روایت ہے کہ ایک شخص نے عمار بن یاسر رضی اللہ عنہ کے پاس عائشہ کی عیب جوئی کی تو انہوں نے کہا: ہٹ مردود کمینے،کیا تو رسول اللہ ﷺ کی محبوبہ کو اذیت پہنچا رہاہے؟۔\nامام ترمذی کہتے ہی: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3888] أن رجلاً نال من عائشۃ
إسنادہ ضعیف باب من فضل عائشۃ رضي اﷲ عنہا
سفیان الثوري وأبو إسحاق عنعنا (تقدما : 746،107) `;
tirmizi.anwaar = [314,1];