var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي حُصَيْنٍ عَنْ عَبْدِ اللَّهِ بْنِ زِيَادٍ الْأَسَدِيِّ قَال سَمِعْتُ عَمَّارَ بْنَ يَاسِرٍ يَقُولُ هِيَ زَوْجَتُهُ فِي الدُّنْيَا وَالْآخِرَةِ يَعْنِي عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ عَلِيٍّ";
tirmizi.urdu = "عبداللہ بن زیاد اسدی رضی اللہ عنہ کہتے ہیں کہ میں نے عمار بن یاسر رضی اللہ عنہ کو کہتے ہوئے سنا کہ یہ یعنی عائشہ رضی اللہ عنہا دنیا اور آخرت دونوں میں آپ کی بیوی ہیں ۱؎۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-اس باب میں علی رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;