var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ حُمَيْدٍ عَنْ أَنَسٍ قَالَ قِيلَ يَا رَسُولَ اللَّهِ مَنْ أَحَبُّ النَّاسِ إِلَيْكَ قَالَ عَائِشَةُ قِيلَ مِنْ الرِّجَالِ قَالَ أَبُوهَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَنَسٍ";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں کہ آپ سے عرض کیاگیا: اللہ کے رسول! لوگوں میں آپ کو سب سے زیادہ محبوب کون ہے؟ آپ نے فرمایا:' عائشہ،عرض کیاگیا مردوں میں؟ آپ نے فرمایا:' ان کے والد'۔\nامام ترمذی کہتے ہیں: یہ حدیث اس سند سے یعنی انس کی روایت سے حسن صحیح غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;