var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ الْبَصْرِيُّ حَدَّثَنَا أَبُو دَاوُدَ وَعَبْدُ الصَّمَدِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ ثَابِتٍ الْبُنَانِيُّ عَنْ أَبِيهِ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أَبِي طَلْحَةَ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرِئْ قَوْمَكَ السَّلَامَ فَإِنَّهُمْ مَا عَلِمْتُ أَعِفَّةٌ صُبُرٌ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوطلحہ رضی اللہ عنہ کہتے ہیں کہ مجھ سے رسول اللہ ﷺ نے فرمایا:' تم اپنی قوم ۱؎ کو سلام کہو،کیوں کہ وہ پاکباز اور صابر لوگ ہیں جیسا کہ مجھے معلوم ہے'۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3903] أقریء قومک السلام
إسنادہ ضعیف باب في فضل الأنصار و قریش
محمد بن ثابت البناني ضعیف (تقدم : 3510) وتابعہ الحسن بن أبي جعفر وھو ضعیف (تقدم : 334) `;
tirmizi.anwaar = [315,1];