var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ الْكُوفِيُّ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ عَنْ جَعْفَرٍ الْأَحْمَرِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ اغْفِرْ لِلْأَنْصَارِ وَلِأَبْنَاءِ الْأَنْصَارِ وَلِأَبْنَاءِ أَبْنَاءِ الْأَنْصَارِ وَلِنِسَاءِ الْأَنْصَارِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "انس رضی اللہ عنہ سے روایت ہے کہ نبی اکرم ﷺ نے فرمایا:' اے اللہ! انصار کو،ان کے بیٹوں کو،ان کے بیٹوں کے بیٹوں کو اور ان کی عورتوں کو بخش دے'۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3909] اللّٰہم اغفر للأنصار
إسنادہ ضعیف باب في فضل الأنصار و قریش
عطاء بن السائب اختلط ( تقدم : 184 ) وللحدیث شواھد عند البخاري ( 4906) ومسلم ( 2506) وغیرھما دون قولہ ’’ولنساء الأنصار ‘‘۔`;
tirmizi.anwaar = [315,1];