var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو السَّائِبِ سَلْمُ بْنُ جُنَادَةَ حَدَّثَنَا أَحْمَدُ بْنُ بَشِيرٍ عَنْ مُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ الْأَنْصَارِ بَنُو عَبْدِ الْأَشْهَلِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "جابر عبداللہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' انصار میں سب سے بہتر بنی عبدالا شہل ہیں ' ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث اس سند سے غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;