var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي رَزِينٍ عَنْ أُمِّهِ قَالَتْ كَانَتْ أُمُّ الْحُرَيْرِ إِذَا مَاتَ أَحَدٌ مِنْ الْعَرَبِ اشْتَدَّ عَلَيْهَا فَقِيلَ لَهَا إِنَّا نَرَاكِ إِذَا مَاتَ رَجُلٌ مِنْ الْعَرَبِ اشْتَدَّ عَلَيْكِ قَالَتْ سَمِعْتُ مَوْلَايَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ اقْتِرَابِ السَّاعَةِ هَلَاكُ الْعَرَبِ قَالَ مُحَمَّدُ بْنُ أَبِي رَزِينٍ وَمَوْلَاهَا طَلْحَةُ بْنُ مَالِكٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ سُلَيْمَانَ بْنِ حَرْبٍ";
tirmizi.urdu = "محمد بن رزین کی والد ہ کہتی ہیں کہ جب کوئی عرب مرتا تو ام جریر پر اس کی موت بڑی سخت ہوجاتی یعنی انہیں زبردست صدمہ ہوتا تو ان سے کہاگیا کہ ہم آپ کودیکھتے ہیں کہ جب کوئی عرب مرتاہے تو آپ کو بہت صدمہ پہنچتا ہے؟ تو انہوں نے کہا: میں نے اپنے مالک کو کہتے ہوئے سناہے کہ رسول اللہ ﷺ نے فرمایا:' عربوں کی ہلاکت قرب قیامت کی نشانی ہے۔محمد بن رزین کہتے ہیں: ان کے مالک کانام طلحہ بن مالک ہے۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے صرف سلیمان بن حرب کی روایت سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[3929] من اقتراب الساعۃ ھلاک العرب
إسنادہ ضعیف باب في فضل العرب
أم [محمد بن أبي زرین ] مجہولۃ (تحفۃ الأحوذي376/4) ولم أجد من وثقہا۔`;
tirmizi.anwaar = [316,1];