var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ وَمَحْمُودُ بْنُ غَيْلَانَ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ سَجْدَتَيْ السَّهْوِ بَعْدَ الْكَلَامِ قَالَ وَفِي الْبَاب عَنْ مُعَاوِيَةَ وَعَبْدِ اللَّهِ بْنِ جَعْفَرٍ وَأَبِي هُرَيْرَةَ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺنے سہو کے دونوں سجدے بات کرنے کے بعدکئے۔\nامام ترمذی کہتے ہیں: ۱-ابن مسعود رضی اللہ عنہ کی حدیث حسن صحیح ہے ۱ ؎،۲-اس باب میں معاویہ،عبداللہ بن جعفر اور ابوہریرہ رضی اللہ عنہم سے بھی احادیث آئی ہیں۔\nوضاحت ۱ ؎: یہ حکم نیچے والی حدیث میں موجودہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;