var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ حَدَّثَنَا صَالِحُ بْنُ أَبِي صَالِحٍ مَوْلَى عَمْرِو بْنِ حُرَيْثٍ قَال سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ ذُكِرَتْ الْأَعَاجِمُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنَا بِهِمْ أَوْ بِبَعْضِهِمْ أَوْثَقُ مِنِّي بِكُمْ أَوْ بِبَعْضِكُمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ أَبِي بَكْرِ بْنِ عَيَّاشٍ وَصَالِحُ بْنُ أَبِي صَالِحٍ هَذَا يُقَالُ لَهُ صَالِحُ بْنُ مِهْرَانَ مَوْلَى عَمْرِو بْنِ حُرَيْثٍ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کابیان ہے کہ نبی اکرمﷺ کے پاس عجم کا ذکر کیاگیا تو آپ نے فرمایا:' مجھے ان پر یا ان کے بعض لوگوں پرتم سے یا تمہارے بعض لوگوں سے زیادہ اعتماد ہے'۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے ہم اسے صرف ابوبکر بن عیاش کی روایت سے جانتے ہیں،۲-اور صالح بن ابی صالح کو صالح بن مہران مولی عمر وبن حریث بھی کہاجاتاہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3932] لأنا بھم أو ببعضھم أوثق
إسنادہ ضعیف باب في فضل العجم
 صالح : ضعیف (تق: 2867) وسفیان بن وکیع : ضعیف ( تقدم : 3082) `;
tirmizi.anwaar = [316,1];