var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالُوا يَا رَسُولَ اللَّهِ أَخْرَقَتْنَا نِبَالُ ثَقِيفٍ فَادْعُ اللَّهَ عَلَيْهِمْ قَالَ اللَّهُمَّ اهْدِ ثَقِيفًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ";
tirmizi.urdu = "جابر رضی اللہ عنہ کہتے ہیں کہ لوگوں نے عرض کیا: اللہ کے رسول! ثقیف کے تیروں نے ہمیں زخمی کردیا،تو آپ اللہ سے ان کے لیے بددعا فرمائیں،آپ نے فرمایا:' اے اللہ! ثقیف کو ہدایت دے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[3942] اللّٰہم اھد ثقیفًا
إسنادہ ضعیف باب في ثقیف وبني حنیفۃ
أبو الزبیر عنعن ( تقدم : 10) ورواہ عبد الرحمن بن سابط عن جابر بہ مختصرًا ( مسند أحمد : 343/3)
وعبد الرحمن لم یسمع من جابر رضي اللّٰہ عنہ۔`;
tirmizi.anwaar = [316,1];