var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ زَنْجَوَيْهِ الْبَغْدَادِيُّ وَغَيْرُ وَاحِدٍ،قَالُوُا: حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ،حَدَّثَنَا سُلَيْمَانُ بْنُ قَرْمٍ،عَنْ أَبِي يَحْيَى الْقَتَّاتِ،عَنْ مُجَاهِدٍ،عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: مِفْتَاحُ الْجَنَّةِ الصَّلاَةُ،وَمِفْتَاحُ الصَّلاَةِ الْوُضُوءُ";
tirmizi.urdu = "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' صلاۃ جنت کی کنجی ہے،اور صلاۃ کی کنجی وضو ہے'۔";
tirmizi.hukam = "";
tirmizi.description = `[4] مفتاح الجنۃ الصلوۃ
إسنادہ ضعیف باب ما جاء أن مفتاح الصلوۃ الطھور
سلیمان بن قرم ھو سلیمان بن معاذ: ضعیف ( د 1671 ) وأبو یحیی القتات لین الحدیث (د 4069 ) والحدیث السابق ( الأصل : 3) مع شواہدہ یغني عنہ۔`;
tirmizi.anwaar = [189,1];