var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي بَيْتِهِ قَالَ وَفِي الْبَاب عَنْ رَافِعِ بْنِ خَدِيجٍ وَكَعْبِ بْنِ عُجْرَةَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ میں نے مغرب کے بعد دونوں رکعتیں نبی اکرمﷺکے ساتھ آپ کے گھر میں پڑھیں۔امام ترمذی کہتے ہیں:۱-ابن عمر کی حدیث حسن صحیح ہے،۲-اس باب میں رافع بن خدیج اور کعب بن عجرہ رضی اللہ عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;