var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ،حَدَّثَنَا مَعْنُ بْنُ عِيسَى،حَدَّثَنَا مَالِكٌ،عَنْ ابْنِ شِهَابٍ،عَنْ عُرْوَةَ،عَنْ عَائِشَةَ أَنَّ رَسُولَ اللهِ ﷺ كَانَ يُصَلِّي مِنْ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً،يُوتِرُ مِنْهَا بِوَاحِدَةٍ،فَإِذَا فَرَغَ مِنْهَا اضْطَجَعَ عَلَى شِقِّهِ الأَيْمَنِ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہﷺ رات کو گیارہ رکعتیں پڑھتے تھے ان میں سے ایک رکعت وتر ہوتی۔تو جب آپ اس سے فارغ ہوجاتے تواپنے دائیں کروٹ لیٹتے ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[440] أن رسول اللّٰہ ﷺ کان یصلي من اللیل
إسنادہ ضعیف باب ما جاء في وصف صلاۃ النبي ﷺ باللیل
ابن شھاب الزھري مدلس وعنعن۔( د 145) وأخرجہ مسلم ( 121 / 736) بلفظ آخر وھو صحیح وانظر الحدیث الآتي ( الأصل: 441) وعندہ الإضطجاع بعد الرکعتین وھو الصواب۔`;
tirmizi.anwaar = [200,1];