var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ،حَدَّثَنَا أَبُو الأَحْوَصِ،عَنْ الأَعْمَشِ،عَنْ إِبْرَاهِيمَ،عَنْ الأَسْوَدِ بْنِ يَزِيدَ،عَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ ﷺ يُصَلِّي مِنْ اللَّيْلِ تِسْعَ رَكَعَاتٍ. قَالَ: وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ،وَزَيْدِ بْنِ خَالِدٍ،وَالْفَضْلِ بْنِ عَبَّاسٍ. قَالَ أَبُو عِيسَى: حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرمﷺ رات کو نورکعتیں پڑھتے تھے ۱؎۔\nامام ترمذی کہتے ہیں:۱-عائشہ رضی اللہ عنہا کی حدیث اس سندسے حسن غریب ہے،۲-اس باب میں ابوہریرہ،زید بن خالد اورفضل بن عباس رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;