var tirmizi = {};
tirmizi.arabic = "وَرَوَاهُ سُفْيَانُ الثَّوْرِيُّ،عَنْ الأَعْمَشِ نَحْوَ هَذَا،حَدَّثَنَا بِذَلِكَ مَحْمُودُ بْنُ غَيْلاَنَ،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،عَنْ سُفْيَانَ،عَنْ الأَعْمَشِ. قَالَ أَبُو عِيسَى: وَأَكْثَرُ مَا رُوِيَ عَنْ النَّبِيِّ ﷺ فِي صَلاَةِ اللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً مَعَ الْوِتْرِ،وَأَقَلُّ مَا وُصِفَ مِنْ صَلاَتِهِ بِاللَّيْلِ تِسْعُ رَكَعَاتٍ";
tirmizi.urdu = "سفیان ثوری نے بھی یہ حدیث اسی طرح اعمش سے روایت کی ہے،ہم سے اسے محمود بن غیلان نے بیان کیا،وہ کہتے ہیں کہ ہم سے یحییٰ بن آدم نے بیان کیا اور انہوں نے سفیان سے اور سفیان نے اعمش سے روایت کی۔\nامام ترمذی کہتے ہیں: رات کی صلاۃ کے سلسلے میں نبی اکرمﷺ سے زیادہ سے زیادہ وتر کے ساتھ تیرہ رکعتیں مروی ہیں،اورکم سے کم نورکعتیں۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;