var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى الْفَزَارِيُّ،حَدَّثَنَا شَرِيكٌ،عَنْ ثَابِتِ بْنِ أَبِي صَفِيَّةَ،قَالَ: قُلْتُ لأَبِي جَعْفَرٍ: حَدَّثَكَ جَابِرٌ أَنَّ النَّبِيَّ ﷺ تَوَضَّأَ مَرَّةً مَرَّةً،وَمَرَّتَيْنِ مَرَّتَيْنِ،وَثَلاَثًا ثَلاَثًا. قَالَ نَعَمْ.";
tirmizi.urdu = "ابوحمزہ ثابت بن ابی صفیہ ثمالی کہتے ہیں کہ میں نے ابوجعفرسے پوچھا:کیا جابر رضی اللہ عنہما نے آپ سے یہ بیان کیا ہے کہ نبی اکرم ﷺ نے اعضائے وضو ایک ایک بار،دودوبار،اورتین تین بار دھوئے ہیں؟ تو انہوں نے کہا: ہاں (بیان کیا ہے)۔";
tirmizi.hukam = "";
tirmizi.description = `[45۔46] أن النبي ﷺ توضأ مرۃ مرۃ
إسنادہ ضعیف جدًا / جہ 410   باب فی الوضوء مرۃ ومرتین وثلاثًا
ثابت بن أبي صفیۃ : ضعیف رافضي ( تق : 818) وشریک القاضي عنعن ( یأتي : 112) وحدیث البخاري (157،158،159 ) یغني عن ھذا الحدیث۔`;
tirmizi.anwaar = [190,1];