var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ قَالَ الْوِتْرُ لَيْسَ بِحَتْمٍ كَصَلَاتِكُمْ الْمَكْتُوبَةِ وَلَكِنْ سَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ إِنَّ اللَّهَ وِتْرٌ يُحِبُّ الْوِتْرَ فَأَوْتِرُوا يَا أَهْلَ الْقُرْآنِ قَالَ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ وَابْنِ مَسْعُودٍ وَابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں: وترتمہاری فرض صلاۃ کی طرح لازمی نہیں ہے ۱؎،بلکہ رسول اللہﷺ نے اسے سنت قرار دیا اور فرمایا: اللہ وتر(طاق) ۲؎ ہے اوروترکو پسند کرتاہے،اے اہل قرآن! ۳؎ تم وتر پڑھا کرو۔\nامام ترمذی کہتے ہیں: ۱-علی رضی اللہ عنہ کی حدیث حسن ہے،۲-اس باب میں ابن عمر،ابن مسعود اور ابن عباس رضی اللہ عنہم سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[453۔454] إن اللّٰہ وتر یحب الوتر
إسنادہ ضعیف/ د 1416،ن 1676،جہ 1169    باب ما جاء في أن الوتر لیس بحتم
أبو إسحاق عنعن۔( تقدم : 107) و روی أحمد ( 1/ 107 ح 842 ) بسند حسن عن علي رضي اللّٰہ عنہ قال : ’’ لیس الوتر بحتم کالصلاۃ ولکنہ سنۃ فلا تدعوہ۔۔۔و قد أوتر رسول اللّٰہ ﷺ ‘‘ وھو یغني عنہ۔`;
tirmizi.anwaar = [201,1];