var tirmizi = {};
tirmizi.arabic = "وَرَوَى سُفْيَانُ الثَّوْرِيُّ وَغَيْرُهُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ قَالَ الْوِتْرُ لَيْسَ بِحَتْمٍ كَهَيْئَةِ الصَّلَاةِ الْمَكْتُوبَةِ وَلَكِنْ سُنَّةٌ سَنَّهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا بِذَلِكَ مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ وَهَذَا أَصَحُّ مِنْ حَدِيثِ أَبِي بَكْرِ بْنِ عَيَّاشٍ وَقَدْ رَوَاهُ مَنْصُورُ بْنُ الْمُعْتَمِرِ عَنْ أَبِي إِسْحَقَ نَحْوَ رِوَايَةِ أَبِي بَكْرِ بْنِ عَيَّاشٍ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں: وتر لازم نہیں ہے جیسا کہ فرض صلاۃ کا معاملہ ہے،بلکہ یہ رسول اللہﷺ کی سنت ہے،اسے سفیان ثوری وغیرہ نے بطریق أبی اسحاق عن عاصم بن حمزۃ عن علی روایت کیاہے ۱؎ اوریہ روایت ابوبکربن عیاش کی روایت سے زیادہ صحیح ہے اوراسے منصوربن معتمر نے بھی ابواسحاق سے ابوبکر بن عیاش ہی کی طرح روایت کیا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔454] إن اللّٰہ وتر یحب الوتر
إسنادہ ضعیف/ د 1416،ن 1676،جہ 1169    باب ما جاء في أن الوتر لیس بحتم
أبو إسحاق عنعن۔( تقدم : 107) و روی أحمد ( 1/ 107 ح 842 ) بسند حسن عن علي رضي اللّٰہ عنہ قال : ’’ لیس الوتر بحتم کالصلاۃ ولکنہ سنۃ فلا تدعوہ۔۔۔و قد أوتر رسول اللّٰہ ﷺ ‘‘ وھو یغني عنہ۔`;
tirmizi.anwaar = [201,1];