var tirmizi = {};
tirmizi.arabic = "وَرَوَى وَكِيعٌ هَذَا الْحَدِيثَ عَنْ ثَابِتِ بْنِ أَبِي صَفِيَّةَ قَالَ: قُلْتُ لأَبِي جَعْفَرٍ: حَدَّثَكَ جَابِرٌ أَنَّ النَّبِيَّ ﷺ تَوَضَّأَ مَرَّةً مَرَّةً؟ قَالَ: نَعَمْ. و حَدَّثَنَا بِذَلِكَ هَنَّادٌ وَقُتَيْبَةُ قَالاَ: حَدَّثَنَا وَكِيعٌ،عَنْ ثَابِتِ بْنِ أَبِي صَفِيَّة. قَالَ أَبُو عِيسَى: وَهَذَا أَصَحُّ مِنْ حَدِيثِ شَرِيكٍ،لأَنَّهُ قَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ هَذَا عَنْ ثَابِتٍ نَحْوَ رِوَايَةِ وَكِيعٍ. وَشَرِيكٌ كَثِيرُ الْغَلَطِ. وَثَابِتُ بْنُ أَبِي صَفِيَّةَ هُوَ أَبُو حَمْزَةَ الثُّمَالِيُّ.";
tirmizi.urdu = "یہ حدیث وکیع نے ثابت بن ابی صفیہ سے روایت کی ہے،میں نے ابوجعفر (محمد بن علی بن حسین الباقر) سے پوچھاکہ آپ سے جابر رضی اللہ عنہما نے یہ بیان کیا ہے کہ نبی اکرم ﷺ نے اعضائے وضو کو ایک بار دھودیا،انہوں نے جواب دیا: ہاں،۱-اوریہ شریک کی روایت سے زیادہ صحیح ہے کیوں کہ یہ ثابت سے وکیع کی روایت کی طرح اوربھی کئی سندوں سے مروی ہے،۲-اور شریک کثیرالغلط راوی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `۔46] أن النبي ﷺ توضأ مرۃ مرۃ
إسنادہ ضعیف جدًا / جہ 410   باب فی الوضوء مرۃ ومرتین وثلاثًا
ثابت بن أبي صفیۃ : ضعیف رافضي ( تق : 818) وشریک القاضي عنعن ( یأتي : 112) وحدیث البخاري (157،158،159 ) یغني عن ھذا الحدیث۔`;
tirmizi.anwaar = [190,1];