var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبِ بْنِ الشَّهِيدِ الْبَصْرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْحَرَّانِيُّ عَنْ خُصَيْفٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ قَالَ سَأَلْنَا عَائِشَةَ بِأَيِّ شَيْءٍ كَانَ يُوتِرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ يَقْرَأُ فِي الْأُولَى بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَفِي الثَّانِيَةِ بِقُلْ يَا أَيُّهَا الْكَافِرُونَ وَفِي الثَّالِثَةِ بِقُلْ هُوَ اللَّهُ أَحَدٌ وَالْمُعَوِّذَتَيْنِ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ قَالَ وَعَبْدُ الْعَزِيزِ هَذَا هُوَ وَالِدُ ابْنِ جُرَيْجٍ صَاحِبِ عَطَاءٍ وَابْنُ جُرَيْجٍ اسْمُهُ عَبْدُ الْمَلِكِ بْنُ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ وَقَدْ رَوَى يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ هَذَا الْحَدِيثَ عَنْ عَمْرَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
tirmizi.urdu = "عبدالعزیز بن جریج کہتے ہیں کہ ہم نے عائشہ رضی اللہ عنہا سے پوچھا: رسول اللہﷺ وتر میں کیا پڑھتے تھے؟ توانہوں نے کہا:پہلی رکعت میں سَبِّحِ اسْمَ رَبِّکَ الأَعْلَی،دوسری میںقُلْ یَاأَیُّہَا الْکَافِرُونَ،اور تیسری میںقُلْ ہُوَ اللہُ أَحَدٌ اور معوذتین ۱؎ پڑھتے تھے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن غریب ہے،۲-یہ عبدالعزیزراویٔ اثرعطاء کے شاگرد ابن جریج کے والدہیں،اورابن جریج کانام عبدالملک بن عبدالعزیز بن جریج ہے،۳-یحییٰ بن سعید انصاری نے یہ حدیث بطریق: عمرۃ،عن عائشہ،عن النبی اکرمﷺ روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[463] کان یقرأ فی الأولٰی
إسنادہ ضعیف/ د 1424 جہ 1173 [بل ھو حدیث حسن ]  باب ما جاء ما یقرأ فی الوتر
------------
معاذ علی زئی:
خصیف ضعیف،ضعفہ الجمہور،وللحدیث شواھد دون قولہ: ’’والمعوذتین‘‘۔انظر مشکوۃ المصابیح (1/ 420 ح 1269)`;
tirmizi.anwaar = [201,1];