var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ عَنْ مَيْمُونِ بْنِ مُوسَى الْمَرَئِيِّ عَنْ الْحَسَنِ عَنْ أُمِّهِ عَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْوِتْرِ رَكْعَتَيْنِ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ نَحْوُ هَذَا عَنْ أَبِي أُمَامَةَ وَعَائِشَةَ وَغَيْرِ وَاحِدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
tirmizi.urdu = "ام المومنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرمﷺ وتر کے بعد دورکعتیں پڑھتے تھے ۱؎۔\nامام ترمذی کہتے ہیں: ابوامامہ،عائشہ رضی اللہ عنہما اوردیگرکئی لوگوں سے بھی نبی اکرمﷺ سے اسی طرح مروی ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = `مشکوۃ المصابیح: 1284`;