var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الْبَصْرِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ نَهَّاسِ بْنِ قَهْمٍ عَنْ شَدَّادٍ أَبِي عَمَّارٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَافَظَ عَلَى شُفْعَةِ الضُّحَى غُفِرَ لَهُ ذُنُوبُهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ قَالَ أَبُو عِيسَى وَقَدْ رَوَى وَكِيعٌ وَالنَّضْرُ بْنُ شُمَيْلٍ وَغَيْرُ وَاحِدٍ مِنْ الْأَئِمَّةِ هَذَا الْحَدِيثَ عَنْ نَهَّاسِ بْنِ قَهْمٍ وَلَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِهِ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا: 'جس نے چاشت کی دو رکعتوں کی محافظت کی،اس کے گناہ بخش دئے جائیں گے،اگرچہ وہ سمند ر کے جھاگ کے برابرہوں'۔\nامام ترمذی کہتے ہیں: وکیع،نضربن شمیل اوردوسرے کئی ائمہ نے یہ حدیث نہاس بن قہم سے روایت کی ہے۔اور ہم نہاس کو صرف ان کی اسی حدیث سے جانتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[476] من حافظ علی شفعۃ الضحی
إسنادہ ضعیف / جہ 1382   باب ما جاء في صلوۃ الضحی
نھاس : ضعیف ( د 1791) `;
tirmizi.anwaar = [201,1];