var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ الْبَغْدَادِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى حَتَّى نَقُولَ لَا يَدَعُ وَيَدَعُهَا حَتَّى نَقُولَ لَا يُصَلِّي قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "ابوسعید خدری رضی اللہ عنہ کہتے ہیں: نبی اکرمﷺ چاشت کی صلاۃ پڑھتے تھے۔یہاں تک کہ ہم کہتے کہ آپ اسے نہیں چھوڑیں گے،اور آپ اسے چھوڑدیتے یہاں تک کہ ہم کہتے کہ اب اسے نہیں پڑھیں گے۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[477] کان یصلی الضحی حتی نقول لا یدع
إسنادہ ضعیف باب ما جاء في صلوۃ الضحی
عطیۃ العوفي ضعیف مدلس ( د 452 )`;
tirmizi.anwaar = [201,1];