var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ كَانَ إِذَا صَلَّى الْجُمُعَةَ انْصَرَفَ فَصَلَّى سَجْدَتَيْنِ فِي بَيْتِهِ ثُمَّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ ذَلِكَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "نافع سے روایت ہے ابن عمر رضی اللہ عنہما جب جمعہ پڑھ لیتے تو(گھر) واپس آتے اور دورکعت اپنے گھر میں پڑھتے پھرکہتے رسول اللہﷺ ایساہی کرتے تھے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = `مشکوۃ المصابیح: 1187`;