var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ الْكُوفِيُّ،حَدَّثَنَا أَبُو يَحْيَى إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ،عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ،عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى،عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: قَالَ رَسُولُ اللهِ ﷺ:حَقٌّ عَلَى الْمُسْلِمِينَ أَنْ يَغْتَسِلُوا يَوْمَ الْجُمُعَةِ،وَلْيَمَسَّ أَحَدُهُمْ مِنْ طِيبِ أَهْلِهِ،فَإِنْ لَمْ يَجِدْ فَالْمَاءُ لَهُ طِيبٌ. قَالَ: وَفِي الْبَاب عَنْ أَبِي سَعِيدٍ،وَشَيْخٍ مِنْ الأَنْصَارِ";
tirmizi.urdu = "براء بن عازب رضی اللہ عنہما کہتے ہیں کہ رسول اللہ ﷺ نے فرمایا:' مسلمانوں پر لازم ہے کہ وہ جمعہ کے دن غسل کریں اورہرایک اپنے گھروالوں کی خوشبو میں سے خوشبولگائے،اگراسے خوشبو میسرنہ ہوتو پانی ہی اس کے لیے خوشبو ہے'۔اس باب میں ابوسعید رضی اللہ عنہ اور ایک انصاری شیخ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[528۔529] حقًا علی المسلمین أن یغتسلوا یوم الجمعۃ
إسنادہ ضعیف باب ما جاء فی السواک والطیب یوم الجمعۃ
یزید بن أبي زیاد ضعیف مدلس وعنعن ( تقدم: 114) `;
tirmizi.anwaar = [203,1];