var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ،حَدَّثَنَا هُشَيْمٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ بِهَذَا الإِسْنَادِ: نَحْوَهُ.\nقَالَ أَبُو عِيسَى: حَدِيثُ الْبَرَاءِ حَدِيثٌ حَسَنٌ،وَرِوَايَةُ هُشَيْمٍ أَحْسَنُ مِنْ رِوَايَةِ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ،وَإِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ يُضَعَّفُ فِي الْحَدِيثِ";
tirmizi.urdu = "اس سند سے بھی اسی طرح مروی ہے۔\nامام ترمذی کہتے ہیں: ۱-براء رضی اللہ عنہ کی حدیث حسن ہے،۲-ہشیم کی روایت(رقم۵۲۹) اسماعیل بن ابراہیم تیمی کی روایت (رقم۵۲۸) سے زیادہ اچھی ہے،۳-اسماعیل بن ابراہیم تیمی کو حدیث کے سلسلے میں ضعیف گرداناجاتاہے ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `۔529] حقًا علی المسلمین أن یغتسلوا یوم الجمعۃ
إسنادہ ضعیف باب ما جاء فی السواک والطیب یوم الجمعۃ
یزید بن أبي زیاد ضعیف مدلس وعنعن ( تقدم: 114) `;
tirmizi.anwaar = [203,1];