var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى الْفَزَارِيُّ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ مِنْ السُّنَّةِ أَنْ تَخْرُجَ إِلَى الْعِيدِ مَاشِيًا وَأَنْ تَأْكُلَ شَيْئًا قَبْلَ أَنْ تَخْرُجَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ أَنْ يَخْرُجَ الرَّجُلُ إِلَى الْعِيدِ مَاشِيًا وَأَنْ يَأْكُلَ شَيْئًا قَبْلَ أَنْ يَخْرُجَ لِصَلَاةِ الْفِطْرِ قَالَ أَبُو عِيسَى وَيُسْتَحَبُّ أَنْ لَا يَرْكَبَ إِلَّا مِنْ عُذْرٍ";
tirmizi.urdu = "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ عید کے لیے پیدل جانا اور نکلنے سے پہلے کچھ کھالینا سنت ہے۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن ہے،۲-اکثر اہل علم کااسی حدیث پرعمل ہے وہ مستحب سمجھتے ہیں کہ آدمی عید کے لیے پیدل جائے اور عید الفطرکی صلاۃ کے لیے نکلنے سے پہلے کچھ کھالے،۳-مستحب یہ ہے کہ آدمی بلاعذر سوار ہوکرنہ جائے۔";
tirmizi.hukam = "";
tirmizi.description = `[530] من السنۃ أن تخرج إلی العید ماشیًا
ضعیف / جہ 1296  باب فی المشي یوم العید
فیہ علل منھا ضعف الحارث الأعور( تقدم: 282) وعنعنۃ أبي إسحاق وشریک القاضي ( تقدما : 107،112) وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [203,1];