var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدِ بْنِ جُدْعَانَ الْقُرَشِيُّ عَنْ أَبِي نَضْرَةَ قَالَ سُئِلَ عِمْرَانُ بْنُ حُصَيْنٍ عَنْ صَلَاةِ الْمُسَافِرِ فَقَالَ حَجَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَكْعَتَيْنِ وَحَجَجْتُ مَعَ أَبِي بَكْرٍ فَصَلَّى رَكْعَتَيْنِ وَمَعَ عُمَرَ فَصَلَّى رَكْعَتَيْنِ وَمَعَ عُثْمَانَ سِتَّ سِنِينَ مِنْ خِلَافَتِهِ أَوْ ثَمَانِيَ ثَمَانِي فَصَلَّى رَكْعَتَيْنِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ";
tirmizi.urdu = "ابونضرہ سے روایت ہے کہ عمران بن حصین رضی اللہ عنہ سے مسافر کی صلاۃ کے بارے میں پوچھا گیا تو انہوں نے کہا: میں نے رسول اللہﷺ کے ساتھ حج کیا تو آپ نے دوہی رکعتیں پڑھیں،اورمیں نے ابوبکر رضی اللہ عنہ کے ساتھ حج کیا تو انہوں نے بھی دوہی رکعتیں پڑھیں،اور عمر رضی اللہ عنہ کے ساتھ کیا تو انہوں نے بھی دوہی رکعتیں پڑھیں،اور عثمان رضی اللہ عنہ کے ساتھ ان کی خلافت کے ابتدائی چھ یاآٹھ سالوں میں کیا تو انہوں نے بھی دوہی رکعتیں پڑھیں۔\nامام ترمذی کہتے ہیں: یہ حدیث صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[545] حججت مع رسول اللّٰہ ﷺ فصلّی رکعتین
إسنادہ ضعیف/ د 1229 باب ما جاء فی التقصیر فی السفر`;
tirmizi.anwaar = [203,1];