var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ سَمِعَا أَنَسَ بْنَ مَالِكٍ قَالَ صَلَّيْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا وَبِذِي الْحُلَيْفَةِ الْعَصْرَ رَكْعَتَيْنِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ ہم نے نبی اکرمﷺ کے ساتھ مدینہ میں چار رکعتیں پڑھیں ۱؎ اور ذی الحلیفہ ۲؎ میں دورکعتیں پڑھیں۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;