var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْحَجَّاجِ عَنْ عَطِيَّةَ عَنْ ابْنِ عُمَرَ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ فِي السَّفَرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رَوَاهُ ابْنُ أَبِي لَيْلَى عَنْ عَطِيَّةَ وَنَافِعٍ عَنْ ابْنِ عُمَرَ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ میں نے نبی اکرمﷺ کے ساتھ سفر میں ظہر کی دورکعتیں پڑھیں اور اس کے بعد دورکعتیں۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن ہے،۲-ابن ابی لیلیٰ نے یہ حدیث عطیہ اور نافع سے روایت کی ہے اور ان دونوں نے ابن عمر سے۔";
tirmizi.hukam = "";
tirmizi.description = `[551] صلیت مع النبيﷺ الظھر فی السفر
إسنادہ ضعیف باب ما جاء فی التطوع فی السفر
عطیۃ العوفي : ضعیف ( تقدم : 477) `;
tirmizi.anwaar = [204,1];