var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا عَبْدُاللهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ سَعِيدِ ابْنِ أَبِي هِلاَلٍ عَنْ عُمَرَ الدِّمَشْقِيِّ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَالَ: سَجَدْتُ مَعَ رَسُولِ اللهِ ﷺ إِحْدَى عَشْرَةَ سَجْدَةً مِنْهَا الَّتِي فِي النَّجْمِ";
tirmizi.urdu = "ابوالدرداء رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہﷺ کے ساتھ گیارہ سجدے کئے۔ان میں سے ایک وہ تھا جو سورۂ نجم میں ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[568۔569] سجدت مع رسول اللّٰہ ﷺ إحدی عشرۃ سجدۃ
إسنادہ ضعیف / جہ 1055   باب ما جاء في سجود القرآن
عمر الدمشقي : مجہول (تق: 4886) وبینہ وبین أم الدرداء رجل مجہول،انظر الحدیث الآتي: 569۔`;
tirmizi.anwaar = [204,1];