var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ حَدَّثَنَا سَلَمَةُ بْنُ الْفَضْلِ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ حُمَيْدٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَوَضَّأُ لِكُلِّ صَلَاةٍ طَاهِرًا أَوْ غَيْرَ طَاهِرٍ قَالَ قُلْتُ لِأَنَسٍ فَكَيْفَ كُنْتُمْ تَصْنَعُونَ أَنْتُمْ قَالَ كُنَّا نَتَوَضَّأُ وُضُوءًا وَاحِدًا قَالَ أَبُو عِيسَى وَحَدِيثُ حُمَيْدٍ عَنْ أَنَسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَالْمَشْهُورُ عَنْدَ أَهْلِ الْحَدِيثِ حَدِيثُ عَمْرِو بْنِ عَامِرٍ الْأَنْصَارِيِّ عَنْ أَنَسٍ وَقَدْ كَانَ بَعْضُ أَهْلِ الْعِلْمِ يَرَى الْوُضُوءَ لِكُلِّ صَلَاةٍ اسْتِحْبَابًا لَا عَلَى الْوُجُوبِ";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں: نبی اکرم ﷺ ہر صلاۃ کے لیے وضوکرتے باوضوہوتے یابے وضو۔حمید کہتے ہیں کہ میں نے انس رضی اللہ عنہ سے پوچھا: آپ لوگ کیسے کرتے تھے؟ تو انہوں نے کہا کہ ہم ایک ہی وضوکرتے تھے ۱؎۔\nامام ترمذی کہتے ہیں: حمید کی حدیث بواسطہ انس اس سندسے غریب ہے،اور محدثین کے نزدیک مشہور عمرو بن عامروالی حدیث ہے جوبواسطہ انس مروی ہے،اوربعض اہل علم ۲؎ کی رائے ہے کہ ہرصلاۃ کے لیے وضومستحب ہے نہ کہ واجب۔";
tirmizi.hukam = "";
tirmizi.description = `[58] أن النبی ﷺ کان یتوضأ لکل صلاۃ
إسنادہ ضعیف باب ما جاء فی الوضوء لکل صلاۃ
محمد بن حمید بن حیان الرازي ضعیف ضعفہ الجمھور۔۔۔۔۔وابن إسحاق مدلس (۔۔۔۔۔د 292) وعنعن إن صح السند إلیہ والحدیث الآتي (الأصل :60 ) یغني عنہ۔`;
tirmizi.anwaar = [191,1];