var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي الْعَالِيَةِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي سُجُودِ الْقُرْآنِ بِاللَّيْلِ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "-ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہﷺرات کے وقت قرآن کے سجدوں کہتے: 'سَجَدَ وَجْہِی لِلَّذِی خَلَقَہُ وَشَقَّ سَمْعَہُ وَبَصَرَہُ بِحَوْلِہِ وَقُوَّتِہِ'(میرے چہرے نے اس ذات کو سجدہ کیا ہے جس نے اسے بنایا،اور اپنی طاقت وقوت سے ا س کے کان اوراس کی آنکھیں پھاڑیں)۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[580] سجد وجھي للذي خلقہ
إسنادہ ضعیف/ د 1414،ن 1130ویأتي : 3425    باب ما جاء ما یقول في سجود القرآن`;
tirmizi.anwaar = [204,1];