var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ حَدَّثَنَا وَكِيعٌ عَنْ عَبْدِاللهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ بَعْضِ أَصْحَابِ عِكْرِمَةَ: أَنَّ النَّبِيَّ ﷺ كَانَ يَلْحَظُ فِي الصَّلاَةِ فَذَكَرَ نَحْوَهُ.\nقَالَ: وَفِي الْبَاب عَنْ أَنَسٍ،وَعَائِشَةَ";
tirmizi.urdu = "عکرمہ کے ایک شاگرد سے روایت ہے کہ نبی اکرمﷺ صلاۃ میں ترچھی نظرسے دیکھتے تھے۔آگے انہوں نے اسی طرح کی حدیث ذکرکی۔\nامام ترمذی کہتے ہیں: اس باب میں انس اورام المومنین عائشہ رضی اللہ عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "حسن";
tirmizi.description = ``;