var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو حَاتِمٍ مُسْلِمُ بْنُ حَاتِمٍ الْبَصْرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ قَالَ قَالَ أَنَسُ بْنُ مَالِكٍ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بُنَيَّ إِيَّاكَ وَالِالْتِفَاتَ فِي الصَّلَاةِ فَإِنَّ الِالْتِفَاتَ فِي الصَّلَاةِ هَلَكَةٌ فَإِنْ كَانَ لَا بُدَّ فَفِي التَّطَوُّعِ لَا فِي الْفَرِيضَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ مجھ سے رسول اللہﷺ نے فرمایا: 'اے میرے بیٹے! صلاۃ میں اِدھر اُدھر (گردن موڑکر) دیکھنے سے بچو،صلاۃ میں گردن موڑ کر اِدھر اُدھر دیکھنا ہلاکت ہے،اگردیکھناضروری ہی ٹھہرے تو نفل صلاۃ میں دیکھو،نہ کہ فرض میں'۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[589] یا بنيّ! إیاک والإلتفات فی الصلاۃ
إسنادہ ضعیف باب ما ذکر فی الإلتفات فی الصلوۃ
علي بن زید بن جدعان : ضعیف ( د 54) `;
tirmizi.anwaar = [204,1];