var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ هُوَ ابْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدٍ عَنْ عَمْرِو بْنِ عَامِرٍ الْأنْصَارِيِّ قَال سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ عِنْدَ كُلِّ صَلَاةٍ قُلْتُ فَأَنْتُمْ مَا كُنْتُمْ تَصْنَعُونَ قَالَ كُنَّا نُصَلِّي الصَّلَوَاتِ كُلَّهَا بِوُضُوءٍ وَاحِدٍ مَا لَمْ نُحْدِثْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَحَدِيثُ حُمَيْدٍ عَنْ أَنَسٍ حَدِيثٌ جَيِّدٌ غَرِيبٌ حَسَنٌ";
tirmizi.urdu = "عمروبن عامرانصاری کہتے ہیں کہ میں نے انس بن مالک کو یہ کہتے ہوئے سنا: نبی اکرم ﷺ ہر صلاۃ کے لئے وضو کرتے تھے،میں نے(انس سے) پوچھا: پھر آپ لوگ کیسے کرتے تھے؟ تو انہوں نے کہا کہ جب تک ہم حدث نہ کرتے ساری صلاتیں ایک ہی وضو سے پڑھتے تھے۔\nامام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-اور حمید کی حدیث جو انس سے مروی ہے جید غریب حسن ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[59] من توضأ علی طھر کتب اللّٰہ لہ
إسنادہ ضعیف/ د 62،جہ 512   باب ما جاء فی الوضوء لکل صلاۃ`;
tirmizi.anwaar = [191,1];