var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الِالْتِفَاتِ فِي الصَّلَاةِ قَالَ هُوَ اخْتِلَاسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنْ صَلَاةِ الرَّجُلِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہﷺ سے صلاۃ میں اِدھر اُدھر (گردن موڑکر) دیکھنے کے بارے میں پوچھا تو آپ نے کہا:' یہ تو اچک لینا ہے،شیطان آدمی کی صلاۃ اچک لیتاہے'۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "صحیح بخاری";
tirmizi.description = ``;