var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ: أَنْ النَّبِيَّ ﷺ أَمَرَ فَذَكَرَ نَحْوَهُ. و قَالَ سُفْيَانُ: قَوْلُهُ بِبِنَاءِ الْمَسَاجِدِ فِي الدُّورِ يَعْنِي الْقَبَائِلَ";
tirmizi.urdu = "اس سند سے بھی ہشام بن عروہ نے اپنے باپ عروہ سے روایت کی ہے کہ نبی اکرمﷺ نے حکم دیا،آگے اسی طرح کی حدیث انہوں نے ذکرکی۔\nسفیان کہتے ہیں:دُوریامحلوں میں مسجدیں بنانے سے مراد قبائل میں مسجدیں بنانا ہے";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;