var tirmizi = {};
tirmizi.arabic = "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ،حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ،عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ،عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ ﷺ كَانَ إِذَا دَخَلَ الْخَلاَءَ قَالَ: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْخُبُثِ وَالْخَبَائِثِ . قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ۔";
tirmizi.urdu = "انس بن مالک کہتے ہیں کہ نبی اکرم ﷺ جب قضائے حاجت کے لئے بیت الخلاء میں داخل ہوتے تو پڑھتے:'اللَّہُمَّ إِنِّی أَعُوذُ بِکَ مِنْ الْخُبُثِ وَالْخَبَائِثِ' (اے اللہ میں تیری پناہ چاہتاہوں ناپاک جنوں اور ناپاک جنیوں سے) ۱؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;