var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا قَبِيصَةُ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ عَطَاءٍ الْخُرَاسَانِيِّ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ عَمَّارٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلْجُنُبِ إِذَا أَرَادَ أَنْ يَأْكُلَ أَوْ يَشْرَبَ أَوْ يَنَامَ أَنْ يَتَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عمار رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے جنبی کو جب وہ کھانا،پینا اور سوناچاہے اس بات کی رخصت دی کہ وہ اپنی صلاۃ کے وضو کی طرح وضو کرلے۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے ۱ ؎۔";
tirmizi.hukam = "";
tirmizi.description = `[613] أن النبي ﷺ رخص للجنب
إسنادہ ضعیف/ د 225  باب ما ذکر فی الرخصۃ للجنب فی الأکل والنوم إذا توضأ`;
tirmizi.anwaar = [205,1];