var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا هَارُونُ بْنُ صَالِحٍ الطَّلْحِيُّ الْمَدَنِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اسْتَفَادَ مَالًا فَلَا زَكَاةَ عَلَيْهِ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ عِنْدَ رَبِّهِ وَفِي الْبَاب عَنْ سَرَّاءَ بِنْتِ نَبْهَانَ الْغَنَوِيَّةِ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہﷺ نے فرمایا: 'جسے کوئی مال حاصل ہوتواس پر کوئی زکاۃ نہیں جب تک کہ اس پر اس کے مالک کے یہاں ایک سال نہ گزرجائے'۔\nامام ترمذی کہتے ہیں: اس باب میں سرّا ء بنت نبھان غنویہ رضی اللہ عنہا سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[631] من استفاد مالًا
إسنادہ ضعیف جدًا    باب ما جاء لازکاۃ علی المال المستفاد حتی یحول علیہ الحول
عبد الرحمن بن زید بن أسلم : ضعیف ( تق : 3865) و قال الھیثمي : و الأکثر علی تضعیفہ ( مجمع الزوائد 21/1 ) و قال ابن الملقن : ضعفہ الجمھور ( خلاصۃ البدر المنیر : 11 ) وقال الحاکم : ’’ روی عن أبیہ أحادیث موضوعۃ،لا یخفی علی من تأملھا من أھل الصنعۃ أن الحمل فیھا علیہ ‘‘ (المدخل إلی الصحیح ص154) فھو ضعیف جدًا فیما یرویہ عن أبیہ وللحدیث شواھد ضعیفۃ۔و کان ابن عمر یقول: لا تجب في مال زکوۃ حتی یحول علیہ الحول ( الموطأ 246/1 ح 584) و سندہ صحیح وانظر سنن الترمذي (632)`;
tirmizi.anwaar = [205,1];