var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ أَكْثَمَ،حَدَّثَنَا جَرِيرٌ،عَنْ قَابُوسَ بْنِ أَبِي ظَبْيَانَ،عَنْ أَبِيهِ،عَنْ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللهِ ﷺ:لاَ تَصْلُحُ قِبْلَتَانِ فِي أَرْضٍ وَاحِدَةٍ وَلَيْسَ عَلَى الْمُسْلِمِينَ جِزْيَةٌ.";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہﷺ نے فرمایا: 'ایک سر زمین پردوقبلے ہونادرست نہیں ۱؎ اورنہ ہی مسلمانوں پر جزیہ درست ہے' ۲؎۔";
tirmizi.hukam = "";
tirmizi.description = `[633۔634] لا تصلح قبلتان في أرض واحدۃ
إسنادہ ضعیف / د 3032    باب ما جاء لیس علی المسلمین جزیۃ`;
tirmizi.anwaar = [206,1];