var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ دَاوُدَ،عَنْ الشَّعْبِيِّ،عَنْ جَرِيرٍ عَنْ النَّبِيِّ ﷺ،بِنَحْوِهِ. قَالَ أَبُو عِيسَى: حَدِيثُ دَاوُدَ عَنْ الشَّعْبِيِّ أَصَحُّ مِنْ حَدِيثِ مُجَالِدٍ. وَقَدْ ضَعَّفَ مُجَالِدًا بَعْضُ أَهْلِ الْعِلْمِ وَهُوَ كَثِيرُ الْغَلَطِ";
tirmizi.urdu = "اس سند سے بھی جریر رضی اللہ عنہ کے واسطہ سے نبی اکرمﷺسے اسی طرح مروی ہے۔\nامام ترمذی کہتے ہیں: داود کی شعبی سے روایت کی ہوئی حدیث مجالد کی حدیث سے زیادہ صحیح ہے،مجالد کو بعض اہل علم نے ضعیف گرداناہے وہ کثیر الغلط ہیں یعنی ان سے بکثرت غلطیاں ہوتی ہیں۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;