var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ اغْتَسَلَ بَعْضُ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَفْنَةٍ فَأَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَوَضَّأَ مِنْهُ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ جُنُبًا فَقَالَ إِنَّ الْمَاءَ لَا يُجْنِبُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَمَالِكٍ وَالشَّافِعِيِّ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں: نبی اکرم ﷺ کی ایک بیوی نے ایک لگن (ٹب) سے (پانی لے کر) غسل کیا،رسول اللہﷺ نے اس (بچے ہوئے پانی) سے وضو کرنا چاہا،توانہوں نے عرض کیا: اللہ کے رسول!میں ناپاک تھی،آپ نے فرمایا: پانی جنبی نہیں ہوتا ۱؎۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-یہی سفیان ثوری،مالک اور شافعی کاقول ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[65] إن الماء لا یجنب
إسنادہ ضعیف/ د 68،ن 326،جہ 370    باب ما جاء فی الرخصۃ في ذلک
سماک ضعیف عن عکرمۃ وصحیح الحدیث عن غیرہ إذا حدّث قبل اختلاطہ( انظر ضعیف سنن أبي داود: 68) وحدیث مسلم (323) یغني عنہ۔`;
tirmizi.anwaar = [191,1];