var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ،حَدَّثَنَا يَحْيَى بْنُ آدَمَ،عَنْ عَبْدِالرَّحِيمِ بْنِ سُلَيْمَانَ،نَحْوَهُ. قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "اس سند سے بھی عبدالرحیم بن سلیمان سے اسی طرح مروی ہے۔\nامام ترمذی کہتے ہیں: اس سند سے یہ حدیث غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔654] إن المسألۃ لا تحل لغني
إسنادہ ضعیف باب ما جاء من لا تحل لہ الصدقۃ
مجالد : ضعیف( د 2851) `;
tirmizi.anwaar = [206,1];