var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ مَدُّوَيْهِ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ عَنْ شَرِيكٍ عَنْ أَبِي حَمْزَةَ عَنْ الشَّعْبِيِّ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ سَأَلْتُ أَوْ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الزَّكَاةِ فَقَالَ إِنَّ فِي الْمَالِ لَحَقًّا سِوَى الزَّكَاةِ ثُمَّ تَلَا هَذِهِ الْآيَةَ الَّتِي فِي الْبَقَرَةِ لَيْسَ الْبِرَّ أَنْ تُوَلُّوا وُجُوهَكُمْ الْآيَةَ";
tirmizi.urdu = "فاطمہ بنت قیس رضی اللہ عنہا کہتی ہیں کہ میں نے زکاۃ کے بارے میں پوچھا،یا نبی اکرمﷺسے زکاۃ کے بارے میں پوچھا گیا تو آپ نے فرمایا: ' مال میں زکاۃ کے علاوہ بھی کچھ حق ہے ۱؎ ' پھر آپ نے سورہ بقرہ کی یہ آیت تلاوت فرمائی: لَیْسَ الْبِرَّ أَنْ تُوَلُّوا وُجُوہَکُمْ(نیکی یہ نہیں ہے کہ تم اپنے چہرے پھیرلو) ۲؎ الآیۃ۔";
tirmizi.hukam = "";
tirmizi.description = `[659۔660] إن فی المال لحقًا سوی الزکاۃ
إسنادہ ضعیف / جہ 1789   باب ما جاء أن فی المال حقًا سوی الزکاۃ
أبو حمزۃ میمون الأعور : ضعیف ( تق: 7057) `;
tirmizi.anwaar = [206,2];