var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا مُحَمَّدُ بْنُ الطُّفَيْلِ عَنْ شَرِيكٍ عَنْ أَبِي حَمْزَةَ عَنْ عَامِرٍ الشَّعْبِيِّ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْمَالِ حَقًّا سِوَى الزَّكَاةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِسْنَادُهُ لَيْسَ بِذَاكَ وَأَبُو حَمْزَةَ مَيْمُونٌ الْأَعْوَرُ يُضَعَّفُ وَرَوَى بَيَانٌ وَإِسْمَعِيلُ بْنُ سَالِمٍ عَنْ الشَّعْبِيِّ هَذَا الْحَدِيثَ قَوْلَهُ وَهَذَا أَصَحُّ";
tirmizi.urdu = "فاطمہ بنت قیس رضی اللہ عنہا سے روایت ہے کہ نبی اکرمﷺنے فرمایا: 'مال میں زکاۃ کے علاوہ بھی حقوق ہیں۔\nامام ترمذی کہتے ہیں:۱-اس حدیث کی سند کوئی خاص نہیں ہے ۱؎،۲-ابوحمزہ میمون الاعور کو ضعیف گرداناجاتا ہے،۳-بیان اور اسماعیل بن سالم نے یہ حدیث شعبی سے روایت کی ہے اوراسے شعبی ہی کا قول قراردیا ہے اوریہی زیادہ صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔660] إن فی المال لحقًا سوی الزکاۃ
إسنادہ ضعیف / جہ 1789   باب ما جاء أن فی المال حقًا سوی الزکاۃ
أبو حمزۃ میمون الأعور : ضعیف ( تق: 7057) `;
tirmizi.anwaar = [206,2];