var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الصَّوْمِ أَفْضَلُ بَعْدَ رَمَضَانَ فَقَالَ شَعْبَانُ لِتَعْظِيمِ رَمَضَانَ قِيلَ فَأَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ صَدَقَةٌ فِي رَمَضَانَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَصَدَقَةُ بْنُ مُوسَى لَيْسَ عِنْدَهُمْ بِذَاكَ الْقَوِيِّ";
tirmizi.urdu = "انس رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺسے پوچھا گیاـ: رمضان کے بعد کون سا صوم افضل ہے؟ آپ نے فرمایا: 'شعبان کے صیام جو رمضان کی تعظیم کے لیے ہوں'،پوچھا گیا: کون سا صدقہ افضل ہے؟ فرمایا: 'رمضان میں صدقہ کرنا'۔امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،۲-صدقہ بن موسیٰ محدثین کے نزدیک زیادہ قوی راوی نہیں ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[663] شعبان لتعظیم رمضان
إسنادہ ضعیف باب ما جاء في فضل الصدقۃ
صدقۃ بن موسی : ضعیف (د 4200 )`;
tirmizi.anwaar = [207,1];