var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ الْبَصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عِيسَى الْخَزَّارُ الْبَصْرِيُّ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ الْحَسَنِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الصَّدَقَةَ لَتُطْفِئُ غَضَبَ الرَّبِّ وَتَدْفَعُ عَنْ مِيتَةِ السُّوءِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا: 'صدقہ رب کے غصے کو بجھا دیتاہے اور بری موت سے بچاتاہے'۔امام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[664] إن الصدقۃ لتطفئ غضب الرب
إسنادہ ضعیف باب ما جاء في فضل الصدقۃ
عبد اللّٰہ بن عیسی الخزاز : ضعیف ( تق: 3524) والحسن عنعن ( تقدم : 21) وللحدیث شواہد ضعیفۃ۔`;
tirmizi.anwaar = [207,1];