var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ زَكَرِيَّا عَنْ الْحَجَّاجِ بْنِ دِينَارٍ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ حُجَيَّةَ بْنِ عَدِيٍّ عَنْ عَلِيٍّ أَنَّ الْعَبَّاسَ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَعْجِيلِ صَدَقَتِهِ قَبْلَ أَنْ تَحِلَّ فَرَخَّصَ لَهُ فِي ذَلِكَ";
tirmizi.urdu = "علی رضی اللہ عنہ کہتے ہیں کہ عباس رضی اللہ عنہ نے رسول اللہﷺ سے اپنی زکاۃ وقت سے پہلے دینے کے بارے میں پوچھا توآپ نے انہیں اس کی اجازت دی۔";
tirmizi.hukam = "";
tirmizi.description = `[678] أن العباس سأل رسول اللّٰہ ﷺ في تعجیل صدقتہ
إسنادہ ضعیف/ د 1624،جہ 1795    باب ما جاء في تعجیل الزکاۃ`;
tirmizi.anwaar = [207,1];