var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ،حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ،عَنْ الأَوْزَاعِيِّ،عَنْ قُرَّةَ بْنِ عَبْدِالرَّحْمَنِ،عَنْ الزُّهْرِيِّ،عَنْ أَبِي سَلَمَةَ،عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللهِ ﷺ: قَالَ اللهُ عَزَّ وَجَلَّ: أَحَبُّ عِبَادِي إِلَيَّ أَعْجَلُهُمْ فِطْرًا";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا: 'اللہ عزوجل فرماتاہے: مجھے میرے بندوں میں سب سے زیادہ محبوب وہ ہیں جو افطار میں جلدی کرنے والے ہیں ' ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[700۔701] قال اللّٰہ عزوجل: أحب عبادي إلي أعجلھم فطرًا
إسنادہ ضعیف باب ما جاء في تعجیل الإفطار
الزہري عنعن ( تقدم : 440 ) `;
tirmizi.anwaar = [208,1];