var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَبْدُاللهِ بْنُ عَبْدِالرَّحْمَنِ،أَخْبَرَنَا أَبُو عَاصِمٍ وَأَبُو الْمُغِيرَةِ،عَنْ الأَوْزَاعِيِّ بِهَذَا الإِسْنَادِ نَحْوَهُ. قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ";
tirmizi.urdu = "اس سند سے بھی اوزاعی سے اسی طرح مروی ہے۔امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔";
tirmizi.hukam = "";
tirmizi.description = `۔701] قال اللّٰہ عزوجل: أحب عبادي إلي أعجلھم فطرًا
إسنادہ ضعیف باب ما جاء في تعجیل الإفطار
الزہري عنعن ( تقدم : 440 ) `;
tirmizi.anwaar = [208,1];