var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ: تَسَحَّرْنَا مَعَ النَّبِيِّ ﷺ ثُمَّ قُمْنَا إِلَى الصَّلاَةِ قَالَ: قُلْتُ: كَمْ كَانَ قَدْرُ ذَلِكَ قَالَ: قَدْرُ خَمْسِينَ آيَةً";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ زید بن ثابت رضی اللہ عنہ کہتے ہیں: ہم نے نبی اکرمﷺ کے ساتھ سحری کی،پھر ہم صلاۃ کے لیے کھڑے ہوئے،انس کہتے ہیں کہ میں نے پوچھا: اس کی مقدار کتنی تھی؟ ۱؎ انہوں نے کہا: پچاس آیتوں کے (پڑھنے کے) بقدر ۲؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;