var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ سَعِيدِ بْنِ يَزِيدَ أَبِي مَسْلَمَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كُنَّا نُسَافِرُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ فَمَا يَعِيبُ عَلَى الصَّائِمِ صَوْمَهُ وَلَا عَلَى الْمُفْطِرِ إِفْطَارَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ابوسعید خدری رضی اللہ عنہ کہتے ہیں کہ ہم لوگ رسول اللہﷺ کے ساتھ رمضان میں سفر کرتے تونہ آپ صوم رکھنے والے کے صوم رکھنے پر نکیرکرتے اور نہ ہی صوم نہ رکھنے والے کے صوم نہ رکھنے پر۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;