var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ،حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ،عَنْ حَجَّاجِ بْنِ أَرْطَاةَ،عَنْ قَتَادَةَ،عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللهِ ﷺ:مَنْ أَكَلَ أَوْ شَرِبَ نَاسِيًا فَلاَ يُفْطِرْ فَإِنَّمَا هُوَ رِزْقٌ رَزَقَهُ اللهُ";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا: جس نے بھول کرکچھ کھاپی لیا،وہ صوم نہ توڑے،یہ روزی ہے جو اللہ نے اُسے دی ہے' ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;