var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي مَيْسَرَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَاشِرُنِي وَهُوَ صَائِمٌ وَكَانَ أَمْلَكَكُمْ لِإِرْبِهِ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہﷺ صوم کی حالت میں مجھ سے بوس وکنارکرتے تھے،آپ اپنی خواہش پرتم میں سب سے زیادہ کنٹرول رکھنے والے تھے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;