var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ ابْنِ أُمِّ هَانِئٍ عَنْ أُمِّ هَانِئٍ قَالَتْ كُنْتُ قَاعِدَةً عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُتِيَ بِشَرَابٍ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَنِي فَشَرِبْتُ مِنْهُ فَقُلْتُ إِنِّي أَذْنَبْتُ فَاسْتَغْفِرْ لِي فَقَالَ وَمَا ذَاكِ قَالَتْ كُنْتُ صَائِمَةً فَأَفْطَرْتُ فَقَالَ أَمِنْ قَضَاءٍ كُنْتِ تَقْضِينَهُ قَالَتْ لَا قَالَ فَلَا يَضُرُّكِ قَالَ وَفِي الْبَاب عَنْ أَبِي سَعِيدٍ وَعَائِشَةَ";
tirmizi.urdu = "ام ہانی رضی اللہ عنہا کہتی ہیں کہ میں نبی اکرمﷺ کے پاس بیٹھی ہوئی تھی،اتنے میں آپ کے پاس پینے کی کوئی چیز لائی گئی،آپ نے اس میں سے پیا،پھر مجھے دیا تو میں نے بھی پیا۔پھرمیں نے عرض کیا: میں نے گناہ کاکام کرلیاہے۔آپ میرے لیے بخشش کی دعاکردیجئے۔آپ نے پوچھا: کیابات ہے؟میں نے کہا: میں صوم سے تھی اورمیں نے صوم توڑدیاتو آپ نے پوچھا: کیاکوئی قضا کا صوم تھا جسے تم قضا کررہی تھی؟ عرض کیا:نہیں،آپ نے فرمایا:' تو اس سے تمہیں کوئی نقصان ہونے والا نہیں '۔\nامام ترمذی کہتے ہیں: اس باب میں ابوسعیدخدری اورام المومنین عائشہ رضی اللہ عنہما سے بھی احادیث آئی ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[731] وما ذاک ؟
ضعیف    باب ما جاء في إفطار الصائم المتطوع
ھارون بن أم ھانئ مجھول ( تق : 7251 ) وللحدیث شواھد ضعیفۃ۔`;
tirmizi.anwaar = [209,1];