var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عَمَّتِهِ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقَالَ هَلْ عِنْدَكُمْ شَيْءٌ قَالَتْ قُلْتُ لَا قَالَ فَإِنِّي صَائِمٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہﷺ ایک دن میرے پاس آئے اور آپ نے پوچھا: کیا تمہارے پاس کچھ(کھانے کو)ہے میں نے عرض کیا: نہیں،تو آپ نے فرمایا:' تو میں صوم سے ہوں'۔";
tirmizi.hukam = "صحیح مسلم";
tirmizi.description = ``;