var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ ابْنِ عَبَّاسٍ قَالَ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَوْمِ عَاشُورَاءَ يَوْمُ الْعَاشِرِ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي يَوْمِ عَاشُورَاءَ فَقَالَ بَعْضُهُمْ يَوْمُ التَّاسِعِ و قَالَ بَعْضُهُمْ يَوْمُ الْعَاشِرِ وَرُوِيَ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ قَالَ صُومُوا التَّاسِعَ وَالْعَاشِرَ وَخَالِفُوا الْيَهُودَ وَبِهَذَا الْحَدِيثِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ";
tirmizi.urdu = "عبداللہ بن عبا س رضی اللہ عنہما کہتے ہیں کہ رسول اللہﷺ نے دسویں تاریخ کو عاشوراء کا صوم رکھنے کا حکم دیا۔\nامام ترمذی کہتے ہیں:۱-ابن عباس کی حدیث حسن صحیح ہے،۲-اہل علم کا عاشورا ء کے دن کے سلسلے میں اختلاف ہے۔بعض کہتے ہیں:عاشوراء نواں دن ہے اوربعض کہتے ہیں: دسوان دن ۱؎ ابن عباس سے مروی ہے کہ نویں اور دسویں دن کا صوم رکھو اور یہودیوں کی مخالفت کرو۔شافعی،احمد اور اسحاق بن راہویہ کا قول اسی حدیث کے مطابق ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[755] أمر رسول اللّٰہ ﷺ بصوم عاشوراء
إسنادہ ضعیف باب ما جاء في عاشوراء أي یوم ھو ؟
الحسن البصري مدلس وعنعن۔( تقدم : 21)`;
tirmizi.anwaar = [210,1];