var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ أَبِي الرَّبِيعِ عَنْ أَبِي هُرَيْرَةَ قَالَ عَهِدَ إِلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةً أَنْ لَا أَنَامَ إِلَّا عَلَى وِتْرٍ وَصَوْمَ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَأَنْ أُصَلِّيَ الضُّحَى";
tirmizi.urdu = "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺ نے مجھ سے تین باتوں کا عہد لیا: ۱-میں وتر پڑھے بغیر نہ سووں،۲-ہرماہ تین دن کے صیام رکھوں،۳-اور چاشت کی صلاۃ (صلاۃ الضحیٰ) پڑھاکروں۔";
tirmizi.hukam = "إسنادہ حسن";
tirmizi.description = ``;