var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ فَذَلِكَ صِيَامُ الدَّهْرِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ تَصْدِيقَ ذَلِكَ فِي كِتَابِهِ مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا الْيَوْمُ بِعَشْرَةِ أَيَّامٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ أَبِي شِمْرٍ وَأَبِي التَّيَّاحِ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ";
tirmizi.urdu = "ابوذر رضی اللہ عنہ کہتے ہیں کہ رسول اللہﷺ نے فرمایا: 'جس نے ہرماہ تین دن کے صیام رکھے تویہی صیام دہر ہے '،اس کی تصدیق اللہ تعالیٰ نے اپنی کتاب میں نازل فرمائی ارشادباری ہے:مَنْ جَاءَ بِالْحَسَنَۃِ فَلَہُ عَشْرُ أَمْثَالِہَا (الأنعام: ۱۶۰) (جس نے ایک نیکی کی تواُسے (کم سے کم) اس کا دس گنا اجر ملے گا) گویا ایک دن (کم سے کم) دس دن کے برابر ہے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث حسن صحیح ہے،۲-شعبہ نے یہ حدیث بطریق: 'أبی شمر و أبی التیاح،عن أبی ہریرۃ،عن النبی ﷺ ' روایت کی ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[762] من صام من کل شھر ثلاثۃ أیام
إسنادہ ضعیف/ ن 2411،جہ 1708     باب ما جاء في صوم ثلاثۃ أیام من کل شھر
أبو عثمان سمعہ من رجل مجہول عن أبي ذربہ۔`;
tirmizi.anwaar = [210,1];