var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو مُوسَى حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ عَنْ حَبِيبِ بْنِ الشَّهِيدِ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ صَائِمٌ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہما سے کہتے ہیں کہ نبی اکرمﷺنے پچھنا لگوایا،آپ صوم سے تھے۔\nامام ترمذی کہتے ہیں: یہ حدیث اس سند سے حسن غریب ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;