var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ سَعْدِ بْنِ طَرِيفٍ عَنْ عُمَيْرِ بْنِ مَأْمُونٍ عَنْ الْحَسَنِ بْنِ عَلِيٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُحْفَةُ الصَّائِمِ الدُّهْنُ وَالْمِجْمَرُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَيْسَ إِسْنَادُهُ بِذَاكَ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ سَعْدِ بْنِ طَرِيفٍ وَسَعْدُ بْنُ طَرِيفٍ يُضَعَّفُ وَيُقَالُ عُمَيْرُ بْنُ مَأْمُومٍ أَيْضًا";
tirmizi.urdu = "حسن بن علی رضی اللہ عنہا کہتے ہیں کہ رسول اللہﷺ نے فرمایا: 'صائم کا تحفہ خوشبودارتیل اور عود کی انگیٹھی ہے'۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-اس کی سند قوی نہیں ہے،۳-ہم اسے صرف سعدبن طریف کی روایت سے جانتے ہیں،اور ۴-سعد بن طریف ضعیف قراردیے جاتے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[801] تحفۃ الصائم الدھن والمجمر
إسنادہ ضعیف جدًا    باب ما جاء في تحفۃ الصائم
سعد بن طریف : متروک ورماہ ابن حبان بالوضع وکان رافضیًا ( تق: 7343) وعمیر : ضعیف (التحریر : 5187) `;
tirmizi.anwaar = [210,1];