var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ ابْنِ عُمَرَ قَالَ الْبَيْدَاءُ الَّتِي يَكْذِبُونَ فِيهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ مَا أَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ عِنْدِ الْمَسْجِدِ مِنْ عِنْدِ الشَّجَرَةِ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہا کہتے ہیں: بیداء جس کے بارے میں لوگ رسول اللہﷺ پرجھوٹ باندھتے ہیں (کہ وہاں سے احرام باندھا) ۱؎ اللہ کی قسم! رسو ل اللہ ﷺ نے مسجد (ذی الحلیفہ) کے پاس درخت کے قریب تلبیہ پکارا ۲؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;