var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ خُصَيْفٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهَلَّ فِي دُبُرِ الصَّلَاةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُ أَحَدًا رَوَاهُ غَيْرَ عَبْدِ السَّلَامِ بْنِ حَرْبٍ وَهُوَ الَّذِي يَسْتَحِبُّهُ أَهْلُ الْعِلْمِ أَنْ يُحْرِمَ الرَّجُلُ فِي دُبُرِ الصَّلَاةِ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہا کہتے ہیں کہ نبی اکرمﷺ نے صلاۃ کے بعداحرام باندھا۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن غریب ہے،۲-ہم عبدالسلام بن حرب کے علاوہ کسی کونہیں جانتے جس نے یہ حدیث روایت کی ہو،۳-جس چیز کو اہل علم نے مستحب قراردیا ہے وہ یہی ہے کہ آدمی صلاۃ کے بعد احرام باندھے۔";
tirmizi.hukam = "";
tirmizi.description = `[819] أن النبيﷺ أھل في دبر الصلاۃ
إسنادہ ضعیف / ن 2755    باب ما جاء متی أحرم النبي ﷺ؟
خصیف ضعیف ( تقدم : 289)`;
tirmizi.anwaar = [211,1];