var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو مُصْعَبٍ قِرَاءَةً عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْرَدَ الْحَجَّ قَالَ وَفِي الْبَاب عَنْ جَابِرٍ وَابْنِ عُمَرَ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہﷺ نے حج افراد ۱؎ کیا۔\nامام ترمذی کہتے ہیں: ۱-عائشہ رضی اللہ عنہا کی حدیث حسن صحیح ہے،۲-اس باب میں جابر اور ابن عمر رضی اللہ عنہم سے بھی احادیث آئی ہیں،۳-بعض اہل علم کا اسی پرعمل ہے";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;