var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ ابْنِ شِهَابٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ وَالضَّحَّاكَ بْنَ قَيْسٍ وَهُمَا يَذْكُرَانِ التَّمَتُّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ فَقَالَ الضَّحَّاكُ بْنُ قَيْسٍ لَا يَصْنَعُ ذَلِكَ إِلَّا مَنْ جَهِلَ أَمْرَ اللَّهِ فَقَالَ سَعْدٌ بِئْسَ مَا قُلْتَ يَا ابْنَ أَخِي فَقَالَ الضَّحَّاكُ بْنُ قَيْسٍ فَإِنَّ عُمَرَ بْنَ الْخَطَّابِ قَدْ نَهَى عَنْ ذَلِكَ فَقَالَ سَعْدٌ قَدْ صَنَعَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَنَعْنَاهَا مَعَهُ قَالَ هَذَا حَدِيثٌ صَحِيحٌ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہا کہتے ہیں کہ رسول اللہﷺ نے حج تمتع کیا ۱؎ اور ابوبکر عمر اور عثمان رضی اللہ عنہم نے بھی ۲؎ اورسب سے پہلے جس نے اس سے روکا وہ معاویہ رضی اللہ عنہ ہیں ۳؎۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[822] تمتع رسول اللّٰہ ﷺ و أبو بکر و عمر
إسنادہ ضعیف باب ما جاء فی التمتع
لیث بن أبي سلیم ضعیف ( تقدم : 218) `;
tirmizi.anwaar = [211,1];