var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْحَجِّ أَفْضَلُ قَالَ الْعَجُّ وَالثَّجُّ";
tirmizi.urdu = "ابوبکرصدیق رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺ سے پوچھاگیا کہ کون ساحج افضل ہے؟ آپ نے فرمایا: 'جس میں کثرت سے تلبیہ پکاراگیا ہو اورخوب خون بہایاگیاہو ' ۱ ؎۔";
tirmizi.hukam = "";
tirmizi.description = `[827] العج والثج
إسنادہ ضعیف/ جہ 2924    باب ما جاء في فضل التلبیۃ والنحر
محمد بن المنکدر لم یسمع من عبد الرحمن کما قال الترمذي وللحدیث شواہد ضعیفۃ۔`;
tirmizi.anwaar = [211,2];