var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَّتَ لِأَهْلِ الْمَشْرِقِ الْعَقِيقَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَمُحَمَّدُ بْنُ عَلِيٍّ هُوَ أبُو جَعْفَرٍ مُحمَّدُ بنُ عَلِيِّ بنِ حُسَيْنِ بنِ عَلِيِّ بنِ أبِي طَالبٍ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہا سے روایت ہے کہ نبی اکرمﷺ نے اہل مشرق کی میقات عقیق ۱؎ مقرر کی۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن ہے،۲-محمد بن علی ہی ابوجعفر محمد بن علی بن حسین بن علی ابن ابی طالب ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[832] أن النبي ﷺ وقت لأھل المشرق
إسنادہ ضعیف / د 1740    باب ما جاء في مواقیت الإحرام لأھل الآفاق`;
tirmizi.anwaar = [212,1];