var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ،عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ،عَنْ عَطَاءٍ،عَنْ يَعْلَى بْنِ أُمَيَّةَ قَالَ: رَأَى النَّبِيُّ ﷺ أَعْرَابِيًّا قَدْ أَحْرَمَ وَعَلَيْهِ جُبَّةٌ فَأَمَرَهُ أَنْ يَنْزِعَهَا.";
tirmizi.urdu = "یعلی بن امیہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرمﷺ نے ایک اعرابی کودیکھا جو احرام کی حالت میں کرتا پہنے ہوئے تھا۔تو آپ نے اسے حکم دیاکہ وہ اسے اتاردے ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;