var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ،عَنْ مَالِكٍ،عَنْ زَيْدِ بْنِ أَسْلَمَ،عَنْ عَطَائِ بْنِ يَسَارٍ،عَنْ أَبِي قَتَادَةَ فِي حِمَارِ الْوَحْشِ،مِثْلَ حَدِيثِ أَبِي النَّضْرِ. غَيْرَ أَنَّ فِي حَدِيثِ زَيْدِ بْنِ أَسْلَمَ أَنَّ رَسُولَ اللهِ ﷺ قَالَ: هَلْ مَعَكُمْ مِنْ لَحْمِهِ شَيْئٌ؟. قَالَ أَبُو عِيسَى: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "اس سند سے بھی ابوقتادہ سے نیل گائے کے بارے میں ابونضرہی کی حدیث کی طرح مروی ہے البتہ زید بن اسلم کی اس حدیث میں اتنا زائد ہے کہ رسول اللہﷺ نے فرمایا:' کیا تمہارے پاس اس کے گوشت میں سے کچھ ہے'۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;