var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا قَبِيصَةُ عَنْ سُفْيَانَ عَنْ ابْنِ جُرَيْجٍ عَنْ عَبْدِ الْحَمِيدِ عَنْ ابْنِ يَعْلَى عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ بِالْبَيْتِ مُضْطَبِعًا وَعَلَيْهِ بُرْدٌ قَالَ أَبُو عِيسَى هَذَا حَدِيثُ الثَّوْرِيِّ عَنْ ابْنِ جُرَيْجٍ وَلَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِهِ وَهُوَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَعَبْدُ الْحَمِيدِ هُوَ ابْنُ جُبَيْرَةَ بْنِ شَيْبَةَ عَنْ ابْنِ يَعْلَى عَنْ أَبِيهِ وَهُوَ يَعْلَى بْنُ أُمَيَّةَ";
tirmizi.urdu = "یعلی بن امیہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے اضطباع کی حالت میں ۱؎ بیت اللہ کا طواف کیا،آپ کے جسم مبارک پرایک چادر تھی۔\nامام ترمذی کہتے ہیں:۱-یہ حدیث حسن صحیح ہے،۲-یہی ثوری کی حدیث ہے جسے انہوں نے ابن جریج سے روایت کی ہے اور اِسے ہم صرف کے اُنہی طریق سے جانتے ہیں،۳-عبدالحمید جبیرہ بن شیبہ کے بیٹے ہیں،جنہوں نے ابن یعلی سے اور ابن یعلی نے اپنے والد سے روایت کی ہے اور یعلی سے مراد یعلی بن امیہ ہیں رضی اللہ عنہ۔";
tirmizi.hukam = "";
tirmizi.description = `[859] أن النبي ﷺ طاف بالبیت مضطبعًا
إسنادہ ضعیف/ د 1883،جہ 2954    باب ما جاء أن النبي ﷺ طاف مضطبعًا
ابن جریج وسفیان الثوري مدلسان وعنعنا۔( ابن جریج،تقدم : 674،سفیان الثوري،تقدم : 746 )`;
tirmizi.anwaar = [212,1];