var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ،حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ،عَنْ شَرِيكٍ،عَنْ أَبِي إِسْحَاقَ،عَنْ عَبْدِ اللهِ ابْنِ سَعِيدِ بْنِ جُبَيْرٍ،عَنْ أَبِيهِ،عَنْ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللهِ ﷺ: مَنْ طَافَ بِالْبَيْتِ خَمْسِينَ مَرَّةً خَرَجَ مِنْ ذُنُوبِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ.\nقَالَ: وَفِي الْبَاب عَنْ أَنَسٍ وَابْنِ عُمَرَ. قَالَ أَبُو عِيسَى: حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ غَرِيبٌ،سَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَقَالَ: إِنَّمَا يُرْوَى هَذَا عَنْ ابْنِ عَبَّاسٍ قَوْلُهُ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہا کہتے ہیں کہ رسول اللہﷺ نے فرمایا:' جس نے بیت اللہ کا طواف پچاس بار کیا تو وہ اپنے گناہوں سے اس طرح نکل آئے گا جیسے اسی دن اس کی ماں نے اسے جنم دیا ہے'۔\nامام ترمذی کہتے ہیں:۱-اس باب میں انس اور ابن عمر رضی اللہ عنہم سے بھی احادیث آئی ہیں،۲-ابن عباس رضی اللہ عنہا کی حدیث غریب ہے،۳-میں نے محمدبن اسماعیل بخاری سے اس حدیث کے بارے میں پوچھا توانہوں نے کہا: یہ تو ابن عباس سے ان کے اپنے قول سے روایت کیا جاتا ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[866] من طاف بالبیت خمسین مرۃ
إسنادہ ضعیف باب ما جاء في فضل الطواف
أبو إسحاق عنعن ( تقدم : 107) `;
tirmizi.anwaar = [212,1];