var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ،حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَيُّوبَ السَّخْتِيَانِيِّ،قَالَ: كَانُوا يَعُدُّونَ عَبْدَاللهِ بْنَ سَعِيدِ بْنِ جُبَيْرٍ أَفْضَلَ مِنْ أَبِيهِ. وَلِعَبْدِ اللهِ أَخٌ يُقَالُ لَهُ عَبْدُالْمَلِكِ ابْنُ سَعِيدِ بْنِ جُبَيْرٍ. وَقَدْ رَوَى عَنْهُ أَيْضًا.";
tirmizi.urdu = "ایوب سختیانی کہتے ہیں کہ لوگ عبداللہ بن سعید بن جبیر کوان کے والد سے افضل شمار کرتے تھے۔اور عبداللہ کے ایک بھائی ہیں جنہیں عبدالملک بن سعید بن جبیر کہتے ہیں۔انہوں نے ان سے بھی روایت کی ہے ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[867] کانوا یعدون عبد اللّٰہ بن سعید بن جبیر
إسنادہ ضعیف باب ما جاء في فضل الطواف
سفیان بن عینۃ مدلس وعنعن ( د 295 ) [ح 871،انظر ص 317 ]`;
tirmizi.anwaar = [212,1];