var tirmizi = {};
tirmizi.arabic = "أَخْبَرَنَا أَبُو مُصْعَبٍ الْمَدَنِيُّ قِرَاءَةً عَنْ عَبْدِ الْعَزِيزِ بْنِ عِمْرَانَ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ فِي رَكْعَتَيْ الطَّوَافِ بِسُورَتَيْ الْإِخْلَاصِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ";
tirmizi.urdu = "جابر بن عبداللہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہﷺ نے طواف کی دورکعت میں اخلاص کی دونوں سورتیں یعنی قُلْ یَا أَیُّہَا الْکَافِرُونَ اور قُلْ ہُوَ اللَّہُ أَحَدٌ پڑھیں ۱؎۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;