var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ،أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَبِي إِسْحَاقَ،عَنْ زَيْدِ بْنِ أُثَيْعٍ،قَالَ: سَأَلْتُ عَلِيًّا بِأَيِّ شَيْئٍ بُعِثْتَ؟ قَالَ: بِأَرْبَعٍ: لاَ يَدْخُلُ الْجَنَّةَ إِلاَّ نَفْسٌ مُسْلِمَةٌ. وَلاَ يَطُوفُ بِالْبَيْتِ عُرْيَانٌ. وَلاَ يَجْتَمِعُ الْمُسْلِمُونَ وَالْمُشْرِكُونَ بَعْدَ عَامِهِمْ هَذَا. وَمَنْ كَانَ بَيْنَهُ وَبَيْنَ النَّبِيِّ ﷺ عَهْدٌ،فَعَهْدُهُ إِلَى مُدَّتِهِ. وَمَنْ لاَ مُدَّةَ لَهُ فَأَرْبَعَةُ أَشْهُرٍ.\nقَالَ: وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ. قَالَ أَبُو عِيسَى: حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ.";
tirmizi.urdu = "زید بن اُثیع کہتے ہیں کہ میں نے علی رضی اللہ عنہ سے پوچھا: آپ کوکن باتوں کاحکم دے کر بھیجاگیاہے؟ ۱؎ انہوں نے کہا:چار باتوں کا: جنت میں صرف وہی جان داخل ہوگی جو مسلمان ہو،بیت اللہ کا طواف کوئی ننگا ہوکرنہ کرے۔مسلمان اور مشرک اس سال کے بعد جمع نہ ہوں،جس کسی کا نبی اکرمﷺ سے کوئی عہد ہوتو اس کایہ عہد اس کی مدت تک کے لیے ہوگا۔اور جس کی کوئی مدت نہ ہو تو اس کی مدت چار ماہ ہے۔\nامام ترمذی کہتے ہیں:۱-علی رضی اللہ عنہ کی حدیث حسن ہے،۲-اس باب میں ابوہریرہ رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[871] بأربع لا یدخل الجنۃ إلا نفس مسلمۃ
سندہ ضعیف،  باب ما جاء في کراہیۃ الطواف عریانًا
أبو إسحاق السبیعي مدلس و لبعضہ شواہد عند الحاکم ( 2/ 331 ح 3275 وسندہ حسن ) وھو یغني عنہ۔`;
tirmizi.anwaar = [317,1];