var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ وَنَصْرُ بْنُ عَلِيٍّ،قَالاَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،عَنْ أَبِي إِسْحَاقَ نَحْوَهُ،وَقَالاَ: زَيْدُ بْنُ يُثَيْعٍ وَهَذَا أَصَحُّ. قَالَ أَبُو عِيسَى: وَشُعْبَةُ وَهِمَ فِيهِ فَقَالَ زَيْدُ بْنُ أُثَيْلٍ.";
tirmizi.urdu = "ہم سے ابن ابی عمراورنصربن علی نے بیان کیا،یہ دونوں کہتے ہیں کہ ہم سے سفیان بن عیینہ نے بیان کیا اورسفیان نے ابواسحاق سبیعی سے اسی طرح کی حدیث روایت کی،البتہ ابن ابی عمر اور نصر بن علی نے (زید بن اثیع کے بجائے) زید بن یثیع کہاہے،اور یہ زیادہ صحیح ہے۔\nامام ترمذی کہتے ہیں: شعبہ کو اس میں وہم ہوا ہے،انہوں نے: زید بن اُثیل کہاہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;