var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا وَكِيعٌ عَنْ إِسْمَعِيلَ بْنِ عَبْدِ الْمَلِكِ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِي وَهُوَ قَرِيرُ الْعَيْنِ طَيِّبُ النَّفْسِ فَرَجَعَ إِلَيَّ وَهُوَ حَزِينٌ فَقُلْتُ لَهُ فَقَالَ إِنِّي دَخَلْتُ الْكَعْبَةَ وَوَدِدْتُ أَنِّي لَمْ أَكُنْ فَعَلْتُ إِنِّي أَخَافُ أَنْ أَكُونَ أَتْعَبْتُ أُمَّتِي مِنْ بَعْدِي قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرمﷺ میرے پاس سے نکل کر گئے،آپ کی آنکھیں ٹھنڈی تھیں اور طبیعت خوش،پھرمیرے پاس لوٹ کر آئے،تو غمگین اور افسردہ تھے،میں نے آپ سے (وجہ) پوچھی،تو آپ نے فرمایا:' میں کعبہ کے اندرگیا۔اورمیری خواہش ہوئی کہ کاش میں نے ایسا نہ کیا ہوتا۔میں ڈررہاہوں کہ اپنے بعد میں نے اپنی امت کوزحمت میں ڈال دیا۔امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[873] إني دخلت الکعبۃ
إسنادہ ضعیف / د 2029،جہ 3064   باب ما جاء في دخول الکعبۃ`;
tirmizi.anwaar = [212,1];