var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ رَجَاءٍ أَبِي يَحْيَى قَال سَمِعْتُ مُسَافِعًا الْحَاجِبَ قَال سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الرُّكْنَ وَالْمَقَامَ يَاقُوتَتَانِ مِنْ يَاقُوتِ الْجَنَّةِ طَمَسَ اللَّهُ نُورَهُمَا وَلَوْ لَمْ يَطْمِسْ نُورَهُمَا لَأَضَاءَتَا مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ قَالَ أَبُو عِيسَى هَذَا يُرْوَى عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو مَوْقُوفًا قَوْلُهُ وَفِيهِ عَنْ أَنَسٍ أَيْضًا وَهُوَ حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "عبداللہ بن عمرو رضی اللہ عنہا کہتے ہیں کہ میں نے رسول اللہﷺ کوفرماتے سنا: ' حجراسود اور مقام ابراہیم دونوں جنت کے یاقوت میں سے دویاقوت ہیں،اللہ نے ان کانورختم کردیا،اگر اللہ ان کانور ختم نہ کرتا تو وہ مشرق ومغرب کے سارے مقام کو روشن کردیتے۔امام ترمذی کہتے ہیں: ۱-یہ حدیث غریب ہے،۲-یہ عبداللہ بن عمرو بن العاص رضی اللہ عنہا سے موقوفاً ان کاقول روایت کیاجاتاہے،۳-اس باب میں انس رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[878] إن الرکن والمقام یاقوتتان من یاقوت الجنۃ
ضعیف    باب ما جاء في فضل الحجر الأسود والرکن والمقام
رجاء بن صبیح : ضعیف ( تق : 1926)وقال العراقي : ضعفہ الجمھور ( تخریج الإحیاء 119/3 ) ولہ متابعۃ ضعیفۃ عند الحاکم (456/1) `;
tirmizi.anwaar = [212,2];