var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ،حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ،حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ،عَنْ أَبِي إِسْحَاقَ،عَنْ عَبْدِاللهِ بْنِ مَالِكٍ أَنَّ ابْنَ عُمَرَ صَلَّى بِجَمْعٍ. فَجَمَعَ بَيْنَ الصَّلاَتَيْنِ بِإِقَامَةٍ. وَقَالَ: رَأَيْتُ رَسُولَ اللهِ ﷺ فَعَلَ مِثْلَ هَذَا،فِي هَذَا الْمَكَانِ";
tirmizi.urdu = "عبداللہ بن مالک کہتے ہیں کہ ابن عمر رضی اللہ عنہا نے مزدلفہ میں صلاۃ پڑھی اورایک اقامت سے مغرب اور عشا کی دونوں صلاتیں ایک ساتھ ملاکر پڑھیں اورکہا: میں نے رسول اللہﷺ کو اس جگہ پر ایسے ہی کرتے دیکھاہے ۱؎۔";
tirmizi.hukam = "";
tirmizi.description = `[887] رأیت رسول اللّٰہ ﷺ فعل مثل ھذا
إسنادہ ضعیف/ د 1929 باب ما جاء فی الجمع بین المغرب والعشاء`;
tirmizi.anwaar = [213,1];