var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ عَنْ الْحَجَّاجِ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي الْجِمَارَ إِذَا زَالَتْ الشَّمْسُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ";
tirmizi.urdu = "عبداللہ بن عباس رضی اللہ عنہا کہتے ہیں کہ رسول اللہﷺ رمی جمار اس وقت کرتے جب سورج ڈھل جاتا ۱؎۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن ہے۔";
tirmizi.hukam = "صحیح";
tirmizi.description = ``;