var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا قُتَيْبَةُ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ عَنْ سُفْيَانَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى هَدْيَهُ مِنْ قُدَيْدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ الثَّوْرِيِّ إِلَّا مِنْ حَدِيثِ يَحْيَى بْنِ الْيَمَانِ وَرُوِيَ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ اشْتَرَى مِنْ قُدَيْدٍ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہا سے روایت ہے کہ نبی اکرمﷺ نے اپناہدی کاجانور قدیدسے خریدا۔\nامام ترمذی کہتے ہیں: یہ حدیث غریب ہے،ہم اسے ثوری کی حدیث سے صرف یحیی بن یمان ہی کی روایت سے جانتے ہیں: اورنافع سے مروی ہے کہ ابن عمرنے قدید ۱؎ سے خریدا،اور یہ زیادہ صحیح ہے ۲؎۔";
tirmizi.hukam = "";
tirmizi.description = `[907] أن النبيﷺ اشتری ھدیہ من قدید
إسنادہ ضعیف/ جہ 3102    باب [اشتراء الھدي]
سفیان الثوري عنعن ( تقدم : 746) ویحیی بن الیمان یخطئ کثیرًا ( تقدم : 239 )`;
tirmizi.anwaar = [213,1];