var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ الْكُوفِيُّ،حَدَّثَنَا أَبُو مُعَاوِيَةَ،عَنْ مُحَمَّدِ بْنِ سُوقَةَ،عَنْ مُحَمَّدِ ابْنِ الْمُنْكَدِرِ،عَنْ جَابِرِ بْنِ عَبْدِ اللهِ،قَالَ: رَفَعَتْ امْرَأَةٌ صَبِيًّا لَهَا إِلَى رَسُولِ اللهِ ﷺ،فَقَالَتْ: يَا رَسُولَ اللهِ! أَلِهَذَا حَجٌّ؟ قَالَ: نَعَمْ،وَلَكِ أَجْرٌ.\nقَالَ: وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ. حَدِيثُ جَابِرٍ حَدِيثٌ غَرِيبٌ";
tirmizi.urdu = "جابر بن عبداللہ رضی اللہ عنہا کہتے ہیں کہ ایک عورت نے اپنے بچّے کورسول اللہﷺ کی طرف اٹھاکرپوچھا: اللہ کے رسول! کیا اس پربھی حج ہے؟آپ نے فرمایا:' ہاں،اوراجر تجھے ملے گا' ۱؎۔\nامام ترمذی کہتے ہیں: ۱-جابر کی حدیث غریب ہے،۲-اس باب میں ابن عباس رضی اللہ عنہا سے بھی روایت ہے۔";
tirmizi.hukam = "إسنادہ صحیح";
tirmizi.description = ``;