var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ فَرْقَدٍ السَّبَخِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدَّهِنُ بِالزَّيْتِ وَهُوَ مُحْرِمٌ غَيْرِ الْمُقَتَّتِ قَالَ أَبُو عِيسَى الْمُقَتَّتُ الْمُطَيَّبُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ فَرْقَدٍ السَّبَخِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ وَقَدْ تَكَلَّمَ يَحْيَى بْنُ سَعِيدٍ فِي فَرْقَدٍ السَّبَخِيِّ وَرَوَى عَنْهُ النَّاسُ";
tirmizi.urdu = "عبداللہ بن عمر رضی اللہ عنہا سے روایت ہے کہ نبی اکرمﷺ حالت احرام میں زیتون کا تیل لگاتے تھے اوریہ (تیل) بغیر خوشبو کے ہوتاتھا ۱؎۔امام ترمذی کہتے ہیں:۱-یہ حدیث غریب ہے،اسے ہم صرف فرقدسبخی کی روایت سے جانتے ہیں،اورفرقدنے سعید بن جبیر سے روایت کی ہے۔یحییٰ بن سعید نے فرقد سبخی کے سلسلے میں کلام کیا ہے،اورفرقدسے لوگوں نے روایت کی ہے،۲-مقتت کے معنی خوشبو دار کے ہیں۔";
tirmizi.hukam = "";
tirmizi.description = `[962] کان یدھن بالزیت وھو محرم
إسنادہ ضعیف / جہ 3083   [باب ادَّھان المحرم بالزیت]
فرقدالسبخي : ضعیف من جھۃ حفظہ،ضعفہ الجمہور وفی التحریر (5384) : ’’ضعیف‘‘ والحدیث صوابہ موقوف کما في صحیح البخاري (1538) `;
tirmizi.anwaar = [213,2];