var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حُسَامُ بْنُ الْمِصَكِّ قَالَ حَدَّثَنَا أَبُو مَعْشَرٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَال سَمِعْتُ عَبْدَ اللَّهِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ نَفْسَ الْمُؤْمِنُ تَخْرُجُ رَشْحًا وَلَا أُحِبُّ مَوْتًا كَمَوْتِ الْحِمَارِ قِيلَ وَمَا مَوْتُ الْحِمَارِ قَالَ مَوْتُ الْفَجْأَةِ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے سناہے:' مومن کی جان تھوڑاتھوڑا کرکے نکلتی ہے جیسے جسم سے پسینہ نکلتاہے اور مجھے گدھے جیسی موت پسندنہیں '۔عرض کیاگیا: گدھے کی موت کیا ہے؟ آپ نے فرمایا:'اچانک موت '۔";
tirmizi.hukam = "";
tirmizi.description = `[980] إن نفس المؤمن تخرج رشحًا
ضعیف    باب ما جاء فی التشدید عند الموت
حسام بن مصک : ضعیف یکاد أن یترک ( تق : 1193) وللحدیث شواہد ضعیفۃ۔`;
tirmizi.anwaar = [214,1];