var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا مُبَشِّرُ بْنُ إِسْمَعِيلَ الْحَلَبِيُّ عَنْ تَمَّامِ بْنِ نَجِيحٍ عَنْ الْحَسَنِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ حَافِظَيْنِ رَفَعَا إِلَى اللَّهِ مَا حَفِظَا مِنْ لَيْلٍ أَوْ نَهَارٍ فَيَجِدُ اللَّهُ فِي أَوَّلِ الصَّحِيفَةِ وَفِي آخِرِ الصَّحِيفَةِ خَيْرًا إِلَّا قَالَ اللَّهُ تَعَالَى أُشْهِدُكُمْ أَنِّي قَدْ غَفَرْتُ لِعَبْدِي مَا بَيْنَ طَرَفَيْ الصَّحِيفَةِ";
tirmizi.urdu = "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ نے فرمایا:' جب بھی دونوں لکھنے والے (فرشتے) دن ورات کسی کے عمل کو لکھ کر اللہ کے پاس لے جاتے ہیں اوراللہ تعالیٰ دفترکے شروع اوراخیرمیں خیر(نیک کام) لکھاہوا پاتاہے توفرماتاہے: میں تم لوگوں کو گواہ بناتاہوں کہ میں نے اپنے بندکے سارے گناہ معاف کردینے جو اس دفترکے دونوں کناروں شروع اوراخیرکے درمیان میں ہیں'۔";
tirmizi.hukam = "";
tirmizi.description = `[981] ما من حافظین رفعا إلی اللّٰہ
إسنادہ ضعیف باب [في فضل حسنات طرفي اللیل والنھار]
تمام بن نجیح: ضعیف ( د 4854) `;
tirmizi.anwaar = [214,1];