var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ،حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ وَهَارُونُ بْنُ الْمُغِيرَةِ،عَنْ عَنْبَسَةَ،عَنْ أَبِي حَمْزَةَ،عَنْ إِبْرَاهِيمَ،عَنْ عَلْقَمَةَ،عَنْ عَبْدِاللهِ،عَنْ النَّبِيِّ ﷺ قَالَ: إِيَّاكُمْ وَالنَّعْيَ،فَإِنَّ النَّعْيَ مِنْ عَمَلِ الْجَاهِلِيَّةِ. قَالَ عَبْدُاللهِ: وَالنَّعْيُ أَذَانٌ بِالْمَيِّتِ. وَفِي الْبَاب عَنْ حُذَيْفَةَ";
tirmizi.urdu = "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ نبی اکرمﷺ نے فرمایا:' نعی(موت کی خبر دینے) ۱؎ سے بچو،کیونکہ نعی جاہلیت کا عمل ہے'۔عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں: نعی کا مطلب میت کی موت کا اعلان ہے۔\nامام ترمذی کہتے ہیں: اس باب میں حذیفہ رضی اللہ عنہ سے بھی روایت ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[984۔985] إیاکم والنعي فإن النعي من عمل الجاھلیۃ
إسنادہ ضعیف باب ما جاء في کراہیۃ النعي
أبو حمزۃ مسلم بن کیسان الأعور ضعیف (تق : 6641) `;
tirmizi.anwaar = [214,1];