var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ بَكْرِ بْنِ خُنَيْسٍ حَدَّثَنَا حَبِيبُ بْنُ سُلَيْمٍ الْعَبْسِيُّ عَنْ بِلَالِ بْنِ يَحْيَى الْعَبْسِيِّ عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ قَالَ إِذَا مِتُّ فَلَا تُؤْذِنُوا بِي إِنِّي أَخَافُ أَنْ يَكُونَ نَعْيًا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ النَّعْيِ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "حذیفہ بن الیمان رضی اللہ عنہ سے روایت ہے کہ انہوں نے کہا: جب میں مرجاؤں تو تم میرے مرنے کا اعلان مت کرنا۔مجھے ڈر ہے کہ یہ بات نعی ہوگی۔کیونکہ میں نے رسول اللہ ﷺ کو نعی سے منع فرماتے سنا ہے۔\nامام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔";
tirmizi.hukam = "";
tirmizi.description = `[986] إذا مت فلا تؤذنوا بي أحدًا
إسنادہ ضعیف / جہ 1476   باب ما جاء في کراہیۃ النعي
في سماع بلال بن یحیی من حذیفۃ رضي اللّٰہ عنہ نظر،واللّٰہ أعلم۔`;
tirmizi.anwaar = [214,1];