var tirmizi = {};
tirmizi.arabic = "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبَّلَ عُثْمَانَ بْنَ مَظْعُونٍ وَهُوَ مَيِّتٌ وَهُوَ يَبْكِي أَوْ قَالَ عَيْنَاهُ تَذْرِفَانِ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَجَابِرٍ وَعَائِشَةَ قَالُوا إِنَّ أَبَا بَكْرٍ قَبَّلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مَيِّتٌ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ";
tirmizi.urdu = "ام المومنین عائشہ رضی اللہ عنہا کہتی ہیں: نبی اکرمﷺ نے عثمان بن مظعون رضی اللہ عنہ کا بوسہ لیا-وہ انتقال کرچکے تھے-آپ رو رہے تھے۔یا (راوی نے) کہا: آپ کی دونوں آنکھیں اشک بار تھیں ۱؎۔\nامام ترمذی کہتے ہیں: ۱-عائشہ کی حدیث حسن صحیح ہے،۲-اس باب میں ابن عباس،جابر اور عائشہ سے بھی احادیث آئی ہیں،وہ کہتے ہیں کہ ابوبکر رضی اللہ عنہ نے نبی اکرمﷺ کا بوسہ لیا ۲؎ اور آپ انتقال فرماچکے تھے۔";
tirmizi.hukam = "";
tirmizi.description = `[989] أن النبي ﷺ قبّل عثمان بن مظعون
إسنادہ ضعیف/ د 3163،جہ 1456   باب ما جاء في تقبیل المیت`;
tirmizi.anwaar = [214,1];